/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
pub struct _Tp {
    pub _address: u8,
}

pub type _Pred = ();

#[allow(improper_ctypes, non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[repr(C)]
    #[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
    pub struct __BindgenBitfieldUnit<Storage> {
        storage: Storage,
    }
    impl<Storage> __BindgenBitfieldUnit<Storage> {
        #[inline]
        pub const fn new(storage: Storage) -> Self {
            Self { storage }
        }
    }
    impl<Storage> __BindgenBitfieldUnit<Storage>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        #[inline]
        pub fn get_bit(&self, index: usize) -> bool {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = self.storage.as_ref()[byte_index];
            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)
            } else {
                index % 8
            };
            let mask = 1 << bit_index;
            byte & mask == mask
        }
        #[inline]
        pub fn set_bit(&mut self, index: usize, val: bool) {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = &mut self.storage.as_mut()[byte_index];
            let bit_index = if cfg!(target_endian = "big") {

        pub const float_round_style_round_to_nearest: root::std::float_round_style = 1;
        pub const float_round_style_round_toward_infinity: root::std::float_round_style = 2;
        pub const float_round_style_round_toward_neg_infinity: root::std::float_round_style = 3;
        pub type float_round_style = ::std::os::raw::c_int;
        pub const float_denorm_style_denorm_indeterminate: root::std::float_denorm_style = -1;
        pub const float_denorm_style_denorm_absent: root::std::float_denorm_style = 0;
        pub const float_denorm_style_denorm_present: root::std::float_denorm_style = 1;
        pub type float_denorm_style = ::std::os::raw::c_int;
        pub type __libcpp_numeric_limits_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct numeric_limits {
            pub _address: u8,
        }
        pub type numeric_limits___base = u8;
        pub type numeric_limits_type = u8;
        extern "C" {
            pub static is_specialized: bool;
        }
        extern "C" {
            pub static digits: ::std::os::raw::c_int;
        }
        extern "C" {
            pub static digits10: ::std::os::raw::c_int;
        }
        extern "C" {
            pub static max_digits10: ::std::os::raw::c_int;
        }
        extern "C" {
            pub static is_signed: bool;
        }
        extern "C" {
            pub static is_integer: bool;
        }
        extern "C" {
            pub static is_exact: bool;
        }
        extern "C" {
            pub static radix: ::std::os::raw::c_int;
        }
        extern "C" {
            pub static min_exponent: ::std::os::raw::c_int;
        }
        extern "C" {
            pub static min_exponent10: ::std::os::raw::c_int;
        }
        extern "C" {
            pub static max_exponent: ::std::os::raw::c_int;
        }
        extern "C" {
            pub static max_exponent10: ::std::os::raw::c_int;
        }
        extern "C" {
            pub static has_infinity: bool;
        }
        extern "C" {
            pub static has_quiet_NaN: bool;
        }
        extern "C" {
            pub static has_signaling_NaN: bool;
        }
        extern "C" {
            pub static has_denorm: root::std::float_denorm_style;
        }
        extern "C" {
            pub static has_denorm_loss: bool;
        }
        extern "C" {
            pub static is_iec559: bool;
        }
        extern "C" {
            pub static is_bounded: bool;
        }
        extern "C" {
            pub static is_modulo: bool;
        }
        extern "C" {
            pub static traps: bool;
        }
        extern "C" {
            pub static tinyness_before: bool;
        }
        extern "C" {
            pub static round_style: root::std::float_round_style;
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __nat {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __nat"][::std::mem::size_of::<__nat>() - 1usize];
            ["Alignment of __nat"][::std::mem::align_of::<__nat>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __type_list {
            pub _address: u8,
        }
        pub type __type_list__Head = u8;
        pub type __type_list__Tail = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __align_type {
            pub _address: u8,
        }
        pub type __align_type_type = u8;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __struct_double {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of __struct_double"][::std::mem::size_of::<__struct_double>() - 8usize];
            ["Alignment of __struct_double"][::std::mem::align_of::<__struct_double>() - 8usize];
        };
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __struct_double4 {
            pub _bindgen_opaque_blob: [u64; 4usize],
        }
        const _: () = {
            ["Size of __struct_double4"][::std::mem::size_of::<__struct_double4>() - 32usize];
            ["Alignment of __struct_double4"][::std::mem::align_of::<__struct_double4>() - 8usize];
        };
        pub type __all_types = u8;
        extern "C" {
            #[link_name = "\u{1}__min"]
            pub static __select_align___min: ::std::os::raw::c_ulong;
        }
        extern "C" {
            #[link_name = "\u{1}__max"]
            pub static __select_align___max: ::std::os::raw::c_ulong;
        }
        extern "C" {
            #[link_name = "\u{1}value"]
            pub static __select_align_value: ::std::os::raw::c_ulong;
        }
        pub type aligned_storage__Aligner = u8;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Copy, Clone)]
        pub union aligned_storage_type {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of aligned_storage_type"]
                [::std::mem::size_of::<aligned_storage_type>() - 8usize];
            ["Alignment of aligned_storage_type"]
                [::std::mem::align_of::<aligned_storage_type>() - 8usize];
        };
        pub type aligned_storage_t = u8;
        pub type aligned_union_type = u8;
        pub type aligned_union_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct alignment_of {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_volatile {
            pub _address: u8,
        }
        pub type __apply_cv_impl___apply = u8;
        pub type __apply_cv_t = u8;
        pub type __remove_const_ref_t = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __extract_key_fail_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __extract_key_fail_tag"]
                [::std::mem::size_of::<__extract_key_fail_tag>() - 1usize];
            ["Alignment of __extract_key_fail_tag"]
                [::std::mem::align_of::<__extract_key_fail_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __extract_key_self_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __extract_key_self_tag"]
                [::std::mem::size_of::<__extract_key_self_tag>() - 1usize];
            ["Alignment of __extract_key_self_tag"]
                [::std::mem::align_of::<__extract_key_self_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __extract_key_first_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __extract_key_first_tag"]
                [::std::mem::size_of::<__extract_key_first_tag>() - 1usize];
            ["Alignment of __extract_key_first_tag"]
                [::std::mem::align_of::<__extract_key_first_tag>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __can_extract_key {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __can_extract_map_key {
            pub _address: u8,
        }
        pub type __expand_to_true = u8;
        pub type _And = u8;
        pub type _Or = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct remove_all_extents {
            pub _address: u8,
        }
        pub type remove_all_extents_type = u8;
        pub type __remove_all_extents_t = u8;
        pub type remove_all_extents_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct has_virtual_destructor {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_base_of {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_core_convertible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_member_pointer {
            pub _address: u8,
        }
        pub const __libcpp_is_member_pointer___is_member:
            root::std::__libcpp_is_member_pointer__bindgen_ty_1 = 0;
        pub const __libcpp_is_member_pointer___is_func:
            root::std::__libcpp_is_member_pointer__bindgen_ty_1 = 0;
        pub const __libcpp_is_member_pointer___is_obj:
            root::std::__libcpp_is_member_pointer__bindgen_ty_1 = 0;
        pub type __libcpp_is_member_pointer__bindgen_ty_1 = i32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_member_function_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_member_object_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_reference_wrapper_impl {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_reference_wrapper {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __any {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __any"][::std::mem::size_of::<__any>() - 1usize];
            ["Alignment of __any"][::std::mem::align_of::<__any>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15__anyC1Ez"]
            pub fn __any___any(this: *mut root::std::__any, ...);
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __member_pointer_traits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __member_pointer_class_type {
            pub _address: u8,
        }
        pub type __enable_if_bullet1 = u8;
        pub type __enable_if_bullet2 = u8;
        pub type __enable_if_bullet3 = u8;
        pub type __enable_if_bullet4 = u8;
        pub type __enable_if_bullet5 = u8;
        pub type __enable_if_bullet6 = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __invokable_r {
            pub _address: u8,
        }
        pub type __invokable_r__Result = u8;
        pub type __invokable_r_type = u8;
        pub type __invokable = u8;
        pub type __nothrow_invokable_r = u8;
        pub type __nothrow_invokable = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __invoke_of {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_abstract {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_bounded_array {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_callable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_standard_layout {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivial {
            pub _address: u8,
        }
        pub type _IsCharLikeType = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_class {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_nullptr_t_impl {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_nullptr_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_null_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_fundamental {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_compound {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_copy_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_copy_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_destructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_empty {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_final {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_final {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_implicitly_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_literal_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_member_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_move_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_move_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_nothrow_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_nothrow_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _Lazy {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_nothrow_copy_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_nothrow_copy_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_nothrow_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_scalar {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_nothrow_destructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_nothrow_move_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_nothrow_move_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_union {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_object {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_pod {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_polymorphic {
            pub _address: u8,
        }
        pub type __swap_result_t = u8;
        pub mod __detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            pub type __swappable_with___swap1 = u8;
            pub type __swappable_with___swap2 = u8;
            pub const __detail___block_size: root::std::__detail::_bindgen_ty_1 = 64;
            pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_swappable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_nothrow_swappable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivially_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivially_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivially_copy_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivially_copy_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivially_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivially_destructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivially_move_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_trivially_move_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_unbounded_array {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_unsigned {
            pub _address: u8,
        }
        pub type __make_signed_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct make_signed {
            pub _address: u8,
        }
        pub type make_signed_type = u8;
        pub type make_signed_t = u8;
        pub type __make_unsigned_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct make_unsigned {
            pub _address: u8,
        }
        pub type make_unsigned_type = u8;
        pub type make_unsigned_t = u8;
        pub type __copy_unsigned_t = u8;
        pub type __maybe_const = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _Not {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct rank {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct remove_pointer {
            pub _address: u8,
        }
        pub type remove_pointer_type = u8;
        pub type __remove_pointer_t = u8;
        pub type remove_pointer_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct result_of {
            pub _address: u8,
        }
        pub type result_of_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __type_identity {
            pub _address: u8,
        }
        pub type __type_identity_type = u8;
        pub type __type_identity_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __unwrap_reference {
            pub _address: u8,
        }
        pub type __unwrap_reference_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __unwrap_ref_decay {
            pub _address: u8,
        }
        extern "C" {
            #[link_name = "\u{1}value"]
            pub static __static_gcd_value: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}value"]
            pub static __static_lcm_value: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}value"]
            pub static __static_abs_value: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}value"]
            pub static __static_sign_value: ::std::os::raw::c_long;
        }
        pub const __ll_mul_nan: ::std::os::raw::c_long = -9223372036854775808;
        pub const __ll_mul_min: ::std::os::raw::c_long = -9223372036854775807;
        pub const __ll_mul_max: ::std::os::raw::c_long = 9223372036854775807;
        extern "C" {
            #[link_name = "\u{1}__a_x"]
            pub static __ll_mul___a_x: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}__a_y"]
            pub static __ll_mul___a_y: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}value"]
            pub static __ll_mul_value: ::std::os::raw::c_long;
        }
        pub const __ll_div_nan: ::std::os::raw::c_long = -9223372036854775808;
        pub const __ll_div_min: ::std::os::raw::c_long = -9223372036854775807;
        pub const __ll_div_max: ::std::os::raw::c_long = 9223372036854775807;
        extern "C" {
            #[link_name = "\u{1}value"]
            pub static __ll_div_value: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}__na"]
            pub static ratio___na: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}__da"]
            pub static ratio___da: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}__s"]
            pub static ratio___s: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}__gcd"]
            pub static ratio___gcd: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}num"]
            pub static ratio_num: ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}den"]
            pub static ratio_den: ::std::os::raw::c_long;
        }
        extern "C" {
            pub static num: ::std::os::raw::c_long;
        }
        extern "C" {
            pub static den: ::std::os::raw::c_long;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_ratio {
            pub _address: u8,
        }
        pub type atto = u8;
        pub type femto = u8;
        pub type pico = u8;
        pub type nano = u8;
        pub type micro = u8;
        pub type milli = u8;
        pub type centi = u8;
        pub type deci = u8;
        pub type deca = u8;
        pub type hecto = u8;
        pub type kilo = u8;
        pub type mega = u8;
        pub type giga = u8;
        pub type tera = u8;
        pub type peta = u8;
        pub type exa = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __ratio_multiply {
            pub _address: u8,
        }
        pub type __ratio_multiply_type = u8;
        pub type ratio_multiply = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __ratio_divide {
            pub _address: u8,
        }
        pub type __ratio_divide_type = u8;
        pub type ratio_divide = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __ratio_add {
            pub _address: u8,
        }
        pub type __ratio_add_type = u8;
        pub type ratio_add = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __ratio_subtract {
            pub _address: u8,
        }
        pub type __ratio_subtract_type = u8;
        pub type ratio_subtract = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ratio_equal {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ratio_not_equal {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ratio_less {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ratio_less_equal {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ratio_greater {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ratio_greater_equal {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __ratio_gcd {
            pub _address: u8,
        }
        pub type __ratio_gcd_type = u8;
        pub mod chrono {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __is_duration {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct treat_as_floating_point {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct duration_values {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct duration {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct duration___no_overflow {
                pub _address: u8,
            }
            pub type duration___no_overflow_type = u8;
            pub type duration_rep = u8;
            pub type duration_period = u8;
            pub type nanoseconds = u64;
            pub type microseconds = u64;
            pub type milliseconds = u64;
            pub type seconds = u64;
            pub type minutes = u64;
            pub type hours = u64;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __duration_eq {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __duration_lt {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct time_point {
                pub _address: u8,
            }
            pub type time_point_clock = u8;
            pub type time_point_duration = u8;
            pub type time_point_rep = u8;
            pub type time_point_period = u8;
            #[repr(C)]
            #[repr(align(1))]
            #[derive(Debug, Copy, Clone)]
            pub struct steady_clock {
                pub _bindgen_opaque_blob: u8,
            }
            pub type steady_clock_duration = u64;
            pub type steady_clock_rep = u64;
            pub type steady_clock_period = u8;
            pub type steady_clock_time_point = u64;
            const _: () = {
                ["Size of steady_clock"][::std::mem::size_of::<steady_clock>() - 1usize];
                ["Alignment of steady_clock"][::std::mem::align_of::<steady_clock>() - 1usize];
            };
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__16chrono12steady_clock3nowEv"]
                pub fn steady_clock_now() -> root::std::chrono::steady_clock_time_point;
            }
            impl steady_clock {
                #[inline]
                pub unsafe fn now() -> root::std::chrono::steady_clock_time_point {
                    steady_clock_now()
                }
            }
            pub const steady_clock_is_steady: bool = true;
            #[repr(C)]
            #[repr(align(1))]
            #[derive(Debug, Copy, Clone)]
            pub struct system_clock {
                pub _bindgen_opaque_blob: u8,
            }
            pub type system_clock_duration = u64;
            pub type system_clock_rep = u64;
            pub type system_clock_period = u8;
            pub type system_clock_time_point = u64;
            const _: () = {
                ["Size of system_clock"][::std::mem::size_of::<system_clock>() - 1usize];
                ["Alignment of system_clock"][::std::mem::align_of::<system_clock>() - 1usize];
            };
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__16chrono12system_clock3nowEv"]
                pub fn system_clock_now() -> root::std::chrono::system_clock_time_point;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__16chrono12system_clock9to_time_tERKNS0_10time_pointIS1_NS0_8durationIxNS_5ratioILl1ELl1000000EEEEEEE"]
                pub fn system_clock_to_time_t(
                    __t: *const root::std::chrono::system_clock_time_point,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__16chrono12system_clock11from_time_tEl"]
                pub fn system_clock_from_time_t(
                    __t: ::std::os::raw::c_long,
                ) -> root::std::chrono::system_clock_time_point;
            }
            impl system_clock {
                #[inline]
                pub unsafe fn now() -> root::std::chrono::system_clock_time_point {
                    system_clock_now()
                }
                #[inline]
                pub unsafe fn to_time_t(
                    __t: *const root::std::chrono::system_clock_time_point,
                ) -> ::std::os::raw::c_long {
                    system_clock_to_time_t(__t)
                }
                #[inline]
                pub unsafe fn from_time_t(
                    __t: ::std::os::raw::c_long,
                ) -> root::std::chrono::system_clock_time_point {
                    system_clock_from_time_t(__t)
                }
            }
            pub const system_clock_is_steady: bool = false;
            pub type high_resolution_clock = u8;
        }
        pub const __libcpp_polling_count: ::std::os::raw::c_int = 64;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __spinning_backoff_policy {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __spinning_backoff_policy"]
                [::std::mem::size_of::<__spinning_backoff_policy>() - 1usize];
            ["Alignment of __spinning_backoff_policy"]
                [::std::mem::align_of::<__spinning_backoff_policy>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __numeric_type {
            pub _address: u8,
        }
        pub type __numeric_type_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __promote {
            pub _address: u8,
        }
        pub type __libcpp_mutex_t = [u64; 8usize];
        pub type __libcpp_recursive_mutex_t = [u64; 8usize];
        pub type __libcpp_condvar_t = [u64; 6usize];
        pub type __libcpp_exec_once_flag = [u64; 2usize];
        pub type __libcpp_thread_id = u64;
        pub type __libcpp_thread_t = u64;
        pub type __libcpp_tls_key = u64;
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_oneEPVKv"]
            pub fn __cxx_atomic_notify_one(arg1: *const ::std::os::raw::c_void);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_allEPVKv"]
            pub fn __cxx_atomic_notify_all(arg1: *const ::std::os::raw::c_void);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__123__libcpp_atomic_monitorEPVKv"]
            pub fn __libcpp_atomic_monitor(
                arg1: *const ::std::os::raw::c_void,
            ) -> root::std::__cxx_contention_t;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__120__libcpp_atomic_waitEPVKvx"]
            pub fn __libcpp_atomic_wait(
                arg1: *const ::std::os::raw::c_void,
                arg2: root::std::__cxx_contention_t,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_oneEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
            pub fn __cxx_atomic_notify_one1(arg1: *const root::std::__cxx_atomic_contention_t);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_allEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
            pub fn __cxx_atomic_notify_all1(arg1: *const root::std::__cxx_atomic_contention_t);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__123__libcpp_atomic_monitorEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
            pub fn __libcpp_atomic_monitor1(
                arg1: *const root::std::__cxx_atomic_contention_t,
            ) -> root::std::__cxx_contention_t;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__120__libcpp_atomic_waitEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEEx"]
            pub fn __libcpp_atomic_wait1(
                arg1: *const root::std::__cxx_atomic_contention_t,
                arg2: root::std::__cxx_contention_t,
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_atomic_wait_backoff_impl {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __cxx_atomic_wait_test_fn_impl {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct atomic {
            pub _address: u8,
        }
        pub type atomic___base = u8;
        pub type atomic_value_type = u8;
        pub type atomic_difference_type = u8;
        pub type atomic_bool = u8;
        pub type atomic_char = u8;
        pub type atomic_schar = u8;
        pub type atomic_uchar = u8;
        pub type atomic_short = u8;
        pub type atomic_ushort = u8;
        pub type atomic_int = u8;
        pub type atomic_uint = u8;
        pub type atomic_long = u8;
        pub type atomic_ulong = u8;
        pub type atomic_llong = u8;
        pub type atomic_ullong = u8;
        pub type atomic_char16_t = u8;
        pub type atomic_char32_t = u8;
        pub type atomic_wchar_t = u8;
        pub type atomic_int_least8_t = u8;
        pub type atomic_uint_least8_t = u8;
        pub type atomic_int_least16_t = u8;
        pub type atomic_uint_least16_t = u8;
        pub type atomic_int_least32_t = u8;
        pub type atomic_uint_least32_t = u8;
        pub type atomic_int_least64_t = u8;
        pub type atomic_uint_least64_t = u8;
        pub type atomic_int_fast8_t = u8;
        pub type atomic_uint_fast8_t = u8;
        pub type atomic_int_fast16_t = u8;
        pub type atomic_uint_fast16_t = u8;
        pub type atomic_int_fast32_t = u8;
        pub type atomic_uint_fast32_t = u8;
        pub type atomic_int_fast64_t = u8;
        pub type atomic_uint_fast64_t = u8;
        pub type atomic_int8_t = u8;
        pub type atomic_uint8_t = u8;
        pub type atomic_int16_t = u8;
        pub type atomic_uint16_t = u8;
        pub type atomic_int32_t = u8;
        pub type atomic_uint32_t = u8;
        pub type atomic_int64_t = u8;
        pub type atomic_uint64_t = u8;
        pub type atomic_intptr_t = u8;
        pub type atomic_uintptr_t = u8;
        pub type atomic_size_t = u8;
        pub type atomic_ptrdiff_t = u8;
        pub type atomic_intmax_t = u8;
        pub type atomic_uintmax_t = u8;
        pub type __libcpp_signed_lock_free = u64;
        pub type __libcpp_unsigned_lock_free = u64;
        pub type atomic_signed_lock_free = u8;
        pub type atomic_unsigned_lock_free = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct atomic_flag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of atomic_flag"][::std::mem::size_of::<atomic_flag>() - 1usize];
            ["Alignment of atomic_flag"][::std::mem::align_of::<atomic_flag>() - 1usize];
        };
        pub type __move_if_noexcept_result_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __exception_guard_exceptions {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __exception_guard_noexceptions {
            pub _address: u8,
        }
        pub type __exception_guard = u8;
        pub type __integer_sequence___convert = u8;
        pub type __integer_sequence___to_tuple_indices = u8;
        pub type __make_indices_imp = u8;
        pub type integer_sequence_value_type = u8;
        pub type index_sequence = u8;
        pub type __make_integer_sequence = u8;
        pub type make_integer_sequence = u8;
        pub type make_index_sequence = u8;
        pub type index_sequence_for = u8;
        pub type __make_tuple_indices_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_types {
            pub _address: u8,
        }
        pub type tuple_element_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple_size {
            pub _address: u8,
        }
        pub type __enable_if_tuple_size_imp = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __make_tuple_types_flat {
            pub _address: u8,
        }
        pub type __make_tuple_types__RawTp = u8;
        pub type __make_tuple_types__Maker = u8;
        pub type __make_tuple_types_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_like_ext {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_sfinae_base {
            pub _bindgen_opaque_blob: u8,
        }
        pub type __tuple_sfinae_base___constructible = u8;
        pub type __tuple_sfinae_base___convertible = u8;
        pub type __tuple_sfinae_base___assignable = u8;
        const _: () = {
            ["Size of __tuple_sfinae_base"][::std::mem::size_of::<__tuple_sfinae_base>() - 1usize];
            ["Alignment of __tuple_sfinae_base"]
                [::std::mem::align_of::<__tuple_sfinae_base>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __check_tuple_constructor_fail {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __check_tuple_constructor_fail"]
                [::std::mem::size_of::<__check_tuple_constructor_fail>() - 1usize];
            ["Alignment of __check_tuple_constructor_fail"]
                [::std::mem::align_of::<__check_tuple_constructor_fail>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct piecewise_construct_t {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of piecewise_construct_t"]
                [::std::mem::size_of::<piecewise_construct_t>() - 1usize];
            ["Alignment of piecewise_construct_t"]
                [::std::mem::align_of::<piecewise_construct_t>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__1L19piecewise_constructE"]
            pub static piecewise_construct: root::std::piecewise_construct_t;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __non_trivially_copyable_base {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct pair {
            pub _address: u8,
        }
        pub type pair_first_type = u8;
        pub type pair_second_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct pair__CheckArgs {
            pub _address: u8,
        }
        pub type pair__CheckArgsDep = u8;
        pub mod pmr {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct polymorphic_allocator {
                pub _address: u8,
            }
        }
        pub type string = [u64; 3usize];
        pub type wstring = [u64; 3usize];
        pub type u16string = [u64; 3usize];
        pub type u32string = [u64; 3usize];
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_filebuf {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_ifstream {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_ofstream {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_fstream {
            pub _address: u8,
        }
        pub type filebuf = u8;
        pub type ifstream = u8;
        pub type ofstream = u8;
        pub type fstream = u8;
        pub type wfilebuf = u8;
        pub type wifstream = u8;
        pub type wofstream = u8;
        pub type wfstream = u8;
        pub type ios = [u64; 19usize];
        pub type wios = [u64; 19usize];
        pub type streamoff = u64;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_istream {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_iostream {
            pub _address: u8,
        }
        pub type istream = u8;
        pub type iostream = u8;
        pub type wistream = u8;
        pub type wiostream = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_ostream {
            pub _address: u8,
        }
        pub type ostream = u8;
        pub type wostream = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_stringbuf {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_istringstream {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_ostringstream {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_stringstream {
            pub _address: u8,
        }
        pub type stringbuf = u8;
        pub type istringstream = u8;
        pub type ostringstream = u8;
        pub type stringstream = u8;
        pub type wstringbuf = u8;
        pub type wistringstream = u8;
        pub type wostringstream = u8;
        pub type wstringstream = u8;
        pub type streambuf = [u64; 8usize];
        pub type wstreambuf = [u64; 8usize];
        pub type streampos = u8;
        pub type wstreampos = u8;
        pub type u16streampos = u8;
        pub type u32streampos = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __save_flags {
            pub _address: u8,
        }
        pub type __save_flags___stream_type = u8;
        pub type __save_flags_fmtflags = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_trivial_equality_predicate {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __equal_to {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __equal_to"][::std::mem::size_of::<__equal_to>() - 1usize];
            ["Alignment of __equal_to"][::std::mem::align_of::<__equal_to>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __less {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_signed_integer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_unsigned_integer {
            pub _address: u8,
        }
        pub type _IsValidExpansion = u8;
        pub type __test_for_primary_template = u8;
        pub type __is_primary_template = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct input_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of input_iterator_tag"][::std::mem::size_of::<input_iterator_tag>() - 1usize];
            ["Alignment of input_iterator_tag"]
                [::std::mem::align_of::<input_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct output_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of output_iterator_tag"][::std::mem::size_of::<output_iterator_tag>() - 1usize];
            ["Alignment of output_iterator_tag"]
                [::std::mem::align_of::<output_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct forward_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of forward_iterator_tag"]
                [::std::mem::size_of::<forward_iterator_tag>() - 1usize];
            ["Alignment of forward_iterator_tag"]
                [::std::mem::align_of::<forward_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct bidirectional_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of bidirectional_iterator_tag"]
                [::std::mem::size_of::<bidirectional_iterator_tag>() - 1usize];
            ["Alignment of bidirectional_iterator_tag"]
                [::std::mem::align_of::<bidirectional_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct random_access_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of random_access_iterator_tag"]
                [::std::mem::size_of::<random_access_iterator_tag>() - 1usize];
            ["Alignment of random_access_iterator_tag"]
                [::std::mem::align_of::<random_access_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __iter_traits_cache {
            pub _address: u8,
        }
        pub type __iter_traits_cache_type = u8;
        pub type _ITER_TRAITS = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __iter_concept_concept_test {
            pub _bindgen_opaque_blob: u8,
        }
        pub type __iter_concept_concept_test__Apply = u8;
        const _: () = {
            ["Size of __iter_concept_concept_test"]
                [::std::mem::size_of::<__iter_concept_concept_test>() - 1usize];
            ["Alignment of __iter_concept_concept_test"]
                [::std::mem::align_of::<__iter_concept_concept_test>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __iter_concept_category_test {
            pub _bindgen_opaque_blob: u8,
        }
        pub type __iter_concept_category_test__Apply = u8;
        const _: () = {
            ["Size of __iter_concept_category_test"]
                [::std::mem::size_of::<__iter_concept_category_test>() - 1usize];
            ["Alignment of __iter_concept_category_test"]
                [::std::mem::align_of::<__iter_concept_category_test>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __iter_concept_random_fallback {
            pub _bindgen_opaque_blob: u8,
        }
        pub type __iter_concept_random_fallback__Apply = u8;
        const _: () = {
            ["Size of __iter_concept_random_fallback"]
                [::std::mem::size_of::<__iter_concept_random_fallback>() - 1usize];
            ["Alignment of __iter_concept_random_fallback"]
                [::std::mem::align_of::<__iter_concept_random_fallback>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __test_iter_concept {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __iter_concept_cache {
            pub _address: u8,
        }
        pub type __iter_concept_cache_type = u8;
        pub type _ITER_CONCEPT = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_iterator_typedefs {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_iterator_category {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_iterator_concept {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct iterator_traits {
            pub _address: u8,
        }
        pub type iterator_traits___primary_template = u8;
        pub type __has_input_iterator_category = u8;
        pub type __has_forward_iterator_category = u8;
        pub type __has_bidirectional_iterator_category = u8;
        pub type __has_random_access_iterator_category = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_contiguous_iterator {
            pub _address: u8,
        }
        pub type __has_exactly_input_iterator_category = u8;
        pub type __has_exactly_forward_iterator_category = u8;
        pub type __has_exactly_bidirectional_iterator_category = u8;
        pub type __iter_value_type = u8;
        pub type __iter_key_type = u8;
        pub type __iter_mapped_type = u8;
        pub type __iter_to_alloc_type = u8;
        pub type __iterator_category_type = u8;
        pub type __iterator_pointer_type = u8;
        pub type __iter_diff_t = u8;
        pub type __iter_reference = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_element_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_difference_type {
            pub _address: u8,
        }
        pub type __pointer_traits_difference_type_type = u64;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_rebind {
            pub _address: u8,
        }
        pub type __pointer_traits_rebind_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct pointer_traits {
            pub _address: u8,
        }
        pub type pointer_traits_pointer = u8;
        pub type pointer_traits_element_type = u8;
        pub type pointer_traits_difference_type = u8;
        pub type pointer_traits_rebind = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct pointer_traits___nat {
            pub _address: u8,
        }
        pub type __rebind_pointer_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _HasToAddress {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _HasArrow {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _IsFancyPointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __to_address_helper {
            pub _address: u8,
        }
        pub type __sfinae_underlying_type_type = u8;
        pub type __sfinae_underlying_type___promoted_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _IterOps {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct _ClassicAlgPolicy {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of _ClassicAlgPolicy"][::std::mem::size_of::<_ClassicAlgPolicy>() - 1usize];
            ["Alignment of _ClassicAlgPolicy"]
                [::std::mem::align_of::<_ClassicAlgPolicy>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_identity {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __identity {
            pub _bindgen_opaque_blob: u8,
        }
        pub type __identity_is_transparent = u8;
        const _: () = {
            ["Size of __identity"][::std::mem::size_of::<__identity>() - 1usize];
            ["Alignment of __identity"][::std::mem::align_of::<__identity>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct binary_function {
            pub _address: u8,
        }
        pub type binary_function_first_argument_type = u8;
        pub type binary_function_second_argument_type = u8;
        pub type binary_function_result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __binary_function_keep_layout_base {
            pub _address: u8,
        }
        pub type __binary_function_keep_layout_base_first_argument_type = u8;
        pub type __binary_function_keep_layout_base_second_argument_type = u8;
        pub type __binary_function_keep_layout_base_result_type = u8;
        pub type __binary_function = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct binary_negate {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unary_function {
            pub _address: u8,
        }
        pub type unary_function_argument_type = u8;
        pub type unary_function_result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __unary_function_keep_layout_base {
            pub _address: u8,
        }
        pub type __unary_function_keep_layout_base_argument_type = u8;
        pub type __unary_function_keep_layout_base_result_type = u8;
        pub type __unary_function = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_result_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __derives_from_unary_function {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __derives_from_unary_function___two {
            pub _address: u8,
        }
        pub type __derives_from_unary_function_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __derives_from_binary_function {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __derives_from_binary_function___two {
            pub _address: u8,
        }
        pub type __derives_from_binary_function_type = u8;
        pub type __weak_result_type_imp_result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __weak_result_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __invoke_return {
            pub _address: u8,
        }
        pub type __invoke_return_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_allocator_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct uses_allocator {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_arg_t {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of allocator_arg_t"][::std::mem::size_of::<allocator_arg_t>() - 1usize];
            ["Alignment of allocator_arg_t"][::std::mem::align_of::<allocator_arg_t>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__1L13allocator_argE"]
            pub static allocator_arg: root::std::allocator_arg_t;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __uses_alloc_ctor_imp {
            pub _address: u8,
        }
        pub type __uses_alloc_ctor_imp__RawAlloc = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __uses_alloc_ctor {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __all_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_impl {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple {
            pub _address: u8,
        }
        pub type tuple__BaseT = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple__IsThisTuple {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple__EnableUTypesCtor {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple__EnableCtorFromUTypesTuple {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple__CtorPredicateFromPair {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple__EnableCtorFromPair {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple__NothrowConstructibleFromPair {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tuple__BothImplicitlyConvertible {
            pub _address: u8,
        }
        pub mod __find_detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__113__find_detailL11__not_foundE"]
                pub static __not_found: ::std::os::raw::c_ulong;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__113__find_detailL11__ambiguousE"]
                pub static __ambiguous: ::std::os::raw::c_ulong;
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __find_exactly_one_checked {
                pub _address: u8,
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __find_exactly_one_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __ignore_t {
            pub _address: u8,
        }
        pub mod _bindgen_mod_id_40010 {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112_GLOBAL__N_16ignoreE"]
                pub static ignore: u8;
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_cat_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_cat_return {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_cat_return_ref_imp {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_cat_return_ref {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __tuple_cat {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_bind_expression {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_placeholder {
            pub _address: u8,
        }
        pub mod placeholders {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_1E"]
                pub static _1: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_2E"]
                pub static _2: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_3E"]
                pub static _3: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_4E"]
                pub static _4: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_5E"]
                pub static _5: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_6E"]
                pub static _6: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_7E"]
                pub static _7: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_8E"]
                pub static _8: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders2_9E"]
                pub static _9: u8;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__112placeholders3_10E"]
                pub static _10: u8;
            }
        }
        pub type __mu_return_invokable_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __mu_return {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_valid_bind_return {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __bind {
            pub _address: u8,
        }
        pub type __bind__Fd = u8;
        pub type __bind__Td = u8;
        pub type __bind___indices = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __bind_r {
            pub _address: u8,
        }
        pub type __bind_r_base = u8;
        pub type __bind_r__Fd = u8;
        pub type __bind_r__Td = u8;
        pub type __bind_r_result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct binder1st {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct binder2nd {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct _PairT {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of _PairT"][::std::mem::size_of::<_PairT>() - 16usize];
            ["Alignment of _PairT"][::std::mem::align_of::<_PairT>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct hash {
            pub _address: u8,
        }
        pub type __check_hash_requirements = u8;
        pub type __has_enabled_hash = u8;
        pub type __enable_hash_helper = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_trivial_plus_operation {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct plus {
            pub _address: u8,
        }
        pub type plus___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct minus {
            pub _address: u8,
        }
        pub type minus___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct multiplies {
            pub _address: u8,
        }
        pub type multiplies___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct divides {
            pub _address: u8,
        }
        pub type divides___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct modulus {
            pub _address: u8,
        }
        pub type modulus___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct negate {
            pub _address: u8,
        }
        pub type negate___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct bit_and {
            pub _address: u8,
        }
        pub type bit_and___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct bit_not {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct bit_or {
            pub _address: u8,
        }
        pub type bit_or___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct bit_xor {
            pub _address: u8,
        }
        pub type bit_xor___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct equal_to {
            pub _address: u8,
        }
        pub type equal_to___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct not_equal_to {
            pub _address: u8,
        }
        pub type not_equal_to___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct less {
            pub _address: u8,
        }
        pub type less___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct less_equal {
            pub _address: u8,
        }
        pub type less_equal___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct greater_equal {
            pub _address: u8,
        }
        pub type greater_equal___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct greater {
            pub _address: u8,
        }
        pub type greater___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct logical_and {
            pub _address: u8,
        }
        pub type logical_and___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct logical_not {
            pub _address: u8,
        }
        pub type logical_not___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct logical_or {
            pub _address: u8,
        }
        pub type logical_or___result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct reference_wrapper {
            pub _address: u8,
        }
        pub type reference_wrapper_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_pointer {
            pub _address: u8,
        }
        pub type __pointer_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_const_pointer {
            pub _address: u8,
        }
        pub type __const_pointer_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_void_pointer {
            pub _address: u8,
        }
        pub type __void_pointer_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_const_void_pointer {
            pub _address: u8,
        }
        pub type __const_void_pointer_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_size_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_alloc_traits_difference_type {
            pub _address: u8,
        }
        pub type __alloc_traits_difference_type_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_propagate_on_container_copy_assignment {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_propagate_on_container_move_assignment {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_propagate_on_container_swap {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_is_always_equal {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_rebind_other {
            pub _address: u8,
        }
        pub type __allocator_traits_rebind_type = u8;
        pub type __allocator_traits_rebind_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_allocate_hint {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_construct_impl {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_construct {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_destroy {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_max_size {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_select_on_container_copy_construction {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_traits {
            pub _address: u8,
        }
        pub type allocator_traits_allocator_type = u8;
        pub type allocator_traits_value_type = u8;
        pub type allocator_traits_pointer = u8;
        pub type allocator_traits_const_pointer = u8;
        pub type allocator_traits_void_pointer = u8;
        pub type allocator_traits_const_void_pointer = u8;
        pub type allocator_traits_difference_type = u8;
        pub type allocator_traits_size_type = u8;
        pub type allocator_traits_propagate_on_container_copy_assignment = u8;
        pub type allocator_traits_propagate_on_container_move_assignment = u8;
        pub type allocator_traits_propagate_on_container_swap = u8;
        pub type allocator_traits_is_always_equal = u8;
        pub type allocator_traits_rebind_alloc = u8;
        pub type allocator_traits_rebind_traits = u8;
        pub type __rebind_alloc = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_default_allocator {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_cpp17_move_insertable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_cpp17_copy_insertable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __allocation_guard {
            pub _address: u8,
        }
        pub type __allocation_guard__Pointer = u8;
        pub type __allocation_guard__Size = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __allocation_result {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator {
            pub _address: u8,
        }
        pub type allocator_size_type = u64;
        pub type allocator_difference_type = u64;
        pub type allocator_value_type = u8;
        pub type allocator_propagate_on_container_move_assignment = u8;
        pub type allocator_is_always_equal = u8;
        pub type allocator_pointer = u8;
        pub type allocator_const_pointer = u8;
        pub type allocator_reference = u8;
        pub type allocator_const_reference = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_rebind {
            pub _address: u8,
        }
        pub type allocator_rebind_other = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __allocator_destructor {
            pub _address: u8,
        }
        pub type __allocator_destructor___alloc_traits = u8;
        pub type __allocator_destructor_pointer = u8;
        pub type __allocator_destructor_size_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct auto_ptr_ref {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct auto_ptr {
            pub _address: u8,
        }
        pub type auto_ptr_element_type = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __default_init_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __default_init_tag"][::std::mem::size_of::<__default_init_tag>() - 1usize];
            ["Alignment of __default_init_tag"]
                [::std::mem::align_of::<__default_init_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __value_init_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __value_init_tag"][::std::mem::size_of::<__value_init_tag>() - 1usize];
            ["Alignment of __value_init_tag"][::std::mem::align_of::<__value_init_tag>() - 1usize];
        };
        pub type __compressed_pair_elem__ParamT = u8;
        pub type __compressed_pair_elem_reference = u8;
        pub type __compressed_pair_elem_const_reference = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __compressed_pair {
            pub _address: u8,
        }
        pub type __compressed_pair__Base1 = u8;
        pub type __compressed_pair__Base2 = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_datasizeof {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_datasizeof__FirstPaddingByte {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_always_bitcastable {
            pub _address: u8,
        }
        pub type __is_always_bitcastable__UnqualFrom = u8;
        pub type __is_always_bitcastable__UnqualTo = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_equality_comparable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_trivially_equality_comparable_impl {
            pub _address: u8,
        }
        pub type __libcpp_is_trivially_equality_comparable = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_is_trivially_lexicographically_comparable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_less_than_comparable {
            pub _address: u8,
        }
        pub type __element_count = ::std::os::raw::c_ulong;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __can_lower_copy_assignment_to_memmove {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __can_lower_move_assignment_to_memmove {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __overload {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __can_rewrap {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __segmented_iterator_traits {
            pub _address: u8,
        }
        pub type __is_segmented_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __debug_less {
            pub _address: u8,
        }
        pub type __comp_ref_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __copy_loop {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __copy_loop__CopySegment {
            pub _address: u8,
        }
        pub type __copy_loop__CopySegment__Traits = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __copy_trivial {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __copy_trivial"][::std::mem::size_of::<__copy_trivial>() - 1usize];
            ["Alignment of __copy_trivial"][::std::mem::align_of::<__copy_trivial>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __move_loop {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __move_loop__MoveSegment {
            pub _address: u8,
        }
        pub type __move_loop__MoveSegment__Traits = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __move_trivial {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __move_trivial"][::std::mem::size_of::<__move_trivial>() - 1usize];
            ["Alignment of __move_trivial"][::std::mem::align_of::<__move_trivial>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct iterator {
            pub _address: u8,
        }
        pub type iterator_value_type = u8;
        pub type iterator_difference_type = u8;
        pub type iterator_pointer = u8;
        pub type iterator_reference = u8;
        pub type iterator_iterator_category = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct reverse_iterator {
            pub _address: u8,
        }
        pub type reverse_iterator_iterator_type = u8;
        pub type reverse_iterator_iterator_category = u8;
        pub type reverse_iterator_pointer = u8;
        pub type reverse_iterator_value_type = u8;
        pub type reverse_iterator_difference_type = u8;
        pub type reverse_iterator_reference = u8;
        pub type __unconstrained_reverse_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __unwrap_reverse_iter_impl {
            pub _address: u8,
        }
        pub type __unwrap_reverse_iter_impl__UnwrappedIter = u8;
        pub type __unwrap_reverse_iter_impl__ReverseWrapper = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __unreachable_sentinel {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __unreachable_sentinel"]
                [::std::mem::size_of::<__unreachable_sentinel>() - 1usize];
            ["Alignment of __unreachable_sentinel"]
                [::std::mem::align_of::<__unreachable_sentinel>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _AllocatorDestroyRangeReverse {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __allocator_has_trivial_copy_construct {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __allocator_has_trivial_move_construct {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct default_delete {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __unique_ptr_deleter_sfinae {
            pub _address: u8,
        }
        pub type __unique_ptr_deleter_sfinae___lval_ref_type = u8;
        pub type __unique_ptr_deleter_sfinae___good_rval_ref_type = u8;
        pub type __unique_ptr_deleter_sfinae___enable_rval_overload = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unique_ptr {
            pub _address: u8,
        }
        pub type unique_ptr_element_type = u8;
        pub type unique_ptr_deleter_type = u8;
        pub type unique_ptr_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unique_ptr___nat {
            pub _address: u8,
        }
        pub type unique_ptr__DeleterSFINAE = u8;
        pub type unique_ptr__LValRefType = u8;
        pub type unique_ptr__GoodRValRefType = u8;
        pub type unique_ptr__BadRValRefType = u8;
        pub type unique_ptr__EnableIfDeleterDefaultConstructible = u8;
        pub type unique_ptr__EnableIfDeleterConstructible = u8;
        pub type unique_ptr__EnableIfMoveConvertible = u8;
        pub type unique_ptr__EnableIfDeleterConvertible = u8;
        pub type unique_ptr__EnableIfDeleterAssignable = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __unique_if {
            pub _address: u8,
        }
        pub type __unique_if___unique_single = u8;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_refstring {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of __libcpp_refstring"][::std::mem::size_of::<__libcpp_refstring>() - 8usize];
            ["Alignment of __libcpp_refstring"]
                [::std::mem::align_of::<__libcpp_refstring>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__121__throw_runtime_errorEPKc"]
            pub fn __throw_runtime_error(arg1: *const ::std::os::raw::c_char);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_weak_ptr {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_weak_ptr"][::std::mem::size_of::<bad_weak_ptr>() - 8usize];
            ["Alignment of bad_weak_ptr"][::std::mem::align_of::<bad_weak_ptr>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112bad_weak_ptrD1Ev"]
            pub fn bad_weak_ptr_bad_weak_ptr_destructor(this: *mut root::std::bad_weak_ptr);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__112bad_weak_ptr4whatEv"]
            pub fn bad_weak_ptr_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __shared_count {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of __shared_count"][::std::mem::size_of::<__shared_count>() - 16usize];
            ["Alignment of __shared_count"][::std::mem::align_of::<__shared_count>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__114__shared_countD1Ev"]
            pub fn __shared_count___shared_count_destructor(this: *mut root::std::__shared_count);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __shared_weak_count {
            pub _bindgen_opaque_blob: [u64; 3usize],
        }
        const _: () = {
            ["Size of __shared_weak_count"][::std::mem::size_of::<__shared_weak_count>() - 24usize];
            ["Alignment of __shared_weak_count"]
                [::std::mem::align_of::<__shared_weak_count>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__119__shared_weak_count14__release_weakEv"]
            pub fn __shared_weak_count___release_weak(this: *mut root::std::__shared_weak_count);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__119__shared_weak_count4lockEv"]
            pub fn __shared_weak_count_lock(
                this: *mut root::std::__shared_weak_count,
            ) -> *mut root::std::__shared_weak_count;
        }
        impl __shared_weak_count {
            #[inline]
            pub unsafe fn __release_weak(&mut self) {
                __shared_weak_count___release_weak(self)
            }
            #[inline]
            pub unsafe fn lock(&mut self) -> *mut root::std::__shared_weak_count {
                __shared_weak_count_lock(self)
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__119__shared_weak_countD1Ev"]
            pub fn __shared_weak_count___shared_weak_count_destructor(
                this: *mut root::std::__shared_weak_count,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"]
            pub fn __shared_weak_count___get_deleter(
                this: *mut ::std::os::raw::c_void,
                arg1: *const root::std::type_info,
            ) -> *const ::std::os::raw::c_void;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __shared_ptr_pointer {}
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __for_overwrite_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __for_overwrite_tag"][::std::mem::size_of::<__for_overwrite_tag>() - 1usize];
            ["Alignment of __for_overwrite_tag"]
                [::std::mem::align_of::<__for_overwrite_tag>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __shared_ptr_emplace {}
        pub type __shared_ptr_emplace__CompressedPair = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __shared_ptr_emplace__Storage {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __shared_ptr_dummy_rebind_allocator_type {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __compatible_with {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __raw_pointer_compatible_with {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_deletable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_array_deletable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __well_formed_deleter {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __shared_ptr_deleter_ctor_reqs {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct shared_ptr {
            pub _address: u8,
        }
        pub type shared_ptr_element_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct shared_ptr___shared_ptr_default_delete {
            pub _address: u8,
        }
        pub type shared_ptr___shared_ptr_default_allocator_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct weak_ptr {
            pub _address: u8,
        }
        pub type weak_ptr_element_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct owner_less {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct enable_shared_from_this {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __sp_mut {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of __sp_mut"][::std::mem::size_of::<__sp_mut>() - 8usize];
            ["Alignment of __sp_mut"][::std::mem::align_of::<__sp_mut>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18__sp_mut4lockEv"]
            pub fn __sp_mut_lock(this: *mut root::std::__sp_mut);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18__sp_mut6unlockEv"]
            pub fn __sp_mut_unlock(this: *mut root::std::__sp_mut);
        }
        impl __sp_mut {
            #[inline]
            pub unsafe fn lock(&mut self) {
                __sp_mut_lock(self)
            }
            #[inline]
            pub unsafe fn unlock(&mut self) {
                __sp_mut_unlock(self)
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112__get_sp_mutEPKv"]
            pub fn __get_sp_mut(arg1: *const ::std::os::raw::c_void) -> *mut root::std::__sp_mut;
        }
        pub type array___self = u8;
        pub type array_value_type = u8;
        pub type array_reference = u8;
        pub type array_const_reference = u8;
        pub type array_iterator = u8;
        pub type array_const_iterator = u8;
        pub type array_pointer = u8;
        pub type array_const_pointer = u8;
        pub type array_size_type = u64;
        pub type array_difference_type = u64;
        pub type array_reverse_iterator = u8;
        pub type array_const_reverse_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __copy_backward_loop {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __copy_backward_trivial {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __copy_backward_trivial"]
                [::std::mem::size_of::<__copy_backward_trivial>() - 1usize];
            ["Alignment of __copy_backward_trivial"]
                [::std::mem::align_of::<__copy_backward_trivial>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __move_backward_loop {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __move_backward_trivial {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __move_backward_trivial"]
                [::std::mem::size_of::<__move_backward_trivial>() - 1usize];
            ["Alignment of __move_backward_trivial"]
                [::std::mem::align_of::<__move_backward_trivial>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __destruct_n {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of __destruct_n"][::std::mem::size_of::<__destruct_n>() - 8usize];
            ["Alignment of __destruct_n"][::std::mem::align_of::<__destruct_n>() - 8usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __return_temporary_buffer {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __return_temporary_buffer"]
                [::std::mem::size_of::<__return_temporary_buffer>() - 1usize];
            ["Alignment of __return_temporary_buffer"]
                [::std::mem::align_of::<__return_temporary_buffer>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __invert {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _ConstTimeDistance {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _MinmaxElementLessFunc {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_simple_comparator {
            pub _address: u8,
        }
        pub type __use_branchless_sort = u8;
        pub type __is_any_of = u8;
        pub type __sort_is_specialized_in_library = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _ProjectedPred {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct move_iterator {
            pub _address: u8,
        }
        pub type move_iterator_iterator_type = u8;
        pub type move_iterator_iterator_category = u8;
        pub type move_iterator_value_type = u8;
        pub type move_iterator_difference_type = u8;
        pub type move_iterator_pointer = u8;
        pub type move_iterator___reference = u8;
        pub type move_iterator_reference = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __stable_sort_switch {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __wrap_iter {
            pub _address: u8,
        }
        pub type __wrap_iter_iterator_type = u8;
        pub type __wrap_iter_value_type = u8;
        pub type __wrap_iter_difference_type = u8;
        pub type __wrap_iter_pointer = u8;
        pub type __wrap_iter_reference = u8;
        pub type __wrap_iter_iterator_category = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_random_is_valid_inttype {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_random_is_valid_urng {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __independent_bits_engine {
            pub _address: u8,
        }
        pub type __independent_bits_engine_result_type = u8;
        pub type __independent_bits_engine__Engine_result_type = u8;
        pub type __independent_bits_engine__Working_result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct uniform_int_distribution {
            pub _address: u8,
        }
        pub type uniform_int_distribution_result_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct uniform_int_distribution_param_type {
            pub _address: u8,
        }
        pub type uniform_int_distribution_param_type_distribution_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __set_intersection_result {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __set_symmetric_difference_result {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __set_union_result {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __libcpp_debug_randomizer {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        pub type __libcpp_debug_randomizer_result_type = u32;
        const _: () = {
            ["Size of __libcpp_debug_randomizer"]
                [::std::mem::size_of::<__libcpp_debug_randomizer>() - 16usize];
            ["Alignment of __libcpp_debug_randomizer"]
                [::std::mem::align_of::<__libcpp_debug_randomizer>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__125__libcpp_debug_randomizer4_MinE"]
            pub static __libcpp_debug_randomizer__Min:
                root::std::__libcpp_debug_randomizer_result_type;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__125__libcpp_debug_randomizer4_MaxE"]
            pub static __libcpp_debug_randomizer__Max:
                root::std::__libcpp_debug_randomizer_result_type;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18__rs_getEv"]
            pub fn __rs_get() -> root::std::__rs_default;
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __rs_default {
            pub _bindgen_opaque_blob: u8,
        }
        pub type __rs_default_result_type = u32;
        const _: () = {
            ["Size of __rs_default"][::std::mem::size_of::<__rs_default>() - 1usize];
            ["Alignment of __rs_default"][::std::mem::align_of::<__rs_default>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112__rs_defaultC1ERKS0_"]
            pub fn __rs_default___rs_default(
                this: *mut root::std::__rs_default,
                arg1: *const root::std::__rs_default,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112__rs_defaultD1Ev"]
            pub fn __rs_default___rs_default_destructor(this: *mut root::std::__rs_default);
        }
        impl __rs_default {
            #[inline]
            pub unsafe fn new(arg1: *const root::std::__rs_default) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                __rs_default___rs_default(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                __rs_default___rs_default_destructor(self)
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112__rs_default4__c_E"]
            pub static mut __rs_default___c_: ::std::os::raw::c_uint;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112__rs_default4_MinE"]
            pub static __rs_default__Min: root::std::__rs_default_result_type;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112__rs_default4_MaxE"]
            pub static __rs_default__Max: root::std::__rs_default_result_type;
        }
        pub mod __unique_copy_tags {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[repr(align(1))]
            #[derive(Debug, Copy, Clone)]
            pub struct __reread_from_input_tag {
                pub _bindgen_opaque_blob: u8,
            }
            const _: () = {
                ["Size of __reread_from_input_tag"]
                    [::std::mem::size_of::<__reread_from_input_tag>() - 1usize];
                ["Alignment of __reread_from_input_tag"]
                    [::std::mem::align_of::<__reread_from_input_tag>() - 1usize];
            };
            #[repr(C)]
            #[repr(align(1))]
            #[derive(Debug, Copy, Clone)]
            pub struct __reread_from_output_tag {
                pub _bindgen_opaque_blob: u8,
            }
            const _: () = {
                ["Size of __reread_from_output_tag"]
                    [::std::mem::size_of::<__reread_from_output_tag>() - 1usize];
                ["Alignment of __reread_from_output_tag"]
                    [::std::mem::align_of::<__reread_from_output_tag>() - 1usize];
            };
            #[repr(C)]
            #[repr(align(1))]
            #[derive(Debug, Copy, Clone)]
            pub struct __read_from_tmp_value_tag {
                pub _bindgen_opaque_blob: u8,
            }
            const _: () = {
                ["Size of __read_from_tmp_value_tag"]
                    [::std::mem::size_of::<__read_from_tmp_value_tag>() - 1usize];
                ["Alignment of __read_from_tmp_value_tag"]
                    [::std::mem::align_of::<__read_from_tmp_value_tag>() - 1usize];
            };
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct back_insert_iterator {
            pub _address: u8,
        }
        pub type back_insert_iterator_iterator_category = u8;
        pub type back_insert_iterator_value_type = u8;
        pub type back_insert_iterator_difference_type = u8;
        pub type back_insert_iterator_pointer = u8;
        pub type back_insert_iterator_reference = u8;
        pub type back_insert_iterator_container_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __bounded_iter {
            pub _address: u8,
        }
        pub type __bounded_iter_value_type = u8;
        pub type __bounded_iter_difference_type = u8;
        pub type __bounded_iter_pointer = u8;
        pub type __bounded_iter_reference = u8;
        pub type __bounded_iter_iterator_category = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct front_insert_iterator {
            pub _address: u8,
        }
        pub type front_insert_iterator_iterator_category = u8;
        pub type front_insert_iterator_value_type = u8;
        pub type front_insert_iterator_difference_type = u8;
        pub type front_insert_iterator_pointer = u8;
        pub type front_insert_iterator_reference = u8;
        pub type front_insert_iterator_container_type = u8;
        pub type __insert_iterator_iter_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct insert_iterator {
            pub _address: u8,
        }
        pub type insert_iterator_iterator_category = u8;
        pub type insert_iterator_value_type = u8;
        pub type insert_iterator_difference_type = u8;
        pub type insert_iterator_pointer = u8;
        pub type insert_iterator_reference = u8;
        pub type insert_iterator_container_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct istream_iterator {
            pub _address: u8,
        }
        pub type istream_iterator_iterator_category = u8;
        pub type istream_iterator_value_type = u8;
        pub type istream_iterator_difference_type = u8;
        pub type istream_iterator_pointer = u8;
        pub type istream_iterator_reference = u8;
        pub type istream_iterator_char_type = u8;
        pub type istream_iterator_traits_type = u8;
        pub type istream_iterator_istream_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct istreambuf_iterator {
            pub _address: u8,
        }
        pub type istreambuf_iterator_iterator_category = u8;
        pub type istreambuf_iterator_value_type = u8;
        pub type istreambuf_iterator_difference_type = u8;
        pub type istreambuf_iterator_pointer = u8;
        pub type istreambuf_iterator_reference = u8;
        pub type istreambuf_iterator_char_type = u8;
        pub type istreambuf_iterator_traits_type = u8;
        pub type istreambuf_iterator_int_type = u8;
        pub type istreambuf_iterator_streambuf_type = u8;
        pub type istreambuf_iterator_istream_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct istreambuf_iterator___proxy {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ostream_iterator {
            pub _address: u8,
        }
        pub type ostream_iterator_iterator_category = u8;
        pub type ostream_iterator_value_type = u8;
        pub type ostream_iterator_difference_type = u8;
        pub type ostream_iterator_pointer = u8;
        pub type ostream_iterator_reference = u8;
        pub type ostream_iterator_char_type = u8;
        pub type ostream_iterator_traits_type = u8;
        pub type ostream_iterator_ostream_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ostreambuf_iterator {
            pub _address: u8,
        }
        pub type ostreambuf_iterator_iterator_category = u8;
        pub type ostreambuf_iterator_value_type = u8;
        pub type ostreambuf_iterator_difference_type = u8;
        pub type ostreambuf_iterator_pointer = u8;
        pub type ostreambuf_iterator_reference = u8;
        pub type ostreambuf_iterator_char_type = u8;
        pub type ostreambuf_iterator_traits_type = u8;
        pub type ostreambuf_iterator_streambuf_type = u8;
        pub type ostreambuf_iterator_ostream_type = u8;
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15alignEmmRPvRm"]
            pub fn align(
                __align: ::std::os::raw::c_ulong,
                __sz: ::std::os::raw::c_ulong,
                __ptr: *mut *mut ::std::os::raw::c_void,
                __space: *mut ::std::os::raw::c_ulong,
            ) -> *mut ::std::os::raw::c_void;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct raw_storage_iterator {
            pub _address: u8,
        }
        pub type raw_storage_iterator_iterator_category = u8;
        pub type raw_storage_iterator_value_type = u8;
        pub type raw_storage_iterator_difference_type = u8;
        pub type raw_storage_iterator_pointer = u8;
        pub type raw_storage_iterator_reference = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_transparent {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_hash_value_type_imp {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_hash_value_type {
            pub _address: u8,
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112__next_primeEm"]
            pub fn __next_prime(__n: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_node_base {
            pub _address: u8,
        }
        pub type __hash_node_base___node_type = u8;
        pub type __hash_node_base___first_node = u8;
        pub type __hash_node_base___node_base_pointer = u8;
        pub type __hash_node_base___node_pointer = u8;
        pub type __hash_node_base___next_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_node {
            pub _address: u8,
        }
        pub type __hash_node___node_value_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_key_value_types {
            pub _address: u8,
        }
        pub type __hash_key_value_types_key_type = u8;
        pub type __hash_key_value_types___node_value_type = u8;
        pub type __hash_key_value_types___container_value_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_node_types {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_node_types_from_iterator {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __make_hash_node_types {
            pub _address: u8,
        }
        pub type __make_hash_node_types__NodeTp = u8;
        pub type __make_hash_node_types__NodePtr = u8;
        pub type __make_hash_node_types_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_iterator {
            pub _address: u8,
        }
        pub type __hash_iterator__NodeTypes = u8;
        pub type __hash_iterator___node_pointer = u8;
        pub type __hash_iterator___next_pointer = u8;
        pub type __hash_iterator_iterator_category = u8;
        pub type __hash_iterator_value_type = u8;
        pub type __hash_iterator_difference_type = u8;
        pub type __hash_iterator_reference = u8;
        pub type __hash_iterator_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_const_iterator {
            pub _address: u8,
        }
        pub type __hash_const_iterator__NodeTypes = u8;
        pub type __hash_const_iterator___node_pointer = u8;
        pub type __hash_const_iterator___next_pointer = u8;
        pub type __hash_const_iterator___non_const_iterator = u8;
        pub type __hash_const_iterator_iterator_category = u8;
        pub type __hash_const_iterator_value_type = u8;
        pub type __hash_const_iterator_difference_type = u8;
        pub type __hash_const_iterator_reference = u8;
        pub type __hash_const_iterator_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_local_iterator {
            pub _address: u8,
        }
        pub type __hash_local_iterator__NodeTypes = u8;
        pub type __hash_local_iterator___node_pointer = u8;
        pub type __hash_local_iterator___next_pointer = u8;
        pub type __hash_local_iterator_iterator_category = u8;
        pub type __hash_local_iterator_value_type = u8;
        pub type __hash_local_iterator_difference_type = u8;
        pub type __hash_local_iterator_reference = u8;
        pub type __hash_local_iterator_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_const_local_iterator {
            pub _address: u8,
        }
        pub type __hash_const_local_iterator__NodeTypes = u8;
        pub type __hash_const_local_iterator___node_pointer = u8;
        pub type __hash_const_local_iterator___next_pointer = u8;
        pub type __hash_const_local_iterator___pointer_traits = u8;
        pub type __hash_const_local_iterator___node = u8;
        pub type __hash_const_local_iterator___non_const_node = u8;
        pub type __hash_const_local_iterator___non_const_node_pointer = u8;
        pub type __hash_const_local_iterator___non_const_iterator = u8;
        pub type __hash_const_local_iterator_iterator_category = u8;
        pub type __hash_const_local_iterator_value_type = u8;
        pub type __hash_const_local_iterator_difference_type = u8;
        pub type __hash_const_local_iterator_reference = u8;
        pub type __hash_const_local_iterator_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __bucket_list_deallocator {
            pub _address: u8,
        }
        pub type __bucket_list_deallocator_allocator_type = u8;
        pub type __bucket_list_deallocator___alloc_traits = u8;
        pub type __bucket_list_deallocator_size_type = u8;
        pub type __bucket_list_deallocator_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_node_destructor {
            pub _address: u8,
        }
        pub type __hash_node_destructor_allocator_type = u8;
        pub type __hash_node_destructor___alloc_traits = u8;
        pub type __hash_node_destructor_pointer = u8;
        pub type __hash_node_destructor__NodeTypes = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __enforce_unordered_container_requirements {
            pub _address: u8,
        }
        pub type __enforce_unordered_container_requirements_type = u32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_table {
            pub _address: u8,
        }
        pub type __hash_table_value_type = u8;
        pub type __hash_table_hasher = u8;
        pub type __hash_table_key_equal = u8;
        pub type __hash_table_allocator_type = u8;
        pub type __hash_table___alloc_traits = u8;
        pub type __hash_table__NodeTypes = u8;
        pub type __hash_table___node_value_type = u8;
        pub type __hash_table___container_value_type = u8;
        pub type __hash_table_key_type = u8;
        pub type __hash_table_reference = u8;
        pub type __hash_table_const_reference = u8;
        pub type __hash_table_pointer = u8;
        pub type __hash_table_const_pointer = u8;
        pub type __hash_table_size_type = u8;
        pub type __hash_table_difference_type = u8;
        pub type __hash_table___node = u8;
        pub type __hash_table___node_allocator = u8;
        pub type __hash_table___node_traits = u8;
        pub type __hash_table___void_pointer = u8;
        pub type __hash_table___node_pointer = u8;
        pub type __hash_table___node_const_pointer = u8;
        pub type __hash_table___first_node = u8;
        pub type __hash_table___node_base_pointer = u8;
        pub type __hash_table___next_pointer = u8;
        pub type __hash_table___node_base_allocator = u8;
        pub type __hash_table___node_base_traits = u8;
        pub type __hash_table___pointer_allocator = u8;
        pub type __hash_table___bucket_list_deleter = u8;
        pub type __hash_table___bucket_list = u8;
        pub type __hash_table___pointer_alloc_traits = u8;
        pub type __hash_table___node_pointer_pointer = u8;
        pub type __hash_table_iterator = u8;
        pub type __hash_table_const_iterator = u8;
        pub type __hash_table_local_iterator = u8;
        pub type __hash_table_const_local_iterator = u8;
        pub type __hash_table__Dp = u8;
        pub type __hash_table___node_holder = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_allocator {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_map_node_destructor {
            pub _address: u8,
        }
        pub type __hash_map_node_destructor_allocator_type = u8;
        pub type __hash_map_node_destructor___alloc_traits = u8;
        pub type __hash_map_node_destructor_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_value_type {
            pub _address: u8,
        }
        pub type __hash_value_type_key_type = u8;
        pub type __hash_value_type_mapped_type = u8;
        pub type __hash_value_type_value_type = u8;
        pub type __hash_value_type___nc_ref_pair_type = u8;
        pub type __hash_value_type___nc_rref_pair_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_map_iterator {
            pub _address: u8,
        }
        pub type __hash_map_iterator__NodeTypes = u8;
        pub type __hash_map_iterator_iterator_category = u8;
        pub type __hash_map_iterator_value_type = u8;
        pub type __hash_map_iterator_difference_type = u8;
        pub type __hash_map_iterator_reference = u8;
        pub type __hash_map_iterator_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __hash_map_const_iterator {
            pub _address: u8,
        }
        pub type __hash_map_const_iterator__NodeTypes = u8;
        pub type __hash_map_const_iterator_iterator_category = u8;
        pub type __hash_map_const_iterator_value_type = u8;
        pub type __hash_map_const_iterator_difference_type = u8;
        pub type __hash_map_const_iterator_reference = u8;
        pub type __hash_map_const_iterator_pointer = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unordered_map {
            pub _address: u8,
        }
        pub type unordered_map_key_type = u8;
        pub type unordered_map_mapped_type = u8;
        pub type unordered_map_hasher = u8;
        pub type unordered_map_key_equal = u8;
        pub type unordered_map_allocator_type = u8;
        pub type unordered_map_value_type = u8;
        pub type unordered_map_reference = u8;
        pub type unordered_map_const_reference = u8;
        pub type unordered_map___value_type = u8;
        pub type unordered_map___hasher = u8;
        pub type unordered_map___key_equal = u8;
        pub type unordered_map___allocator_type = u8;
        pub type unordered_map___table = u8;
        pub type unordered_map__NodeTypes = u8;
        pub type unordered_map___node_pointer = u8;
        pub type unordered_map___node_const_pointer = u8;
        pub type unordered_map___node_traits = u8;
        pub type unordered_map___node_allocator = u8;
        pub type unordered_map___node = u8;
        pub type unordered_map__Dp = u8;
        pub type unordered_map___node_holder = u8;
        pub type unordered_map___alloc_traits = u8;
        pub type unordered_map_pointer = u8;
        pub type unordered_map_const_pointer = u8;
        pub type unordered_map_size_type = u8;
        pub type unordered_map_difference_type = u8;
        pub type unordered_map_iterator = u8;
        pub type unordered_map_const_iterator = u8;
        pub type unordered_map_local_iterator = u8;
        pub type unordered_map_const_local_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unordered_multimap {
            pub _address: u8,
        }
        pub type unordered_multimap_key_type = u8;
        pub type unordered_multimap_mapped_type = u8;
        pub type unordered_multimap_hasher = u8;
        pub type unordered_multimap_key_equal = u8;
        pub type unordered_multimap_allocator_type = u8;
        pub type unordered_multimap_value_type = u8;
        pub type unordered_multimap_reference = u8;
        pub type unordered_multimap_const_reference = u8;
        pub type unordered_multimap___value_type = u8;
        pub type unordered_multimap___hasher = u8;
        pub type unordered_multimap___key_equal = u8;
        pub type unordered_multimap___allocator_type = u8;
        pub type unordered_multimap___table = u8;
        pub type unordered_multimap__NodeTypes = u8;
        pub type unordered_multimap___node_traits = u8;
        pub type unordered_multimap___node_allocator = u8;
        pub type unordered_multimap___node = u8;
        pub type unordered_multimap__Dp = u8;
        pub type unordered_multimap___node_holder = u8;
        pub type unordered_multimap___alloc_traits = u8;
        pub type unordered_multimap_pointer = u8;
        pub type unordered_multimap_const_pointer = u8;
        pub type unordered_multimap_size_type = u8;
        pub type unordered_multimap_difference_type = u8;
        pub type unordered_multimap_iterator = u8;
        pub type unordered_multimap_const_iterator = u8;
        pub type unordered_multimap_local_iterator = u8;
        pub type unordered_multimap_const_local_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __has_storage_type {
            pub _address: u8,
        }
        pub type __bit_reference___storage_type = u8;
        pub type __bit_reference___storage_pointer = u8;
        pub type __bit_reference___container = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __bit_const_reference {
            pub _address: u8,
        }
        pub type __bit_const_reference___storage_type = u8;
        pub type __bit_const_reference___storage_pointer = u8;
        pub type __bit_const_reference___container = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __bit_array {
            pub _address: u8,
        }
        pub type __bit_array_difference_type = u8;
        pub type __bit_array___storage_type = u8;
        pub type __bit_array___storage_pointer = u8;
        pub type __bit_array_iterator = u8;
        pub type __bit_iterator_difference_type = u8;
        pub type __bit_iterator_value_type = u8;
        pub type __bit_iterator_pointer = u8;
        pub type __bit_iterator_reference = u8;
        pub type __bit_iterator_iterator_category = u8;
        pub type __bit_iterator___storage_type = u8;
        pub type __bit_iterator___storage_pointer = u8;
        pub type string_view = [u64; 2usize];
        pub type u16string_view = [u64; 2usize];
        pub type u32string_view = [u64; 2usize];
        pub type wstring_view = [u64; 2usize];
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct char_traits {
            pub _address: u8,
        }
        pub type char_traits_char_type = u8;
        pub type char_traits_int_type = u32;
        pub type char_traits_off_type = u64;
        pub type char_traits_pos_type = u8;
        pub type char_traits_state_type = [u64; 16usize];
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string_view {
            pub _address: u8,
        }
        pub type basic_string_view_traits_type = u8;
        pub type basic_string_view_value_type = u8;
        pub type basic_string_view_pointer = u8;
        pub type basic_string_view_const_pointer = u8;
        pub type basic_string_view_reference = u8;
        pub type basic_string_view_const_reference = u8;
        pub type basic_string_view_const_iterator = u8;
        pub type basic_string_view_iterator = u8;
        pub type basic_string_view_const_reverse_iterator = u8;
        pub type basic_string_view_reverse_iterator = u8;
        pub type basic_string_view_size_type = u64;
        pub type basic_string_view_difference_type = u64;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __string_view_hash {
            pub _address: u8,
        }
        pub const errc_address_family_not_supported: root::std::errc = 47;
        pub const errc_address_in_use: root::std::errc = 48;
        pub const errc_address_not_available: root::std::errc = 49;
        pub const errc_already_connected: root::std::errc = 56;
        pub const errc_argument_list_too_long: root::std::errc = 7;
        pub const errc_argument_out_of_domain: root::std::errc = 33;
        pub const errc_bad_address: root::std::errc = 14;
        pub const errc_bad_file_descriptor: root::std::errc = 9;
        pub const errc_bad_message: root::std::errc = 94;
        pub const errc_broken_pipe: root::std::errc = 32;
        pub const errc_connection_aborted: root::std::errc = 53;
        pub const errc_connection_already_in_progress: root::std::errc = 37;
        pub const errc_connection_refused: root::std::errc = 61;
        pub const errc_connection_reset: root::std::errc = 54;
        pub const errc_cross_device_link: root::std::errc = 18;
        pub const errc_destination_address_required: root::std::errc = 39;
        pub const errc_device_or_resource_busy: root::std::errc = 16;
        pub const errc_directory_not_empty: root::std::errc = 66;
        pub const errc_executable_format_error: root::std::errc = 8;
        pub const errc_file_exists: root::std::errc = 17;
        pub const errc_file_too_large: root::std::errc = 27;
        pub const errc_filename_too_long: root::std::errc = 63;
        pub const errc_function_not_supported: root::std::errc = 78;
        pub const errc_host_unreachable: root::std::errc = 65;
        pub const errc_identifier_removed: root::std::errc = 90;
        pub const errc_illegal_byte_sequence: root::std::errc = 92;
        pub const errc_inappropriate_io_control_operation: root::std::errc = 25;
        pub const errc_interrupted: root::std::errc = 4;
        pub const errc_invalid_argument: root::std::errc = 22;
        pub const errc_invalid_seek: root::std::errc = 29;
        pub const errc_io_error: root::std::errc = 5;
        pub const errc_is_a_directory: root::std::errc = 21;
        pub const errc_message_size: root::std::errc = 40;
        pub const errc_network_down: root::std::errc = 50;
        pub const errc_network_reset: root::std::errc = 52;
        pub const errc_network_unreachable: root::std::errc = 51;
        pub const errc_no_buffer_space: root::std::errc = 55;
        pub const errc_no_child_process: root::std::errc = 10;
        pub const errc_no_link: root::std::errc = 97;
        pub const errc_no_lock_available: root::std::errc = 77;
        pub const errc_no_message_available: root::std::errc = 96;
        pub const errc_no_message: root::std::errc = 91;
        pub const errc_no_protocol_option: root::std::errc = 42;
        pub const errc_no_space_on_device: root::std::errc = 28;
        pub const errc_no_stream_resources: root::std::errc = 98;
        pub const errc_no_such_device_or_address: root::std::errc = 6;
        pub const errc_no_such_device: root::std::errc = 19;
        pub const errc_no_such_file_or_directory: root::std::errc = 2;
        pub const errc_no_such_process: root::std::errc = 3;
        pub const errc_not_a_directory: root::std::errc = 20;
        pub const errc_not_a_socket: root::std::errc = 38;
        pub const errc_not_a_stream: root::std::errc = 99;
        pub const errc_not_connected: root::std::errc = 57;
        pub const errc_not_enough_memory: root::std::errc = 12;
        pub const errc_not_supported: root::std::errc = 45;
        pub const errc_operation_canceled: root::std::errc = 89;
        pub const errc_operation_in_progress: root::std::errc = 36;
        pub const errc_operation_not_permitted: root::std::errc = 1;
        pub const errc_operation_not_supported: root::std::errc = 102;
        pub const errc_operation_would_block: root::std::errc = 35;
        pub const errc_owner_dead: root::std::errc = 105;
        pub const errc_permission_denied: root::std::errc = 13;
        pub const errc_protocol_error: root::std::errc = 100;
        pub const errc_protocol_not_supported: root::std::errc = 43;
        pub const errc_read_only_file_system: root::std::errc = 30;
        pub const errc_resource_deadlock_would_occur: root::std::errc = 11;
        pub const errc_resource_unavailable_try_again: root::std::errc = 35;
        pub const errc_result_out_of_range: root::std::errc = 34;
        pub const errc_state_not_recoverable: root::std::errc = 104;
        pub const errc_stream_timeout: root::std::errc = 101;
        pub const errc_text_file_busy: root::std::errc = 26;
        pub const errc_timed_out: root::std::errc = 60;
        pub const errc_too_many_files_open_in_system: root::std::errc = 23;
        pub const errc_too_many_files_open: root::std::errc = 24;
        pub const errc_too_many_links: root::std::errc = 31;
        pub const errc_too_many_symbolic_link_levels: root::std::errc = 62;
        pub const errc_value_too_large: root::std::errc = 84;
        pub const errc_wrong_protocol_type: root::std::errc = 41;
        pub type errc = ::std::os::raw::c_int;
        pub type __make_32_64_or_128_bit_t = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct fpos {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __noexcept_move_assign_container {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __string_is_trivial_iterator {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __can_be_converted_to_string_view {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __uninitialized_size_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __uninitialized_size_tag"]
                [::std::mem::size_of::<__uninitialized_size_tag>() - 1usize];
            ["Alignment of __uninitialized_size_tag"]
                [::std::mem::align_of::<__uninitialized_size_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __init_with_sentinel_tag {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __init_with_sentinel_tag"]
                [::std::mem::size_of::<__init_with_sentinel_tag>() - 1usize];
            ["Alignment of __init_with_sentinel_tag"]
                [::std::mem::align_of::<__init_with_sentinel_tag>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string {
            pub _address: u8,
        }
        pub type basic_string___self = u8;
        pub type basic_string___self_view = u8;
        pub type basic_string_traits_type = u8;
        pub type basic_string_value_type = u8;
        pub type basic_string_allocator_type = u8;
        pub type basic_string___alloc_traits = u8;
        pub type basic_string_size_type = u8;
        pub type basic_string_difference_type = u8;
        pub type basic_string_reference = u8;
        pub type basic_string_const_reference = u8;
        pub type basic_string_pointer = u8;
        pub type basic_string_const_pointer = u8;
        pub type basic_string_iterator = u8;
        pub type basic_string_const_iterator = u8;
        pub type basic_string_reverse_iterator = u8;
        pub type basic_string_const_reverse_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string___long {
            pub _address: u8,
        }
        pub const basic_string___min_cap: root::std::basic_string__bindgen_ty_1 = 0;
        pub type basic_string__bindgen_ty_1 = i32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string___short {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Copy, Clone)]
        pub struct basic_string___ulx {
            pub _bindgen_opaque_blob: [u8; 0usize],
        }
        pub const basic_string___n_words: root::std::basic_string__bindgen_ty_2 = 0;
        pub type basic_string__bindgen_ty_2 = i32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string___raw {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string___rep {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Copy, Clone)]
        pub struct basic_string___rep__bindgen_ty_1 {
            pub _bindgen_opaque_blob: [u8; 0usize],
        }
        pub const basic_string___alignment: root::std::basic_string__bindgen_ty_3 = 0;
        pub type basic_string__bindgen_ty_3 = i32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __traits_eq {
            pub _address: u8,
        }
        pub type __traits_eq_char_type = u8;
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__14stoiERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
            pub fn stoi(
                __str: *const root::std::string,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__14stolERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
            pub fn stol(
                __str: *const root::std::string,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15stoulERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
            pub fn stoul(
                __str: *const root::std::string,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_ulong;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15stollERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
            pub fn stoll(
                __str: *const root::std::string,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_longlong;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16stoullERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
            pub fn stoull(
                __str: *const root::std::string,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_ulonglong;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__14stofERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
            pub fn stof(
                __str: *const root::std::string,
                __idx: *mut ::std::os::raw::c_ulong,
            ) -> f32;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__14stodERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
            pub fn stod(
                __str: *const root::std::string,
                __idx: *mut ::std::os::raw::c_ulong,
            ) -> f64;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15stoldERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
            pub fn stold(
                __str: *const root::std::string,
                __idx: *mut ::std::os::raw::c_ulong,
            ) -> f64;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEi"]
            pub fn to_string(__val: ::std::os::raw::c_int) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEj"]
            pub fn to_string1(__val: ::std::os::raw::c_uint) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEl"]
            pub fn to_string2(__val: ::std::os::raw::c_long) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEm"]
            pub fn to_string3(__val: ::std::os::raw::c_ulong) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEx"]
            pub fn to_string4(__val: ::std::os::raw::c_longlong) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEy"]
            pub fn to_string5(__val: ::std::os::raw::c_ulonglong) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEf"]
            pub fn to_string6(__val: f32) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEd"]
            pub fn to_string7(__val: f64) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__19to_stringEe"]
            pub fn to_string8(__val: f64) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__14stoiERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
            pub fn stoi1(
                __str: *const root::std::wstring,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__14stolERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
            pub fn stol1(
                __str: *const root::std::wstring,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15stoulERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
            pub fn stoul1(
                __str: *const root::std::wstring,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_ulong;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15stollERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
            pub fn stoll1(
                __str: *const root::std::wstring,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_longlong;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16stoullERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
            pub fn stoull1(
                __str: *const root::std::wstring,
                __idx: *mut ::std::os::raw::c_ulong,
                __base: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_ulonglong;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__14stofERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
            pub fn stof1(
                __str: *const root::std::wstring,
                __idx: *mut ::std::os::raw::c_ulong,
            ) -> f32;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__14stodERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
            pub fn stod1(
                __str: *const root::std::wstring,
                __idx: *mut ::std::os::raw::c_ulong,
            ) -> f64;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15stoldERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
            pub fn stold1(
                __str: *const root::std::wstring,
                __idx: *mut ::std::os::raw::c_ulong,
            ) -> f64;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEi"]
            pub fn to_wstring(__val: ::std::os::raw::c_int) -> root::std::wstring;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEj"]
            pub fn to_wstring1(__val: ::std::os::raw::c_uint) -> root::std::wstring;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEl"]
            pub fn to_wstring2(__val: ::std::os::raw::c_long) -> root::std::wstring;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEm"]
            pub fn to_wstring3(__val: ::std::os::raw::c_ulong) -> root::std::wstring;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEx"]
            pub fn to_wstring4(__val: ::std::os::raw::c_longlong) -> root::std::wstring;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEy"]
            pub fn to_wstring5(__val: ::std::os::raw::c_ulonglong) -> root::std::wstring;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEf"]
            pub fn to_wstring6(__val: f32) -> root::std::wstring;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEd"]
            pub fn to_wstring7(__val: f64) -> root::std::wstring;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110to_wstringEe"]
            pub fn to_wstring8(__val: f64) -> root::std::wstring;
        }
        extern "C" {
            pub static npos: root::std::basic_string_size_type;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __string_hash {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct mutex {
            pub _bindgen_opaque_blob: [u64; 8usize],
        }
        pub type mutex_native_handle_type = u64;
        const _: () = {
            ["Size of mutex"][::std::mem::size_of::<mutex>() - 64usize];
            ["Alignment of mutex"][::std::mem::align_of::<mutex>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15mutex4lockEv"]
            pub fn mutex_lock(this: *mut root::std::mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15mutex8try_lockEv"]
            pub fn mutex_try_lock(this: *mut root::std::mutex) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15mutex6unlockEv"]
            pub fn mutex_unlock(this: *mut root::std::mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__15mutexD1Ev"]
            pub fn mutex_mutex_destructor(this: *mut root::std::mutex);
        }
        impl mutex {
            #[inline]
            pub unsafe fn lock(&mut self) {
                mutex_lock(self)
            }
            #[inline]
            pub unsafe fn try_lock(&mut self) -> bool {
                mutex_try_lock(self)
            }
            #[inline]
            pub unsafe fn unlock(&mut self) {
                mutex_unlock(self)
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                mutex_mutex_destructor(self)
            }
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct defer_lock_t {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of defer_lock_t"][::std::mem::size_of::<defer_lock_t>() - 1usize];
            ["Alignment of defer_lock_t"][::std::mem::align_of::<defer_lock_t>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct try_to_lock_t {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of try_to_lock_t"][::std::mem::size_of::<try_to_lock_t>() - 1usize];
            ["Alignment of try_to_lock_t"][::std::mem::align_of::<try_to_lock_t>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct adopt_lock_t {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of adopt_lock_t"][::std::mem::size_of::<adopt_lock_t>() - 1usize];
            ["Alignment of adopt_lock_t"][::std::mem::align_of::<adopt_lock_t>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__1L10defer_lockE"]
            pub static defer_lock: root::std::defer_lock_t;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__1L11try_to_lockE"]
            pub static try_to_lock: root::std::try_to_lock_t;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__1L10adopt_lockE"]
            pub static adopt_lock: root::std::adopt_lock_t;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct error_category {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of error_category"][::std::mem::size_of::<error_category>() - 8usize];
            ["Alignment of error_category"][::std::mem::align_of::<error_category>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__114error_categoryD1Ev"]
            pub fn error_category_error_category_destructor(this: *mut root::std::error_category);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__114error_category23default_error_conditionEi"]
            pub fn error_category_default_error_condition(
                this: *mut ::std::os::raw::c_void,
                __ev: ::std::os::raw::c_int,
            ) -> root::std::error_condition;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"]
            pub fn error_category_equivalent(
                this: *mut ::std::os::raw::c_void,
                __code: ::std::os::raw::c_int,
                __condition: *const root::std::error_condition,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"]
            pub fn error_category_equivalent1(
                this: *mut ::std::os::raw::c_void,
                __code: *const root::std::error_code,
                __condition: ::std::os::raw::c_int,
            ) -> bool;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __do_message {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of __do_message"][::std::mem::size_of::<__do_message>() - 8usize];
            ["Alignment of __do_message"][::std::mem::align_of::<__do_message>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__116generic_categoryEv"]
            pub fn generic_category() -> *const root::std::error_category;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__115system_categoryEv"]
            pub fn system_category() -> *const root::std::error_category;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_error_condition_enum {
            pub _address: u8,
        }
        pub mod __adl_only {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct error_condition {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of error_condition"][::std::mem::size_of::<error_condition>() - 16usize];
            ["Alignment of error_condition"][::std::mem::align_of::<error_condition>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__115error_condition7messageEv"]
            pub fn error_condition_message(
                this: *const root::std::error_condition,
            ) -> root::std::string;
        }
        impl error_condition {
            #[inline]
            pub unsafe fn message(&self) -> root::std::string {
                error_condition_message(self)
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct is_error_code_enum {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct error_code {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of error_code"][::std::mem::size_of::<error_code>() - 16usize];
            ["Alignment of error_code"][::std::mem::align_of::<error_code>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__110error_code7messageEv"]
            pub fn error_code_message(this: *const root::std::error_code) -> root::std::string;
        }
        impl error_code {
            #[inline]
            pub unsafe fn message(&self) -> root::std::string {
                error_code_message(self)
            }
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct system_error {
            pub _bindgen_opaque_blob: [u64; 4usize],
        }
        const _: () = {
            ["Size of system_error"][::std::mem::size_of::<system_error>() - 32usize];
            ["Alignment of system_error"][::std::mem::align_of::<system_error>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
            pub fn system_error_system_error(
                this: *mut root::std::system_error,
                __ec: root::std::error_code,
                __what_arg: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeEPKc"]
            pub fn system_error_system_error1(
                this: *mut root::std::system_error,
                __ec: root::std::error_code,
                __what_arg: *const ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeE"]
            pub fn system_error_system_error2(
                this: *mut root::std::system_error,
                __ec: root::std::error_code,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
            pub fn system_error_system_error3(
                this: *mut root::std::system_error,
                __ev: ::std::os::raw::c_int,
                __ecat: *const root::std::error_category,
                __what_arg: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryEPKc"]
            pub fn system_error_system_error4(
                this: *mut root::std::system_error,
                __ev: ::std::os::raw::c_int,
                __ecat: *const root::std::error_category,
                __what_arg: *const ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryE"]
            pub fn system_error_system_error5(
                this: *mut root::std::system_error,
                __ev: ::std::os::raw::c_int,
                __ecat: *const root::std::error_category,
            );
        }
        impl system_error {
            #[inline]
            pub unsafe fn new(
                __ec: root::std::error_code,
                __what_arg: *const root::std::string,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                system_error_system_error(__bindgen_tmp.as_mut_ptr(), __ec, __what_arg);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(
                __ec: root::std::error_code,
                __what_arg: *const ::std::os::raw::c_char,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                system_error_system_error1(__bindgen_tmp.as_mut_ptr(), __ec, __what_arg);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new2(__ec: root::std::error_code) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                system_error_system_error2(__bindgen_tmp.as_mut_ptr(), __ec);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new3(
                __ev: ::std::os::raw::c_int,
                __ecat: *const root::std::error_category,
                __what_arg: *const root::std::string,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                system_error_system_error3(__bindgen_tmp.as_mut_ptr(), __ev, __ecat, __what_arg);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new4(
                __ev: ::std::os::raw::c_int,
                __ecat: *const root::std::error_category,
                __what_arg: *const ::std::os::raw::c_char,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                system_error_system_error4(__bindgen_tmp.as_mut_ptr(), __ev, __ecat, __what_arg);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new5(
                __ev: ::std::os::raw::c_int,
                __ecat: *const root::std::error_category,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                system_error_system_error5(__bindgen_tmp.as_mut_ptr(), __ev, __ecat);
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112system_errorD1Ev"]
            pub fn system_error_system_error_destructor(this: *mut root::std::system_error);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__120__throw_system_errorEiPKc"]
            pub fn __throw_system_error(
                __ev: ::std::os::raw::c_int,
                __what_arg: *const ::std::os::raw::c_char,
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unique_lock {
            pub _address: u8,
        }
        pub type unique_lock_mutex_type = u8;
        pub const cv_status_no_timeout: root::std::cv_status = 0;
        pub const cv_status_timeout: root::std::cv_status = 1;
        pub type cv_status = ::std::os::raw::c_int;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct condition_variable {
            pub _bindgen_opaque_blob: [u64; 6usize],
        }
        pub type condition_variable_native_handle_type = u64;
        const _: () = {
            ["Size of condition_variable"][::std::mem::size_of::<condition_variable>() - 48usize];
            ["Alignment of condition_variable"]
                [::std::mem::align_of::<condition_variable>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_oneEv"]
            pub fn condition_variable_notify_one(this: *mut root::std::condition_variable);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_allEv"]
            pub fn condition_variable_notify_all(this: *mut root::std::condition_variable);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__118condition_variable4waitERNS_11unique_lockINS_5mutexEEE"]
            pub fn condition_variable_wait(
                this: *mut root::std::condition_variable,
                __lk: *mut [u64; 2usize],
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__118condition_variableD1Ev"]
            pub fn condition_variable_condition_variable_destructor(
                this: *mut root::std::condition_variable,
            );
        }
        impl condition_variable {
            #[inline]
            pub unsafe fn notify_one(&mut self) {
                condition_variable_notify_one(self)
            }
            #[inline]
            pub unsafe fn notify_all(&mut self) {
                condition_variable_notify_all(self)
            }
            #[inline]
            pub unsafe fn wait(&mut self, __lk: *mut [u64; 2usize]) {
                condition_variable_wait(self, __lk)
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                condition_variable_condition_variable_destructor(self)
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct lock_guard {
            pub _address: u8,
        }
        pub type lock_guard_mutex_type = u8;
        pub mod this_thread {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __thread_id {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of __thread_id"][::std::mem::size_of::<__thread_id>() - 8usize];
            ["Alignment of __thread_id"][::std::mem::align_of::<__thread_id>() - 8usize];
        };
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct recursive_mutex {
            pub _bindgen_opaque_blob: [u64; 8usize],
        }
        pub type recursive_mutex_native_handle_type = u64;
        const _: () = {
            ["Size of recursive_mutex"][::std::mem::size_of::<recursive_mutex>() - 64usize];
            ["Alignment of recursive_mutex"][::std::mem::align_of::<recursive_mutex>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__115recursive_mutex4lockEv"]
            pub fn recursive_mutex_lock(this: *mut root::std::recursive_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__115recursive_mutex8try_lockEv"]
            pub fn recursive_mutex_try_lock(this: *mut root::std::recursive_mutex) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__115recursive_mutex6unlockEv"]
            pub fn recursive_mutex_unlock(this: *mut root::std::recursive_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__115recursive_mutexC1Ev"]
            pub fn recursive_mutex_recursive_mutex(this: *mut root::std::recursive_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__115recursive_mutexD1Ev"]
            pub fn recursive_mutex_recursive_mutex_destructor(
                this: *mut root::std::recursive_mutex,
            );
        }
        impl recursive_mutex {
            #[inline]
            pub unsafe fn lock(&mut self) {
                recursive_mutex_lock(self)
            }
            #[inline]
            pub unsafe fn try_lock(&mut self) -> bool {
                recursive_mutex_try_lock(self)
            }
            #[inline]
            pub unsafe fn unlock(&mut self) {
                recursive_mutex_unlock(self)
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                recursive_mutex_recursive_mutex(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                recursive_mutex_recursive_mutex_destructor(self)
            }
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct timed_mutex {
            pub _bindgen_opaque_blob: [u64; 15usize],
        }
        const _: () = {
            ["Size of timed_mutex"][::std::mem::size_of::<timed_mutex>() - 120usize];
            ["Alignment of timed_mutex"][::std::mem::align_of::<timed_mutex>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__111timed_mutex4lockEv"]
            pub fn timed_mutex_lock(this: *mut root::std::timed_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__111timed_mutex8try_lockEv"]
            pub fn timed_mutex_try_lock(this: *mut root::std::timed_mutex) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__111timed_mutex6unlockEv"]
            pub fn timed_mutex_unlock(this: *mut root::std::timed_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__111timed_mutexC1Ev"]
            pub fn timed_mutex_timed_mutex(this: *mut root::std::timed_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__111timed_mutexD1Ev"]
            pub fn timed_mutex_timed_mutex_destructor(this: *mut root::std::timed_mutex);
        }
        impl timed_mutex {
            #[inline]
            pub unsafe fn lock(&mut self) {
                timed_mutex_lock(self)
            }
            #[inline]
            pub unsafe fn try_lock(&mut self) -> bool {
                timed_mutex_try_lock(self)
            }
            #[inline]
            pub unsafe fn unlock(&mut self) {
                timed_mutex_unlock(self)
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                timed_mutex_timed_mutex(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                timed_mutex_timed_mutex_destructor(self)
            }
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct recursive_timed_mutex {
            pub _bindgen_opaque_blob: [u64; 16usize],
        }
        const _: () = {
            ["Size of recursive_timed_mutex"]
                [::std::mem::size_of::<recursive_timed_mutex>() - 128usize];
            ["Alignment of recursive_timed_mutex"]
                [::std::mem::align_of::<recursive_timed_mutex>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex4lockEv"]
            pub fn recursive_timed_mutex_lock(this: *mut root::std::recursive_timed_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex8try_lockEv"]
            pub fn recursive_timed_mutex_try_lock(
                this: *mut root::std::recursive_timed_mutex,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex6unlockEv"]
            pub fn recursive_timed_mutex_unlock(this: *mut root::std::recursive_timed_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutexC1Ev"]
            pub fn recursive_timed_mutex_recursive_timed_mutex(
                this: *mut root::std::recursive_timed_mutex,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutexD1Ev"]
            pub fn recursive_timed_mutex_recursive_timed_mutex_destructor(
                this: *mut root::std::recursive_timed_mutex,
            );
        }
        impl recursive_timed_mutex {
            #[inline]
            pub unsafe fn lock(&mut self) {
                recursive_timed_mutex_lock(self)
            }
            #[inline]
            pub unsafe fn try_lock(&mut self) -> bool {
                recursive_timed_mutex_try_lock(self)
            }
            #[inline]
            pub unsafe fn unlock(&mut self) {
                recursive_timed_mutex_unlock(self)
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                recursive_timed_mutex_recursive_timed_mutex(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                recursive_timed_mutex_recursive_timed_mutex_destructor(self)
            }
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct once_flag {
            pub _bindgen_opaque_blob: u64,
        }
        pub type once_flag__State_type = u64;
        const _: () = {
            ["Size of once_flag"][::std::mem::size_of::<once_flag>() - 8usize];
            ["Alignment of once_flag"][::std::mem::align_of::<once_flag>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __call_once_param {
            pub _address: u8,
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__111__call_onceERVmPvPFvS2_E"]
            pub fn __call_once(
                arg1: *mut root::std::once_flag__State_type,
                arg2: *mut ::std::os::raw::c_void,
                arg3: ::std::option::Option<
                    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
                >,
            );
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct locale {
            pub _bindgen_opaque_blob: u64,
        }
        pub type locale_category = u32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct locale___imp {
            _unused: [u8; 0],
        }
        const _: () = {
            ["Size of locale"][::std::mem::size_of::<locale>() - 8usize];
            ["Alignment of locale"][::std::mem::align_of::<locale>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__16locale4nameEv"]
            pub fn locale_name(this: *const root::std::locale) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16locale6globalERKS0_"]
            pub fn locale_global(arg1: *const root::std::locale) -> root::std::locale;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16locale7classicEv"]
            pub fn locale_classic() -> *const root::std::locale;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16localeC1Ev"]
            pub fn locale_locale(this: *mut root::std::locale);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_"]
            pub fn locale_locale1(this: *mut root::std::locale, arg1: *const root::std::locale);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16localeC1EPKc"]
            pub fn locale_locale2(
                this: *mut root::std::locale,
                arg1: *const ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16localeC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
            pub fn locale_locale3(this: *mut root::std::locale, arg1: *const root::std::string);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_PKci"]
            pub fn locale_locale4(
                this: *mut root::std::locale,
                arg1: *const root::std::locale,
                arg2: *const ::std::os::raw::c_char,
                arg3: root::std::locale_category,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_RKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEi"]
            pub fn locale_locale5(
                this: *mut root::std::locale,
                arg1: *const root::std::locale,
                arg2: *const root::std::string,
                arg3: root::std::locale_category,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_S2_i"]
            pub fn locale_locale6(
                this: *mut root::std::locale,
                arg1: *const root::std::locale,
                arg2: *const root::std::locale,
                arg3: root::std::locale_category,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16localeD1Ev"]
            pub fn locale_locale_destructor(this: *mut root::std::locale);
        }
        impl locale {
            #[inline]
            pub unsafe fn name(&self) -> root::std::string {
                locale_name(self)
            }
            #[inline]
            pub unsafe fn global(arg1: *const root::std::locale) -> root::std::locale {
                locale_global(arg1)
            }
            #[inline]
            pub unsafe fn classic() -> *const root::std::locale {
                locale_classic()
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                locale_locale(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(arg1: *const root::std::locale) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                locale_locale1(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new2(arg1: *const ::std::os::raw::c_char) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                locale_locale2(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new3(arg1: *const root::std::string) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                locale_locale3(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new4(
                arg1: *const root::std::locale,
                arg2: *const ::std::os::raw::c_char,
                arg3: root::std::locale_category,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                locale_locale4(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new5(
                arg1: *const root::std::locale,
                arg2: *const root::std::string,
                arg3: root::std::locale_category,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                locale_locale5(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new6(
                arg1: *const root::std::locale,
                arg2: *const root::std::locale,
                arg3: root::std::locale_category,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                locale_locale6(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                locale_locale_destructor(self)
            }
        }
        pub const locale_none: root::std::locale_category = 0;
        pub const locale_collate: root::std::locale_category = 1;
        pub const locale_ctype: root::std::locale_category = 2;
        pub const locale_monetary: root::std::locale_category = 8;
        pub const locale_numeric: root::std::locale_category = 16;
        pub const locale_time: root::std::locale_category = 32;
        pub const locale_messages: root::std::locale_category = 4;
        pub const locale_all: root::std::locale_category = 63;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct locale_facet {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of locale_facet"][::std::mem::size_of::<locale_facet>() - 16usize];
            ["Alignment of locale_facet"][::std::mem::align_of::<locale_facet>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16locale5facetD1Ev"]
            pub fn locale_facet_facet_destructor(this: *mut root::std::locale_facet);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct locale_id {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of locale_id"][::std::mem::size_of::<locale_id>() - 16usize];
            ["Alignment of locale_id"][::std::mem::align_of::<locale_id>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16locale2id5__getEv"]
            pub fn locale_id___get(this: *mut root::std::locale_id) -> ::std::os::raw::c_long;
        }
        impl locale_id {
            #[inline]
            pub unsafe fn __get(&mut self) -> ::std::os::raw::c_long {
                locale_id___get(self)
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__16locale2id9__next_idE"]
            pub static mut locale_id___next_id: ::std::os::raw::c_int;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct collate {}
        pub type collate_char_type = u8;
        pub type collate_string_type = u8;
        extern "C" {
            pub static mut id: root::std::locale_id;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct collate_byname {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct ctype_base {
            pub _bindgen_opaque_blob: u8,
        }
        pub type ctype_base_mask = u32;
        const _: () = {
            ["Size of ctype_base"][::std::mem::size_of::<ctype_base>() - 1usize];
            ["Alignment of ctype_base"][::std::mem::align_of::<ctype_base>() - 1usize];
        };
        pub const ctype_base_space: root::std::ctype_base_mask = 16384;
        pub const ctype_base_print: root::std::ctype_base_mask = 262144;
        pub const ctype_base_cntrl: root::std::ctype_base_mask = 512;
        pub const ctype_base_upper: root::std::ctype_base_mask = 32768;
        pub const ctype_base_lower: root::std::ctype_base_mask = 4096;
        pub const ctype_base_alpha: root::std::ctype_base_mask = 256;
        pub const ctype_base_digit: root::std::ctype_base_mask = 1024;
        pub const ctype_base_punct: root::std::ctype_base_mask = 8192;
        pub const ctype_base_xdigit: root::std::ctype_base_mask = 65536;
        pub const ctype_base_blank: root::std::ctype_base_mask = 131072;
        pub const ctype_base___regex_word: root::std::ctype_base_mask = 128;
        pub const ctype_base_alnum: root::std::ctype_base_mask = 1280;
        pub const ctype_base_graph: root::std::ctype_base_mask = 9472;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ctype {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ctype_byname {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct codecvt_base {
            pub _bindgen_opaque_blob: u8,
        }
        pub const codecvt_base_result_ok: root::std::codecvt_base_result = 0;
        pub const codecvt_base_result_partial: root::std::codecvt_base_result = 1;
        pub const codecvt_base_result_error: root::std::codecvt_base_result = 2;
        pub const codecvt_base_result_noconv: root::std::codecvt_base_result = 3;
        pub type codecvt_base_result = ::std::os::raw::c_uint;
        const _: () = {
            ["Size of codecvt_base"][::std::mem::size_of::<codecvt_base>() - 1usize];
            ["Alignment of codecvt_base"][::std::mem::align_of::<codecvt_base>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct codecvt {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct codecvt_byname {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct numpunct {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct numpunct_byname {
            pub _address: u8,
        }
        pub type streamsize = u64;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct ios_base {
            pub _bindgen_opaque_blob: [u64; 17usize],
        }
        pub type ios_base_fmtflags = u32;
        pub type ios_base_iostate = u32;
        pub type ios_base_openmode = u32;
        pub const ios_base_seekdir_beg: root::std::ios_base_seekdir = 0;
        pub const ios_base_seekdir_cur: root::std::ios_base_seekdir = 1;
        pub const ios_base_seekdir_end: root::std::ios_base_seekdir = 2;
        pub type ios_base_seekdir = ::std::os::raw::c_uint;
        pub type ios_base_io_state = u32;
        pub type ios_base_open_mode = u32;
        pub type ios_base_seek_dir = u32;
        pub type ios_base_streamoff = u64;
        pub type ios_base_streampos = u8;
        pub const ios_base_event_erase_event: root::std::ios_base_event = 0;
        pub const ios_base_event_imbue_event: root::std::ios_base_event = 1;
        pub const ios_base_event_copyfmt_event: root::std::ios_base_event = 2;
        pub type ios_base_event = ::std::os::raw::c_uint;
        pub type ios_base_event_callback = u64;
        const _: () = {
            ["Size of ios_base"][::std::mem::size_of::<ios_base>() - 136usize];
            ["Alignment of ios_base"][::std::mem::align_of::<ios_base>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base5imbueERKNS_6localeE"]
            pub fn ios_base_imbue(
                this: *mut root::std::ios_base,
                __loc: *const root::std::locale,
            ) -> root::std::locale;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__18ios_base6getlocEv"]
            pub fn ios_base_getloc(this: *const root::std::ios_base) -> root::std::locale;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base6xallocEv"]
            pub fn ios_base_xalloc() -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base5iwordEi"]
            pub fn ios_base_iword(
                this: *mut root::std::ios_base,
                __index: ::std::os::raw::c_int,
            ) -> *mut ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base5pwordEi"]
            pub fn ios_base_pword(
                this: *mut root::std::ios_base,
                __index: ::std::os::raw::c_int,
            ) -> *mut *mut ::std::os::raw::c_void;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi"]
            pub fn ios_base_register_callback(
                this: *mut root::std::ios_base,
                __fn: root::std::ios_base_event_callback,
                __index: ::std::os::raw::c_int,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base15sync_with_stdioEb"]
            pub fn ios_base_sync_with_stdio(__sync: bool) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base5clearEj"]
            pub fn ios_base_clear(
                this: *mut root::std::ios_base,
                __state: root::std::ios_base_iostate,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv"]
            pub fn ios_base___set_badbit_and_consider_rethrow(this: *mut root::std::ios_base);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv"]
            pub fn ios_base___set_failbit_and_consider_rethrow(this: *mut root::std::ios_base);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base4initEPv"]
            pub fn ios_base_init(this: *mut root::std::ios_base, __sb: *mut ::std::os::raw::c_void);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base16__call_callbacksENS0_5eventE"]
            pub fn ios_base___call_callbacks(
                this: *mut root::std::ios_base,
                arg1: root::std::ios_base_event,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base7copyfmtERKS0_"]
            pub fn ios_base_copyfmt(
                this: *mut root::std::ios_base,
                arg1: *const root::std::ios_base,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base4moveERS0_"]
            pub fn ios_base_move(this: *mut root::std::ios_base, arg1: *mut root::std::ios_base);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base4swapERS0_"]
            pub fn ios_base_swap(this: *mut root::std::ios_base, arg1: *mut root::std::ios_base);
        }
        impl ios_base {
            #[inline]
            pub unsafe fn imbue(&mut self, __loc: *const root::std::locale) -> root::std::locale {
                ios_base_imbue(self, __loc)
            }
            #[inline]
            pub unsafe fn getloc(&self) -> root::std::locale {
                ios_base_getloc(self)
            }
            #[inline]
            pub unsafe fn xalloc() -> ::std::os::raw::c_int {
                ios_base_xalloc()
            }
            #[inline]
            pub unsafe fn iword(
                &mut self,
                __index: ::std::os::raw::c_int,
            ) -> *mut ::std::os::raw::c_long {
                ios_base_iword(self, __index)
            }
            #[inline]
            pub unsafe fn pword(
                &mut self,
                __index: ::std::os::raw::c_int,
            ) -> *mut *mut ::std::os::raw::c_void {
                ios_base_pword(self, __index)
            }
            #[inline]
            pub unsafe fn register_callback(
                &mut self,
                __fn: root::std::ios_base_event_callback,
                __index: ::std::os::raw::c_int,
            ) {
                ios_base_register_callback(self, __fn, __index)
            }
            #[inline]
            pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
                ios_base_sync_with_stdio(__sync)
            }
            #[inline]
            pub unsafe fn clear(&mut self, __state: root::std::ios_base_iostate) {
                ios_base_clear(self, __state)
            }
            #[inline]
            pub unsafe fn __set_badbit_and_consider_rethrow(&mut self) {
                ios_base___set_badbit_and_consider_rethrow(self)
            }
            #[inline]
            pub unsafe fn __set_failbit_and_consider_rethrow(&mut self) {
                ios_base___set_failbit_and_consider_rethrow(self)
            }
            #[inline]
            pub unsafe fn init(&mut self, __sb: *mut ::std::os::raw::c_void) {
                ios_base_init(self, __sb)
            }
            #[inline]
            pub unsafe fn __call_callbacks(&mut self, arg1: root::std::ios_base_event) {
                ios_base___call_callbacks(self, arg1)
            }
            #[inline]
            pub unsafe fn copyfmt(&mut self, arg1: *const root::std::ios_base) {
                ios_base_copyfmt(self, arg1)
            }
            #[inline]
            pub unsafe fn move_(&mut self, arg1: *mut root::std::ios_base) {
                ios_base_move(self, arg1)
            }
            #[inline]
            pub unsafe fn swap(&mut self, arg1: *mut root::std::ios_base) {
                ios_base_swap(self, arg1)
            }
        }
        pub const ios_base_boolalpha: root::std::ios_base_fmtflags = 1;
        pub const ios_base_dec: root::std::ios_base_fmtflags = 2;
        pub const ios_base_fixed: root::std::ios_base_fmtflags = 4;
        pub const ios_base_hex: root::std::ios_base_fmtflags = 8;
        pub const ios_base_internal: root::std::ios_base_fmtflags = 16;
        pub const ios_base_left: root::std::ios_base_fmtflags = 32;
        pub const ios_base_oct: root::std::ios_base_fmtflags = 64;
        pub const ios_base_right: root::std::ios_base_fmtflags = 128;
        pub const ios_base_scientific: root::std::ios_base_fmtflags = 256;
        pub const ios_base_showbase: root::std::ios_base_fmtflags = 512;
        pub const ios_base_showpoint: root::std::ios_base_fmtflags = 1024;
        pub const ios_base_showpos: root::std::ios_base_fmtflags = 2048;
        pub const ios_base_skipws: root::std::ios_base_fmtflags = 4096;
        pub const ios_base_unitbuf: root::std::ios_base_fmtflags = 8192;
        pub const ios_base_uppercase: root::std::ios_base_fmtflags = 16384;
        pub const ios_base_adjustfield: root::std::ios_base_fmtflags = 176;
        pub const ios_base_basefield: root::std::ios_base_fmtflags = 74;
        pub const ios_base_floatfield: root::std::ios_base_fmtflags = 260;
        pub const ios_base_badbit: root::std::ios_base_iostate = 1;
        pub const ios_base_eofbit: root::std::ios_base_iostate = 2;
        pub const ios_base_failbit: root::std::ios_base_iostate = 4;
        pub const ios_base_goodbit: root::std::ios_base_iostate = 0;
        pub const ios_base_app: root::std::ios_base_openmode = 1;
        pub const ios_base_ate: root::std::ios_base_openmode = 2;
        pub const ios_base_binary: root::std::ios_base_openmode = 4;
        pub const ios_base_in: root::std::ios_base_openmode = 8;
        pub const ios_base_out: root::std::ios_base_openmode = 16;
        pub const ios_base_trunc: root::std::ios_base_openmode = 32;
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_baseD1Ev"]
            pub fn ios_base_ios_base_destructor(this: *mut root::std::ios_base);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base9__xindex_E"]
            pub static mut ios_base___xindex_: u8;
        }
        pub const io_errc_stream: root::std::io_errc = 1;
        pub type io_errc = ::std::os::raw::c_int;
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__117iostream_categoryEv"]
            pub fn iostream_category() -> *const root::std::error_category;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct ios_base_failure {
            pub _bindgen_opaque_blob: [u64; 4usize],
        }
        const _: () = {
            ["Size of ios_base_failure"][::std::mem::size_of::<ios_base_failure>() - 32usize];
            ["Alignment of ios_base_failure"][::std::mem::align_of::<ios_base_failure>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base7failureC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEERKNS_10error_codeE"]
            pub fn ios_base_failure_failure(
                this: *mut root::std::ios_base_failure,
                __msg: *const root::std::string,
                __ec: *const root::std::error_code,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base7failureC1EPKcRKNS_10error_codeE"]
            pub fn ios_base_failure_failure1(
                this: *mut root::std::ios_base_failure,
                __msg: *const ::std::os::raw::c_char,
                __ec: *const root::std::error_code,
            );
        }
        impl ios_base_failure {
            #[inline]
            pub unsafe fn new(
                __msg: *const root::std::string,
                __ec: *const root::std::error_code,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                ios_base_failure_failure(__bindgen_tmp.as_mut_ptr(), __msg, __ec);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(
                __msg: *const ::std::os::raw::c_char,
                __ec: *const root::std::error_code,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                ios_base_failure_failure1(__bindgen_tmp.as_mut_ptr(), __msg, __ec);
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base7failureD1Ev"]
            pub fn ios_base_failure_failure_destructor(this: *mut root::std::ios_base_failure);
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct ios_base_Init {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of ios_base_Init"][::std::mem::size_of::<ios_base_Init>() - 1usize];
            ["Alignment of ios_base_Init"][::std::mem::align_of::<ios_base_Init>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base4InitC1Ev"]
            pub fn ios_base_Init_Init(this: *mut root::std::ios_base_Init);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__18ios_base4InitD1Ev"]
            pub fn ios_base_Init_Init_destructor(this: *mut root::std::ios_base_Init);
        }
        impl ios_base_Init {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                ios_base_Init_Init(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                ios_base_Init_Init_destructor(self)
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_ios {}
        pub type basic_ios_char_type = u8;
        pub type basic_ios_traits_type = u8;
        pub type basic_ios_int_type = u8;
        pub type basic_ios_pos_type = u8;
        pub type basic_ios_off_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_streambuf {}
        pub type basic_streambuf_char_type = u8;
        pub type basic_streambuf_traits_type = u8;
        pub type basic_streambuf_int_type = u8;
        pub type basic_streambuf_pos_type = u8;
        pub type basic_streambuf_off_type = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __num_get_base {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __num_get_base"][::std::mem::size_of::<__num_get_base>() - 1usize];
            ["Alignment of __num_get_base"][::std::mem::align_of::<__num_get_base>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__114__num_get_base10__get_baseERNS_8ios_baseE"]
            pub fn __num_get_base___get_base(
                arg1: *mut root::std::ios_base,
            ) -> ::std::os::raw::c_int;
        }
        impl __num_get_base {
            #[inline]
            pub unsafe fn __get_base(arg1: *mut root::std::ios_base) -> ::std::os::raw::c_int {
                __num_get_base___get_base(arg1)
            }
        }
        pub const __num_get_base___num_get_buf_sz: ::std::os::raw::c_int = 40;
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__114__num_get_base5__srcE"]
            pub static __num_get_base___src: [::std::os::raw::c_char; 33usize];
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__116__check_groupingERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPjS8_Rj"]
            pub fn __check_grouping(
                __grouping: *const root::std::string,
                __g: *mut ::std::os::raw::c_uint,
                __g_end: *mut ::std::os::raw::c_uint,
                __err: *mut root::std::ios_base_iostate,
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __num_get {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct num_get {}
        pub type num_get_char_type = u8;
        pub type num_get_iter_type = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __num_put_base {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __num_put_base"][::std::mem::size_of::<__num_put_base>() - 1usize];
            ["Alignment of __num_put_base"][::std::mem::align_of::<__num_put_base>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__114__num_put_base12__format_intEPcPKcbj"]
            pub fn __num_put_base___format_int(
                __fmt: *mut ::std::os::raw::c_char,
                __len: *const ::std::os::raw::c_char,
                __signd: bool,
                __flags: root::std::ios_base_fmtflags,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__114__num_put_base14__format_floatEPcPKcj"]
            pub fn __num_put_base___format_float(
                __fmt: *mut ::std::os::raw::c_char,
                __len: *const ::std::os::raw::c_char,
                __flags: root::std::ios_base_fmtflags,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__114__num_put_base18__identify_paddingEPcS1_RKNS_8ios_baseE"]
            pub fn __num_put_base___identify_padding(
                __nb: *mut ::std::os::raw::c_char,
                __ne: *mut ::std::os::raw::c_char,
                __iob: *const root::std::ios_base,
            ) -> *mut ::std::os::raw::c_char;
        }
        impl __num_put_base {
            #[inline]
            pub unsafe fn __format_int(
                __fmt: *mut ::std::os::raw::c_char,
                __len: *const ::std::os::raw::c_char,
                __signd: bool,
                __flags: root::std::ios_base_fmtflags,
            ) {
                __num_put_base___format_int(__fmt, __len, __signd, __flags)
            }
            #[inline]
            pub unsafe fn __format_float(
                __fmt: *mut ::std::os::raw::c_char,
                __len: *const ::std::os::raw::c_char,
                __flags: root::std::ios_base_fmtflags,
            ) -> bool {
                __num_put_base___format_float(__fmt, __len, __flags)
            }
            #[inline]
            pub unsafe fn __identify_padding(
                __nb: *mut ::std::os::raw::c_char,
                __ne: *mut ::std::os::raw::c_char,
                __iob: *const root::std::ios_base,
            ) -> *mut ::std::os::raw::c_char {
                __num_put_base___identify_padding(__nb, __ne, __iob)
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __num_put {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct num_put {}
        pub type num_put_char_type = u8;
        pub type num_put_iter_type = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct time_base {
            pub _bindgen_opaque_blob: u8,
        }
        pub const time_base_dateorder_no_order: root::std::time_base_dateorder = 0;
        pub const time_base_dateorder_dmy: root::std::time_base_dateorder = 1;
        pub const time_base_dateorder_mdy: root::std::time_base_dateorder = 2;
        pub const time_base_dateorder_ymd: root::std::time_base_dateorder = 3;
        pub const time_base_dateorder_ydm: root::std::time_base_dateorder = 4;
        pub type time_base_dateorder = ::std::os::raw::c_uint;
        const _: () = {
            ["Size of time_base"][::std::mem::size_of::<time_base>() - 1usize];
            ["Alignment of time_base"][::std::mem::align_of::<time_base>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __time_get_c_storage {}
        pub type __time_get_c_storage_string_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct time_get {}
        pub type time_get_char_type = u8;
        pub type time_get_iter_type = u8;
        pub type time_get_dateorder = u32;
        pub type time_get_string_type = u8;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __time_get {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of __time_get"][::std::mem::size_of::<__time_get>() - 8usize];
            ["Alignment of __time_get"][::std::mem::align_of::<__time_get>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110__time_getC1EPKc"]
            pub fn __time_get___time_get(
                this: *mut root::std::__time_get,
                __nm: *const ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110__time_getC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
            pub fn __time_get___time_get1(
                this: *mut root::std::__time_get,
                __nm: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110__time_getD1Ev"]
            pub fn __time_get___time_get_destructor(this: *mut root::std::__time_get);
        }
        impl __time_get {
            #[inline]
            pub unsafe fn new(__nm: *const ::std::os::raw::c_char) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                __time_get___time_get(__bindgen_tmp.as_mut_ptr(), __nm);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(__nm: *const root::std::string) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                __time_get___time_get1(__bindgen_tmp.as_mut_ptr(), __nm);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                __time_get___time_get_destructor(self)
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __time_get_storage {
            pub _address: u8,
        }
        pub type __time_get_storage_string_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct time_get_byname {
            pub _address: u8,
        }
        pub type time_get_byname_dateorder = u32;
        pub type time_get_byname_iter_type = u8;
        pub type time_get_byname_char_type = u8;
        pub type time_get_byname_string_type = u8;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __time_put {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of __time_put"][::std::mem::size_of::<__time_put>() - 8usize];
            ["Alignment of __time_put"][::std::mem::align_of::<__time_put>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__110__time_put8__do_putEPcRS1_PK2tmcc"]
            pub fn __time_put___do_put(
                this: *const root::std::__time_put,
                __nb: *mut ::std::os::raw::c_char,
                __ne: *mut *mut ::std::os::raw::c_char,
                __tm: *mut root::tm,
                __fmt: ::std::os::raw::c_char,
                __mod: ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt3__110__time_put8__do_putEPwRS1_PK2tmcc"]
            pub fn __time_put___do_put1(
                this: *const root::std::__time_put,
                __wb: *mut u32,
                __we: *mut *mut u32,
                __tm: *mut root::tm,
                __fmt: ::std::os::raw::c_char,
                __mod: ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110__time_putC1EPKc"]
            pub fn __time_put___time_put(
                this: *mut root::std::__time_put,
                __nm: *const ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110__time_putC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
            pub fn __time_put___time_put1(
                this: *mut root::std::__time_put,
                __nm: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__110__time_putD1Ev"]
            pub fn __time_put___time_put_destructor(this: *mut root::std::__time_put);
        }
        impl __time_put {
            #[inline]
            pub unsafe fn __do_put(
                &self,
                __nb: *mut ::std::os::raw::c_char,
                __ne: *mut *mut ::std::os::raw::c_char,
                __tm: *mut root::tm,
                __fmt: ::std::os::raw::c_char,
                __mod: ::std::os::raw::c_char,
            ) {
                __time_put___do_put(self, __nb, __ne, __tm, __fmt, __mod)
            }
            #[inline]
            pub unsafe fn __do_put1(
                &self,
                __wb: *mut u32,
                __we: *mut *mut u32,
                __tm: *mut root::tm,
                __fmt: ::std::os::raw::c_char,
                __mod: ::std::os::raw::c_char,
            ) {
                __time_put___do_put1(self, __wb, __we, __tm, __fmt, __mod)
            }
            #[inline]
            pub unsafe fn new(__nm: *const ::std::os::raw::c_char) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                __time_put___time_put(__bindgen_tmp.as_mut_ptr(), __nm);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(__nm: *const root::std::string) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                __time_put___time_put1(__bindgen_tmp.as_mut_ptr(), __nm);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                __time_put___time_put_destructor(self)
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct time_put {}
        pub type time_put_char_type = u8;
        pub type time_put_iter_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct time_put_byname {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct money_base {
            pub _bindgen_opaque_blob: u8,
        }
        pub const money_base_part_none: root::std::money_base_part = 0;
        pub const money_base_part_space: root::std::money_base_part = 1;
        pub const money_base_part_symbol: root::std::money_base_part = 2;
        pub const money_base_part_sign: root::std::money_base_part = 3;
        pub const money_base_part_value: root::std::money_base_part = 4;
        pub type money_base_part = ::std::os::raw::c_uint;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct money_base_pattern {
            pub _bindgen_opaque_blob: [u8; 4usize],
        }
        const _: () = {
            ["Size of money_base_pattern"][::std::mem::size_of::<money_base_pattern>() - 4usize];
            ["Alignment of money_base_pattern"]
                [::std::mem::align_of::<money_base_pattern>() - 1usize];
        };
        const _: () = {
            ["Size of money_base"][::std::mem::size_of::<money_base>() - 1usize];
            ["Alignment of money_base"][::std::mem::align_of::<money_base>() - 1usize];
        };
        pub type moneypunct_char_type = u8;
        pub type moneypunct_string_type = u8;
        extern "C" {
            pub static intl: bool;
        }
        pub type moneypunct_byname_pattern = [u8; 4usize];
        pub type moneypunct_byname_char_type = u8;
        pub type moneypunct_byname_string_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __money_get {
            pub _address: u8,
        }
        pub type __money_get_char_type = u8;
        pub type __money_get_string_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct money_get {}
        pub type money_get_char_type = u8;
        pub type money_get_iter_type = u8;
        pub type money_get_string_type = u8;
        extern "C" {
            #[link_name = "\u{1}__ZNSt3__112__do_nothingEPv"]
            pub fn __do_nothing(arg1: *mut ::std::os::raw::c_void);
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __money_put {
            pub _address: u8,
        }
        pub type __money_put_char_type = u8;
        pub type __money_put_string_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct money_put {}
        pub type money_put_char_type = u8;
        pub type money_put_iter_type = u8;
        pub type money_put_string_type = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct messages_base {
            pub _bindgen_opaque_blob: u8,
        }
        pub type messages_base_catalog = u64;
        const _: () = {
            ["Size of messages_base"][::std::mem::size_of::<messages_base>() - 1usize];
            ["Alignment of messages_base"][::std::mem::align_of::<messages_base>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct messages {}
        pub type messages_char_type = u8;
        pub type messages_string_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct messages_byname {
            pub _address: u8,
        }
        pub type messages_byname_catalog = u64;
        pub type messages_byname_string_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct wstring_convert {
            pub _address: u8,
        }
        pub type wstring_convert_byte_string = u8;
        pub type wstring_convert_wide_string = u8;
        pub type wstring_convert_state_type = u8;
        pub type wstring_convert_int_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct wbuffer_convert {}
        pub type wbuffer_convert_char_type = u8;
        pub type wbuffer_convert_traits_type = u8;
        pub type wbuffer_convert_int_type = u8;
        pub type wbuffer_convert_pos_type = u8;
        pub type wbuffer_convert_off_type = u8;
        pub type wbuffer_convert_state_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __temp_value {
            pub _address: u8,
        }
        pub type __temp_value__Traits = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Copy, Clone)]
        pub struct __temp_value__bindgen_ty_1 {
            pub _bindgen_opaque_blob: [u8; 0usize],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __split_buffer {
            pub _address: u8,
        }
        pub type __split_buffer_value_type = u8;
        pub type __split_buffer_allocator_type = u8;
        pub type __split_buffer___alloc_rr = u8;
        pub type __split_buffer___alloc_traits = u8;
        pub type __split_buffer_reference = u8;
        pub type __split_buffer_const_reference = u8;
        pub type __split_buffer_size_type = u8;
        pub type __split_buffer_difference_type = u8;
        pub type __split_buffer_pointer = u8;
        pub type __split_buffer_const_pointer = u8;
        pub type __split_buffer_iterator = u8;
        pub type __split_buffer_const_iterator = u8;
        pub type __split_buffer___alloc_ref = u8;
        pub type __split_buffer___alloc_const_ref = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __split_buffer__ConstructTransaction {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct vector {
            pub _address: u8,
        }
        pub type vector___default_allocator_type = u8;
        pub type vector___self = u8;
        pub type vector_value_type = u8;
        pub type vector_allocator_type = u8;
        pub type vector___alloc_traits = u8;
        pub type vector_reference = u8;
        pub type vector_const_reference = u8;
        pub type vector_size_type = u8;
        pub type vector_difference_type = u8;
        pub type vector_pointer = u8;
        pub type vector_const_pointer = u8;
        pub type vector_iterator = u8;
        pub type vector_const_iterator = u8;
        pub type vector_reverse_iterator = u8;
        pub type vector_const_reverse_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct vector___destroy_vector {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct vector__ConstructTransaction {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __builtin_new_allocator {
            pub _bindgen_opaque_blob: u8,
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct __builtin_new_allocator___builtin_new_deleter {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        pub type __builtin_new_allocator___builtin_new_deleter_pointer_type = u64;
        const _: () = {
            ["Size of __builtin_new_allocator___builtin_new_deleter"]
                [::std::mem::size_of::<__builtin_new_allocator___builtin_new_deleter>() - 16usize];
            ["Alignment of __builtin_new_allocator___builtin_new_deleter"]
                [::std::mem::align_of::<__builtin_new_allocator___builtin_new_deleter>() - 8usize];
        };
        pub type __builtin_new_allocator___holder_t = [u64; 3usize];
        const _: () = {
            ["Size of __builtin_new_allocator"]
                [::std::mem::size_of::<__builtin_new_allocator>() - 1usize];
            ["Alignment of __builtin_new_allocator"]
                [::std::mem::align_of::<__builtin_new_allocator>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_function_call {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_function_call"][::std::mem::size_of::<bad_function_call>() - 8usize];
            ["Alignment of bad_function_call"]
                [::std::mem::align_of::<bad_function_call>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct function {
            pub _address: u8,
        }
        pub mod __function {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __maybe_derive_from_unary_function {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __maybe_derive_from_binary_function {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __alloc_func {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __default_alloc_func {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __base {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __func {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __value_func {
                pub _address: u8,
            }
            #[repr(C)]
            #[repr(align(8))]
            #[derive(Copy, Clone)]
            pub union __policy_storage {
                pub _bindgen_opaque_blob: [u64; 2usize],
            }
            const _: () = {
                ["Size of __policy_storage"][::std::mem::size_of::<__policy_storage>() - 16usize];
                ["Alignment of __policy_storage"]
                    [::std::mem::align_of::<__policy_storage>() - 8usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __use_small_storage {
                pub _address: u8,
            }
            #[repr(C)]
            #[repr(align(8))]
            #[derive(Debug, Copy, Clone)]
            pub struct __policy {
                pub _bindgen_opaque_blob: [u64; 4usize],
            }
            const _: () = {
                ["Size of __policy"][::std::mem::size_of::<__policy>() - 32usize];
                ["Alignment of __policy"][::std::mem::align_of::<__policy>() - 8usize];
            };
            pub type __fast_forward = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __policy_invoker {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct __policy_func {
                pub _address: u8,
            }
            extern "C" {
                pub fn _Block_copy(
                    arg1: *const ::std::os::raw::c_void,
                ) -> *mut ::std::os::raw::c_void;
            }
            extern "C" {
                pub fn _Block_release(arg1: *const ::std::os::raw::c_void);
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __mem_fn {
            pub _address: u8,
        }
        pub type __mem_fn_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct mem_fun_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct mem_fun1_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct mem_fun_ref_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct mem_fun1_ref_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct const_mem_fun_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct const_mem_fun1_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct const_mem_fun_ref_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct const_mem_fun1_ref_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct pointer_to_binary_function {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct pointer_to_unary_function {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unary_negate {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct exception {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of exception"][::std::mem::size_of::<exception>() - 8usize];
            ["Alignment of exception"][::std::mem::align_of::<exception>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt9exceptionD1Ev"]
            pub fn exception_exception_destructor(this: *mut root::std::exception);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt9exception4whatEv"]
            pub fn exception_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_exception {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_exception"][::std::mem::size_of::<bad_exception>() - 8usize];
            ["Alignment of bad_exception"][::std::mem::align_of::<bad_exception>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt13bad_exceptionD1Ev"]
            pub fn bad_exception_bad_exception_destructor(this: *mut root::std::bad_exception);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt13bad_exception4whatEv"]
            pub fn bad_exception_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct nothrow_t {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of nothrow_t"][::std::mem::size_of::<nothrow_t>() - 1usize];
            ["Alignment of nothrow_t"][::std::mem::align_of::<nothrow_t>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZSt7nothrow"]
            pub static nothrow: root::std::nothrow_t;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_alloc {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_alloc"][::std::mem::size_of::<bad_alloc>() - 8usize];
            ["Alignment of bad_alloc"][::std::mem::align_of::<bad_alloc>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt9bad_allocC1Ev"]
            pub fn bad_alloc_bad_alloc(this: *mut root::std::bad_alloc);
        }
        impl bad_alloc {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                bad_alloc_bad_alloc(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt9bad_allocD1Ev"]
            pub fn bad_alloc_bad_alloc_destructor(this: *mut root::std::bad_alloc);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt9bad_alloc4whatEv"]
            pub fn bad_alloc_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_array_new_length {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_array_new_length"]
                [::std::mem::size_of::<bad_array_new_length>() - 8usize];
            ["Alignment of bad_array_new_length"]
                [::std::mem::align_of::<bad_array_new_length>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt20bad_array_new_lengthC1Ev"]
            pub fn bad_array_new_length_bad_array_new_length(
                this: *mut root::std::bad_array_new_length,
            );
        }
        impl bad_array_new_length {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                bad_array_new_length_bad_array_new_length(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt20bad_array_new_lengthD1Ev"]
            pub fn bad_array_new_length_bad_array_new_length_destructor(
                this: *mut root::std::bad_array_new_length,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt20bad_array_new_length4whatEv"]
            pub fn bad_array_new_length_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        pub type new_handler = u64;
        extern "C" {
            #[link_name = "\u{1}__ZSt15set_new_handlerPFvvE"]
            pub fn set_new_handler(arg1: root::std::new_handler) -> root::std::new_handler;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt15get_new_handlerv"]
            pub fn get_new_handler() -> root::std::new_handler;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt17__throw_bad_allocv"]
            pub fn __throw_bad_alloc();
        }
        pub type align_val_t = ::std::os::raw::c_ulong;
        pub type unexpected_handler = u64;
        extern "C" {
            #[link_name = "\u{1}__ZSt14set_unexpectedPFvvE"]
            pub fn set_unexpected(
                arg1: root::std::unexpected_handler,
            ) -> root::std::unexpected_handler;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt14get_unexpectedv"]
            pub fn get_unexpected() -> root::std::unexpected_handler;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt10unexpectedv"]
            pub fn unexpected();
        }
        pub type terminate_handler = u64;
        extern "C" {
            #[link_name = "\u{1}__ZSt13set_terminatePFvvE"]
            pub fn set_terminate(
                arg1: root::std::terminate_handler,
            ) -> root::std::terminate_handler;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt13get_terminatev"]
            pub fn get_terminate() -> root::std::terminate_handler;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt18uncaught_exceptionv"]
            pub fn uncaught_exception() -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt19uncaught_exceptionsv"]
            pub fn uncaught_exceptions() -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt17current_exceptionv"]
            pub fn current_exception() -> root::std::exception_ptr;
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt17rethrow_exceptionSt13exception_ptr"]
            pub fn rethrow_exception(arg1: root::std::exception_ptr);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct exception_ptr {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of exception_ptr"][::std::mem::size_of::<exception_ptr>() - 8usize];
            ["Alignment of exception_ptr"][::std::mem::align_of::<exception_ptr>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt13exception_ptrC1ERKS_"]
            pub fn exception_ptr_exception_ptr(
                this: *mut root::std::exception_ptr,
                arg1: *const root::std::exception_ptr,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt13exception_ptrD1Ev"]
            pub fn exception_ptr_exception_ptr_destructor(this: *mut root::std::exception_ptr);
        }
        impl exception_ptr {
            #[inline]
            pub unsafe fn new(arg1: *const root::std::exception_ptr) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                exception_ptr_exception_ptr(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                exception_ptr_exception_ptr_destructor(self)
            }
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct nested_exception {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of nested_exception"][::std::mem::size_of::<nested_exception>() - 16usize];
            ["Alignment of nested_exception"][::std::mem::align_of::<nested_exception>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNKSt16nested_exception14rethrow_nestedEv"]
            pub fn nested_exception_rethrow_nested(this: *const root::std::nested_exception);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt16nested_exceptionC1Ev"]
            pub fn nested_exception_nested_exception(this: *mut root::std::nested_exception);
        }
        impl nested_exception {
            #[inline]
            pub unsafe fn rethrow_nested(&self) {
                nested_exception_rethrow_nested(self)
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                nested_exception_nested_exception(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt16nested_exceptionD1Ev"]
            pub fn nested_exception_nested_exception_destructor(
                this: *mut root::std::nested_exception,
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __nested {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __can_dynamic_cast {
            pub _address: u8,
        }
        extern "C" {
            #[link_name = "\u{1}__ZSt9terminatev"]
            pub fn terminate();
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct initializer_list {
            pub _address: u8,
        }
        pub type initializer_list_value_type = u8;
        pub type initializer_list_reference = u8;
        pub type initializer_list_const_reference = u8;
        pub type initializer_list_size_type = u64;
        pub type initializer_list_iterator = u8;
        pub type initializer_list_const_iterator = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __type_info_implementations {
            pub _bindgen_opaque_blob: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __type_info_implementations___string_impl_base {
            pub _bindgen_opaque_blob: u8,
        }
        pub type __type_info_implementations___string_impl_base___type_name_t = u64;
        const _: () = {
            ["Size of __type_info_implementations___string_impl_base"]
                [::std::mem::size_of::<__type_info_implementations___string_impl_base>() - 1usize];
            ["Alignment of __type_info_implementations___string_impl_base"]
                [::std::mem::align_of::<__type_info_implementations___string_impl_base>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __type_info_implementations___unique_impl {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __type_info_implementations___unique_impl"]
                [::std::mem::size_of::<__type_info_implementations___unique_impl>() - 1usize];
            ["Alignment of __type_info_implementations___unique_impl"]
                [::std::mem::align_of::<__type_info_implementations___unique_impl>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __type_info_implementations___non_unique_impl {
            pub _bindgen_opaque_blob: u8,
        }
        const _: () = {
            ["Size of __type_info_implementations___non_unique_impl"]
                [::std::mem::size_of::<__type_info_implementations___non_unique_impl>() - 1usize];
            ["Alignment of __type_info_implementations___non_unique_impl"]
                [::std::mem::align_of::<__type_info_implementations___non_unique_impl>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone)]
        pub struct __type_info_implementations___non_unique_arm_rtti_bit_impl {
            pub _bindgen_opaque_blob: u8,
        }
        pub type __type_info_implementations___non_unique_arm_rtti_bit_impl___type_name_t = u64;
        pub type __type_info_implementations___non_unique_arm_rtti_bit_impl___non_unique_rtti_bit =
            u8;
        const _: () = {
            ["Size of __type_info_implementations___non_unique_arm_rtti_bit_impl"]
                [::std::mem::size_of::<__type_info_implementations___non_unique_arm_rtti_bit_impl>(
                ) - 1usize];
            ["Alignment of __type_info_implementations___non_unique_arm_rtti_bit_impl"]
                [::std::mem::align_of::<__type_info_implementations___non_unique_arm_rtti_bit_impl>(
                ) - 1usize];
        };
        pub type __type_info_implementations___impl = u8;
        const _: () = {
            ["Size of __type_info_implementations"]
                [::std::mem::size_of::<__type_info_implementations>() - 1usize];
            ["Alignment of __type_info_implementations"]
                [::std::mem::align_of::<__type_info_implementations>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct type_info {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        pub type type_info___impl = u8;
        const _: () = {
            ["Size of type_info"][::std::mem::size_of::<type_info>() - 16usize];
            ["Alignment of type_info"][::std::mem::align_of::<type_info>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt9type_infoD1Ev"]
            pub fn type_info_type_info_destructor(this: *mut root::std::type_info);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_cast {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_cast"][::std::mem::size_of::<bad_cast>() - 8usize];
            ["Alignment of bad_cast"][::std::mem::align_of::<bad_cast>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt8bad_castC1Ev"]
            pub fn bad_cast_bad_cast(this: *mut root::std::bad_cast);
        }
        impl bad_cast {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                bad_cast_bad_cast(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt8bad_castD1Ev"]
            pub fn bad_cast_bad_cast_destructor(this: *mut root::std::bad_cast);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt8bad_cast4whatEv"]
            pub fn bad_cast_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_typeid {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_typeid"][::std::mem::size_of::<bad_typeid>() - 8usize];
            ["Alignment of bad_typeid"][::std::mem::align_of::<bad_typeid>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt10bad_typeidC1Ev"]
            pub fn bad_typeid_bad_typeid(this: *mut root::std::bad_typeid);
        }
        impl bad_typeid {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                bad_typeid_bad_typeid(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt10bad_typeidD1Ev"]
            pub fn bad_typeid_bad_typeid_destructor(this: *mut root::std::bad_typeid);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt10bad_typeid4whatEv"]
            pub fn bad_typeid_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct logic_error {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of logic_error"][::std::mem::size_of::<logic_error>() - 16usize];
            ["Alignment of logic_error"][::std::mem::align_of::<logic_error>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt11logic_errorC1ERKNSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEE"]
            pub fn logic_error_logic_error(
                this: *mut root::std::logic_error,
                arg1: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt11logic_errorC1EPKc"]
            pub fn logic_error_logic_error1(
                this: *mut root::std::logic_error,
                arg1: *const ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt11logic_errorC1ERKS_"]
            pub fn logic_error_logic_error2(
                this: *mut root::std::logic_error,
                arg1: *const root::std::logic_error,
            );
        }
        impl logic_error {
            #[inline]
            pub unsafe fn new(arg1: *const root::std::string) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                logic_error_logic_error(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                logic_error_logic_error1(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new2(arg1: *const root::std::logic_error) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                logic_error_logic_error2(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt11logic_errorD1Ev"]
            pub fn logic_error_logic_error_destructor(this: *mut root::std::logic_error);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt11logic_error4whatEv"]
            pub fn logic_error_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct runtime_error {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of runtime_error"][::std::mem::size_of::<runtime_error>() - 16usize];
            ["Alignment of runtime_error"][::std::mem::align_of::<runtime_error>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt13runtime_errorC1ERKNSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEE"]
            pub fn runtime_error_runtime_error(
                this: *mut root::std::runtime_error,
                arg1: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt13runtime_errorC1EPKc"]
            pub fn runtime_error_runtime_error1(
                this: *mut root::std::runtime_error,
                arg1: *const ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt13runtime_errorC1ERKS_"]
            pub fn runtime_error_runtime_error2(
                this: *mut root::std::runtime_error,
                arg1: *const root::std::runtime_error,
            );
        }
        impl runtime_error {
            #[inline]
            pub unsafe fn new(arg1: *const root::std::string) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                runtime_error_runtime_error(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                runtime_error_runtime_error1(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new2(arg1: *const root::std::runtime_error) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                runtime_error_runtime_error2(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}__ZNSt13runtime_errorD1Ev"]
            pub fn runtime_error_runtime_error_destructor(this: *mut root::std::runtime_error);
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt13runtime_error4whatEv"]
            pub fn runtime_error_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct domain_error {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of domain_error"][::std::mem::size_of::<domain_error>() - 16usize];
            ["Alignment of domain_error"][::std::mem::align_of::<domain_error>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt12domain_errorD1Ev"]
            pub fn domain_error_domain_error_destructor(this: *mut root::std::domain_error);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct invalid_argument {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of invalid_argument"][::std::mem::size_of::<invalid_argument>() - 16usize];
            ["Alignment of invalid_argument"][::std::mem::align_of::<invalid_argument>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt16invalid_argumentD1Ev"]
            pub fn invalid_argument_invalid_argument_destructor(
                this: *mut root::std::invalid_argument,
            );
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct length_error {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of length_error"][::std::mem::size_of::<length_error>() - 16usize];
            ["Alignment of length_error"][::std::mem::align_of::<length_error>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt12length_errorD1Ev"]
            pub fn length_error_length_error_destructor(this: *mut root::std::length_error);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct out_of_range {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of out_of_range"][::std::mem::size_of::<out_of_range>() - 16usize];
            ["Alignment of out_of_range"][::std::mem::align_of::<out_of_range>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt12out_of_rangeD1Ev"]
            pub fn out_of_range_out_of_range_destructor(this: *mut root::std::out_of_range);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct range_error {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of range_error"][::std::mem::size_of::<range_error>() - 16usize];
            ["Alignment of range_error"][::std::mem::align_of::<range_error>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt11range_errorD1Ev"]
            pub fn range_error_range_error_destructor(this: *mut root::std::range_error);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct overflow_error {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of overflow_error"][::std::mem::size_of::<overflow_error>() - 16usize];
            ["Alignment of overflow_error"][::std::mem::align_of::<overflow_error>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt14overflow_errorD1Ev"]
            pub fn overflow_error_overflow_error_destructor(this: *mut root::std::overflow_error);
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct underflow_error {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        const _: () = {
            ["Size of underflow_error"][::std::mem::size_of::<underflow_error>() - 16usize];
            ["Alignment of underflow_error"][::std::mem::align_of::<underflow_error>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt15underflow_errorD1Ev"]
            pub fn underflow_error_underflow_error_destructor(
                this: *mut root::std::underflow_error,
            );
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_variant_access {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_variant_access"][::std::mem::size_of::<bad_variant_access>() - 8usize];
            ["Alignment of bad_variant_access"]
                [::std::mem::align_of::<bad_variant_access>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNKSt18bad_variant_access4whatEv"]
            pub fn bad_variant_access_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct bad_optional_access {
            pub _bindgen_opaque_blob: u64,
        }
        const _: () = {
            ["Size of bad_optional_access"][::std::mem::size_of::<bad_optional_access>() - 8usize];
            ["Alignment of bad_optional_access"]
                [::std::mem::align_of::<bad_optional_access>() - 8usize];
        };
        extern "C" {
            #[link_name = "\u{1}__ZNSt19bad_optional_accessD1Ev"]
            pub fn bad_optional_access_bad_optional_access_destructor(
                this: *mut root::std::bad_optional_access,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__ZNKSt19bad_optional_access4whatEv"]
            pub fn bad_optional_access_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
    }
    pub type max_align_t = f64;
    pub type __int8_t = ::std::os::raw::c_schar;
    pub type __uint8_t = ::std::os::raw::c_uchar;
    pub type __int16_t = ::std::os::raw::c_short;
    pub type __uint16_t = ::std::os::raw::c_ushort;
    pub type __int32_t = ::std::os::raw::c_int;
    pub type __uint32_t = ::std::os::raw::c_uint;
    pub type __int64_t = ::std::os::raw::c_longlong;
    pub type __uint64_t = ::std::os::raw::c_ulonglong;
    pub type __darwin_intptr_t = ::std::os::raw::c_long;
    pub type __darwin_natural_t = ::std::os::raw::c_uint;
    pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __mbstate_t {
        pub __mbstate8: [::std::os::raw::c_char; 128usize],
        pub _mbstateL: ::std::os::raw::c_longlong,
    }
    const _: () = {
        ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
        ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
        ["Offset of field: __mbstate_t::__mbstate8"]
            [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
        ["Offset of field: __mbstate_t::_mbstateL"]
            [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
    };
    pub type __darwin_mbstate_t = root::__mbstate_t;
    pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
    pub type __darwin_size_t = ::std::os::raw::c_ulong;
    pub type __darwin_va_list = root::__builtin_va_list;
    pub type __darwin_wchar_t = ::std::os::raw::c_int;
    pub type __darwin_rune_t = root::__darwin_wchar_t;
    pub type __darwin_wint_t = ::std::os::raw::c_int;
    pub type __darwin_clock_t = ::std::os::raw::c_ulong;
    pub type __darwin_socklen_t = root::__uint32_t;
    pub type __darwin_ssize_t = ::std::os::raw::c_long;
    pub type __darwin_time_t = ::std::os::raw::c_long;
    pub type __darwin_blkcnt_t = root::__int64_t;
    pub type __darwin_blksize_t = root::__int32_t;
    pub type __darwin_dev_t = root::__int32_t;
    pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
    pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
    pub type __darwin_gid_t = root::__uint32_t;
    pub type __darwin_id_t = root::__uint32_t;
    pub type __darwin_ino64_t = root::__uint64_t;
    pub type __darwin_ino_t = root::__darwin_ino64_t;
    pub type __darwin_mach_port_name_t = root::__darwin_natural_t;
    pub type __darwin_mach_port_t = root::__darwin_mach_port_name_t;
    pub type __darwin_mode_t = root::__uint16_t;
    pub type __darwin_off_t = root::__int64_t;
    pub type __darwin_pid_t = root::__int32_t;
    pub type __darwin_sigset_t = root::__uint32_t;
    pub type __darwin_suseconds_t = root::__int32_t;
    pub type __darwin_uid_t = root::__uint32_t;
    pub type __darwin_useconds_t = root::__uint32_t;
    pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
    pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_pthread_handler_rec {
        pub __routine:
            ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        pub __arg: *mut ::std::os::raw::c_void,
        pub __next: *mut root::__darwin_pthread_handler_rec,
    }
    const _: () = {
        ["Size of __darwin_pthread_handler_rec"]
            [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
        ["Alignment of __darwin_pthread_handler_rec"]
            [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
        ["Offset of field: __darwin_pthread_handler_rec::__routine"]
            [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
        ["Offset of field: __darwin_pthread_handler_rec::__arg"]
            [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
        ["Offset of field: __darwin_pthread_handler_rec::__next"]
            [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_attr_t {
        pub __sig: ::std::os::raw::c_long,
        pub __opaque: [::std::os::raw::c_char; 56usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_attr_t"]
            [::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
        ["Alignment of _opaque_pthread_attr_t"]
            [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
        ["Offset of field: _opaque_pthread_attr_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_attr_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_cond_t {
        pub __sig: ::std::os::raw::c_long,
        pub __opaque: [::std::os::raw::c_char; 40usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_cond_t"]
            [::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
        ["Alignment of _opaque_pthread_cond_t"]
            [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
        ["Offset of field: _opaque_pthread_cond_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_cond_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_condattr_t {
        pub __sig: ::std::os::raw::c_long,
        pub __opaque: [::std::os::raw::c_char; 8usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_condattr_t"]
            [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
        ["Alignment of _opaque_pthread_condattr_t"]
            [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
        ["Offset of field: _opaque_pthread_condattr_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_mutex_t {
        pub __sig: ::std::os::raw::c_long,
        pub __opaque: [::std::os::raw::c_char; 56usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_mutex_t"]
            [::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
        ["Alignment of _opaque_pthread_mutex_t"]
            [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
        ["Offset of field: _opaque_pthread_mutex_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_mutexattr_t {
        pub __sig: ::std::os::raw::c_long,
        pub __opaque: [::std::os::raw::c_char; 8usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_mutexattr_t"]
            [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
        ["Alignment of _opaque_pthread_mutexattr_t"]
            [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
        ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_once_t {
        pub __sig: ::std::os::raw::c_long,
        pub __opaque: [::std::os::raw::c_char; 8usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_once_t"]
            [::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
        ["Alignment of _opaque_pthread_once_t"]
            [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
        ["Offset of field: _opaque_pthread_once_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_once_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_rwlock_t {
        pub __sig: ::std::os::raw::c_long,
        pub __opaque: [::std::os::raw::c_char; 192usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_rwlock_t"]
            [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
        ["Alignment of _opaque_pthread_rwlock_t"]
            [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
        ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_rwlockattr_t {
        pub __sig: ::std::os::raw::c_long,
        pub __opaque: [::std::os::raw::c_char; 16usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_rwlockattr_t"]
            [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
        ["Alignment of _opaque_pthread_rwlockattr_t"]
            [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
        ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _opaque_pthread_t {
        pub __sig: ::std::os::raw::c_long,
        pub __cleanup_stack: *mut root::__darwin_pthread_handler_rec,
        pub __opaque: [::std::os::raw::c_char; 8176usize],
    }
    const _: () = {
        ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
        ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
        ["Offset of field: _opaque_pthread_t::__sig"]
            [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
        ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
            [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
        ["Offset of field: _opaque_pthread_t::__opaque"]
            [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
    };
    pub type __darwin_pthread_attr_t = root::_opaque_pthread_attr_t;
    pub type __darwin_pthread_cond_t = root::_opaque_pthread_cond_t;
    pub type __darwin_pthread_condattr_t = root::_opaque_pthread_condattr_t;
    pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
    pub type __darwin_pthread_mutex_t = root::_opaque_pthread_mutex_t;
    pub type __darwin_pthread_mutexattr_t = root::_opaque_pthread_mutexattr_t;
    pub type __darwin_pthread_once_t = root::_opaque_pthread_once_t;
    pub type __darwin_pthread_rwlock_t = root::_opaque_pthread_rwlock_t;
    pub type __darwin_pthread_rwlockattr_t = root::_opaque_pthread_rwlockattr_t;
    pub type __darwin_pthread_t = *mut root::_opaque_pthread_t;
    pub type __darwin_nl_item = ::std::os::raw::c_int;
    pub type __darwin_wctrans_t = ::std::os::raw::c_int;
    pub type __darwin_wctype_t = root::__uint32_t;
    pub const idtype_t_P_ALL: root::idtype_t = 0;
    pub const idtype_t_P_PID: root::idtype_t = 1;
    pub const idtype_t_P_PGID: root::idtype_t = 2;
    pub type idtype_t = ::std::os::raw::c_uint;
    pub type pid_t = root::__darwin_pid_t;
    pub type id_t = root::__darwin_id_t;
    pub type sig_atomic_t = ::std::os::raw::c_int;
    pub type u_int8_t = ::std::os::raw::c_uchar;
    pub type u_int16_t = ::std::os::raw::c_ushort;
    pub type u_int32_t = ::std::os::raw::c_uint;
    pub type u_int64_t = ::std::os::raw::c_ulonglong;
    pub type register_t = i64;
    pub type user_addr_t = root::u_int64_t;
    pub type user_size_t = root::u_int64_t;
    pub type user_ssize_t = i64;
    pub type user_long_t = i64;
    pub type user_ulong_t = root::u_int64_t;
    pub type user_time_t = i64;
    pub type user_off_t = i64;
    pub type syscall_arg_t = root::u_int64_t;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_exception_state {
        pub __exception: root::__uint32_t,
        pub __fsr: root::__uint32_t,
        pub __far: root::__uint32_t,
    }
    const _: () = {
        ["Size of __darwin_arm_exception_state"]
            [::std::mem::size_of::<__darwin_arm_exception_state>() - 12usize];
        ["Alignment of __darwin_arm_exception_state"]
            [::std::mem::align_of::<__darwin_arm_exception_state>() - 4usize];
        ["Offset of field: __darwin_arm_exception_state::__exception"]
            [::std::mem::offset_of!(__darwin_arm_exception_state, __exception) - 0usize];
        ["Offset of field: __darwin_arm_exception_state::__fsr"]
            [::std::mem::offset_of!(__darwin_arm_exception_state, __fsr) - 4usize];
        ["Offset of field: __darwin_arm_exception_state::__far"]
            [::std::mem::offset_of!(__darwin_arm_exception_state, __far) - 8usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_exception_state64 {
        pub __far: root::__uint64_t,
        pub __esr: root::__uint32_t,
        pub __exception: root::__uint32_t,
    }
    const _: () = {
        ["Size of __darwin_arm_exception_state64"]
            [::std::mem::size_of::<__darwin_arm_exception_state64>() - 16usize];
        ["Alignment of __darwin_arm_exception_state64"]
            [::std::mem::align_of::<__darwin_arm_exception_state64>() - 8usize];
        ["Offset of field: __darwin_arm_exception_state64::__far"]
            [::std::mem::offset_of!(__darwin_arm_exception_state64, __far) - 0usize];
        ["Offset of field: __darwin_arm_exception_state64::__esr"]
            [::std::mem::offset_of!(__darwin_arm_exception_state64, __esr) - 8usize];
        ["Offset of field: __darwin_arm_exception_state64::__exception"]
            [::std::mem::offset_of!(__darwin_arm_exception_state64, __exception) - 12usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_thread_state {
        pub __r: [root::__uint32_t; 13usize],
        pub __sp: root::__uint32_t,
        pub __lr: root::__uint32_t,
        pub __pc: root::__uint32_t,
        pub __cpsr: root::__uint32_t,
    }
    const _: () = {
        ["Size of __darwin_arm_thread_state"]
            [::std::mem::size_of::<__darwin_arm_thread_state>() - 68usize];
        ["Alignment of __darwin_arm_thread_state"]
            [::std::mem::align_of::<__darwin_arm_thread_state>() - 4usize];
        ["Offset of field: __darwin_arm_thread_state::__r"]
            [::std::mem::offset_of!(__darwin_arm_thread_state, __r) - 0usize];
        ["Offset of field: __darwin_arm_thread_state::__sp"]
            [::std::mem::offset_of!(__darwin_arm_thread_state, __sp) - 52usize];
        ["Offset of field: __darwin_arm_thread_state::__lr"]
            [::std::mem::offset_of!(__darwin_arm_thread_state, __lr) - 56usize];
        ["Offset of field: __darwin_arm_thread_state::__pc"]
            [::std::mem::offset_of!(__darwin_arm_thread_state, __pc) - 60usize];
        ["Offset of field: __darwin_arm_thread_state::__cpsr"]
            [::std::mem::offset_of!(__darwin_arm_thread_state, __cpsr) - 64usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_thread_state64 {
        pub __x: [root::__uint64_t; 29usize],
        pub __fp: root::__uint64_t,
        pub __lr: root::__uint64_t,
        pub __sp: root::__uint64_t,
        pub __pc: root::__uint64_t,
        pub __cpsr: root::__uint32_t,
        pub __pad: root::__uint32_t,
    }
    const _: () = {
        ["Size of __darwin_arm_thread_state64"]
            [::std::mem::size_of::<__darwin_arm_thread_state64>() - 272usize];
        ["Alignment of __darwin_arm_thread_state64"]
            [::std::mem::align_of::<__darwin_arm_thread_state64>() - 8usize];
        ["Offset of field: __darwin_arm_thread_state64::__x"]
            [::std::mem::offset_of!(__darwin_arm_thread_state64, __x) - 0usize];
        ["Offset of field: __darwin_arm_thread_state64::__fp"]
            [::std::mem::offset_of!(__darwin_arm_thread_state64, __fp) - 232usize];
        ["Offset of field: __darwin_arm_thread_state64::__lr"]
            [::std::mem::offset_of!(__darwin_arm_thread_state64, __lr) - 240usize];
        ["Offset of field: __darwin_arm_thread_state64::__sp"]
            [::std::mem::offset_of!(__darwin_arm_thread_state64, __sp) - 248usize];
        ["Offset of field: __darwin_arm_thread_state64::__pc"]
            [::std::mem::offset_of!(__darwin_arm_thread_state64, __pc) - 256usize];
        ["Offset of field: __darwin_arm_thread_state64::__cpsr"]
            [::std::mem::offset_of!(__darwin_arm_thread_state64, __cpsr) - 264usize];
        ["Offset of field: __darwin_arm_thread_state64::__pad"]
            [::std::mem::offset_of!(__darwin_arm_thread_state64, __pad) - 268usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_vfp_state {
        pub __r: [root::__uint32_t; 64usize],
        pub __fpscr: root::__uint32_t,
    }
    const _: () = {
        ["Size of __darwin_arm_vfp_state"]
            [::std::mem::size_of::<__darwin_arm_vfp_state>() - 260usize];
        ["Alignment of __darwin_arm_vfp_state"]
            [::std::mem::align_of::<__darwin_arm_vfp_state>() - 4usize];
        ["Offset of field: __darwin_arm_vfp_state::__r"]
            [::std::mem::offset_of!(__darwin_arm_vfp_state, __r) - 0usize];
        ["Offset of field: __darwin_arm_vfp_state::__fpscr"]
            [::std::mem::offset_of!(__darwin_arm_vfp_state, __fpscr) - 256usize];
    };
    #[repr(C)]
    #[repr(align(16))]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_neon_state64 {
        pub __v: [root::__uint128_t; 32usize],
        pub __fpsr: root::__uint32_t,
        pub __fpcr: root::__uint32_t,
    }
    const _: () = {
        ["Size of __darwin_arm_neon_state64"]
            [::std::mem::size_of::<__darwin_arm_neon_state64>() - 528usize];
        ["Alignment of __darwin_arm_neon_state64"]
            [::std::mem::align_of::<__darwin_arm_neon_state64>() - 16usize];
        ["Offset of field: __darwin_arm_neon_state64::__v"]
            [::std::mem::offset_of!(__darwin_arm_neon_state64, __v) - 0usize];
        ["Offset of field: __darwin_arm_neon_state64::__fpsr"]
            [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpsr) - 512usize];
        ["Offset of field: __darwin_arm_neon_state64::__fpcr"]
            [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpcr) - 516usize];
    };
    #[repr(C)]
    #[repr(align(16))]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_neon_state {
        pub __v: [root::__uint128_t; 16usize],
        pub __fpsr: root::__uint32_t,
        pub __fpcr: root::__uint32_t,
    }
    const _: () = {
        ["Size of __darwin_arm_neon_state"]
            [::std::mem::size_of::<__darwin_arm_neon_state>() - 272usize];
        ["Alignment of __darwin_arm_neon_state"]
            [::std::mem::align_of::<__darwin_arm_neon_state>() - 16usize];
        ["Offset of field: __darwin_arm_neon_state::__v"]
            [::std::mem::offset_of!(__darwin_arm_neon_state, __v) - 0usize];
        ["Offset of field: __darwin_arm_neon_state::__fpsr"]
            [::std::mem::offset_of!(__darwin_arm_neon_state, __fpsr) - 256usize];
        ["Offset of field: __darwin_arm_neon_state::__fpcr"]
            [::std::mem::offset_of!(__darwin_arm_neon_state, __fpcr) - 260usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __arm_pagein_state {
        pub __pagein_error: ::std::os::raw::c_int,
    }
    const _: () = {
        ["Size of __arm_pagein_state"][::std::mem::size_of::<__arm_pagein_state>() - 4usize];
        ["Alignment of __arm_pagein_state"][::std::mem::align_of::<__arm_pagein_state>() - 4usize];
        ["Offset of field: __arm_pagein_state::__pagein_error"]
            [::std::mem::offset_of!(__arm_pagein_state, __pagein_error) - 0usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __arm_legacy_debug_state {
        pub __bvr: [root::__uint32_t; 16usize],
        pub __bcr: [root::__uint32_t; 16usize],
        pub __wvr: [root::__uint32_t; 16usize],
        pub __wcr: [root::__uint32_t; 16usize],
    }
    const _: () = {
        ["Size of __arm_legacy_debug_state"]
            [::std::mem::size_of::<__arm_legacy_debug_state>() - 256usize];
        ["Alignment of __arm_legacy_debug_state"]
            [::std::mem::align_of::<__arm_legacy_debug_state>() - 4usize];
        ["Offset of field: __arm_legacy_debug_state::__bvr"]
            [::std::mem::offset_of!(__arm_legacy_debug_state, __bvr) - 0usize];
        ["Offset of field: __arm_legacy_debug_state::__bcr"]
            [::std::mem::offset_of!(__arm_legacy_debug_state, __bcr) - 64usize];
        ["Offset of field: __arm_legacy_debug_state::__wvr"]
            [::std::mem::offset_of!(__arm_legacy_debug_state, __wvr) - 128usize];
        ["Offset of field: __arm_legacy_debug_state::__wcr"]
            [::std::mem::offset_of!(__arm_legacy_debug_state, __wcr) - 192usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_debug_state32 {
        pub __bvr: [root::__uint32_t; 16usize],
        pub __bcr: [root::__uint32_t; 16usize],
        pub __wvr: [root::__uint32_t; 16usize],
        pub __wcr: [root::__uint32_t; 16usize],
        pub __mdscr_el1: root::__uint64_t,
    }
    const _: () = {
        ["Size of __darwin_arm_debug_state32"]
            [::std::mem::size_of::<__darwin_arm_debug_state32>() - 264usize];
        ["Alignment of __darwin_arm_debug_state32"]
            [::std::mem::align_of::<__darwin_arm_debug_state32>() - 8usize];
        ["Offset of field: __darwin_arm_debug_state32::__bvr"]
            [::std::mem::offset_of!(__darwin_arm_debug_state32, __bvr) - 0usize];
        ["Offset of field: __darwin_arm_debug_state32::__bcr"]
            [::std::mem::offset_of!(__darwin_arm_debug_state32, __bcr) - 64usize];
        ["Offset of field: __darwin_arm_debug_state32::__wvr"]
            [::std::mem::offset_of!(__darwin_arm_debug_state32, __wvr) - 128usize];
        ["Offset of field: __darwin_arm_debug_state32::__wcr"]
            [::std::mem::offset_of!(__darwin_arm_debug_state32, __wcr) - 192usize];
        ["Offset of field: __darwin_arm_debug_state32::__mdscr_el1"]
            [::std::mem::offset_of!(__darwin_arm_debug_state32, __mdscr_el1) - 256usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_debug_state64 {
        pub __bvr: [root::__uint64_t; 16usize],
        pub __bcr: [root::__uint64_t; 16usize],
        pub __wvr: [root::__uint64_t; 16usize],
        pub __wcr: [root::__uint64_t; 16usize],
        pub __mdscr_el1: root::__uint64_t,
    }
    const _: () = {
        ["Size of __darwin_arm_debug_state64"]
            [::std::mem::size_of::<__darwin_arm_debug_state64>() - 520usize];
        ["Alignment of __darwin_arm_debug_state64"]
            [::std::mem::align_of::<__darwin_arm_debug_state64>() - 8usize];
        ["Offset of field: __darwin_arm_debug_state64::__bvr"]
            [::std::mem::offset_of!(__darwin_arm_debug_state64, __bvr) - 0usize];
        ["Offset of field: __darwin_arm_debug_state64::__bcr"]
            [::std::mem::offset_of!(__darwin_arm_debug_state64, __bcr) - 128usize];
        ["Offset of field: __darwin_arm_debug_state64::__wvr"]
            [::std::mem::offset_of!(__darwin_arm_debug_state64, __wvr) - 256usize];
        ["Offset of field: __darwin_arm_debug_state64::__wcr"]
            [::std::mem::offset_of!(__darwin_arm_debug_state64, __wcr) - 384usize];
        ["Offset of field: __darwin_arm_debug_state64::__mdscr_el1"]
            [::std::mem::offset_of!(__darwin_arm_debug_state64, __mdscr_el1) - 512usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_arm_cpmu_state64 {
        pub __ctrs: [root::__uint64_t; 16usize],
    }
    const _: () = {
        ["Size of __darwin_arm_cpmu_state64"]
            [::std::mem::size_of::<__darwin_arm_cpmu_state64>() - 128usize];
        ["Alignment of __darwin_arm_cpmu_state64"]
            [::std::mem::align_of::<__darwin_arm_cpmu_state64>() - 8usize];
        ["Offset of field: __darwin_arm_cpmu_state64::__ctrs"]
            [::std::mem::offset_of!(__darwin_arm_cpmu_state64, __ctrs) - 0usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_mcontext32 {
        pub __es: root::__darwin_arm_exception_state,
        pub __ss: root::__darwin_arm_thread_state,
        pub __fs: root::__darwin_arm_vfp_state,
    }
    const _: () = {
        ["Size of __darwin_mcontext32"][::std::mem::size_of::<__darwin_mcontext32>() - 340usize];
        ["Alignment of __darwin_mcontext32"]
            [::std::mem::align_of::<__darwin_mcontext32>() - 4usize];
        ["Offset of field: __darwin_mcontext32::__es"]
            [::std::mem::offset_of!(__darwin_mcontext32, __es) - 0usize];
        ["Offset of field: __darwin_mcontext32::__ss"]
            [::std::mem::offset_of!(__darwin_mcontext32, __ss) - 12usize];
        ["Offset of field: __darwin_mcontext32::__fs"]
            [::std::mem::offset_of!(__darwin_mcontext32, __fs) - 80usize];
    };
    #[repr(C)]
    #[repr(align(16))]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_mcontext64 {
        pub __es: root::__darwin_arm_exception_state64,
        pub __ss: root::__darwin_arm_thread_state64,
        pub __ns: root::__darwin_arm_neon_state64,
    }
    const _: () = {
        ["Size of __darwin_mcontext64"][::std::mem::size_of::<__darwin_mcontext64>() - 816usize];
        ["Alignment of __darwin_mcontext64"]
            [::std::mem::align_of::<__darwin_mcontext64>() - 16usize];
        ["Offset of field: __darwin_mcontext64::__es"]
            [::std::mem::offset_of!(__darwin_mcontext64, __es) - 0usize];
        ["Offset of field: __darwin_mcontext64::__ss"]
            [::std::mem::offset_of!(__darwin_mcontext64, __ss) - 16usize];
        ["Offset of field: __darwin_mcontext64::__ns"]
            [::std::mem::offset_of!(__darwin_mcontext64, __ns) - 288usize];
    };
    pub type mcontext_t = *mut root::__darwin_mcontext64;
    pub type pthread_attr_t = root::__darwin_pthread_attr_t;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_sigaltstack {
        pub ss_sp: *mut ::std::os::raw::c_void,
        pub ss_size: root::__darwin_size_t,
        pub ss_flags: ::std::os::raw::c_int,
    }
    const _: () = {
        ["Size of __darwin_sigaltstack"][::std::mem::size_of::<__darwin_sigaltstack>() - 24usize];
        ["Alignment of __darwin_sigaltstack"]
            [::std::mem::align_of::<__darwin_sigaltstack>() - 8usize];
        ["Offset of field: __darwin_sigaltstack::ss_sp"]
            [::std::mem::offset_of!(__darwin_sigaltstack, ss_sp) - 0usize];
        ["Offset of field: __darwin_sigaltstack::ss_size"]
            [::std::mem::offset_of!(__darwin_sigaltstack, ss_size) - 8usize];
        ["Offset of field: __darwin_sigaltstack::ss_flags"]
            [::std::mem::offset_of!(__darwin_sigaltstack, ss_flags) - 16usize];
    };
    pub type stack_t = root::__darwin_sigaltstack;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __darwin_ucontext {
        pub uc_onstack: ::std::os::raw::c_int,
        pub uc_sigmask: root::__darwin_sigset_t,
        pub uc_stack: root::__darwin_sigaltstack,
        pub uc_link: *mut root::__darwin_ucontext,
        pub uc_mcsize: root::__darwin_size_t,
        pub uc_mcontext: *mut root::__darwin_mcontext64,
    }
    const _: () = {
        ["Size of __darwin_ucontext"][::std::mem::size_of::<__darwin_ucontext>() - 56usize];
        ["Alignment of __darwin_ucontext"][::std::mem::align_of::<__darwin_ucontext>() - 8usize];
        ["Offset of field: __darwin_ucontext::uc_onstack"]
            [::std::mem::offset_of!(__darwin_ucontext, uc_onstack) - 0usize];
        ["Offset of field: __darwin_ucontext::uc_sigmask"]
            [::std::mem::offset_of!(__darwin_ucontext, uc_sigmask) - 4usize];
        ["Offset of field: __darwin_ucontext::uc_stack"]
            [::std::mem::offset_of!(__darwin_ucontext, uc_stack) - 8usize];
        ["Offset of field: __darwin_ucontext::uc_link"]
            [::std::mem::offset_of!(__darwin_ucontext, uc_link) - 32usize];
        ["Offset of field: __darwin_ucontext::uc_mcsize"]
            [::std::mem::offset_of!(__darwin_ucontext, uc_mcsize) - 40usize];
        ["Offset of field: __darwin_ucontext::uc_mcontext"]
            [::std::mem::offset_of!(__darwin_ucontext, uc_mcontext) - 48usize];
    };
    pub type ucontext_t = root::__darwin_ucontext;
    pub type sigset_t = root::__darwin_sigset_t;
    pub type uid_t = root::__darwin_uid_t;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union sigval {
        pub sival_int: ::std::os::raw::c_int,
        pub sival_ptr: *mut ::std::os::raw::c_void,
    }
    const _: () = {
        ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
        ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
        ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
        ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
    };
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct sigevent {
        pub sigev_notify: ::std::os::raw::c_int,
        pub sigev_signo: ::std::os::raw::c_int,
        pub sigev_value: root::sigval,
        pub sigev_notify_function: ::std::option::Option<unsafe extern "C" fn(arg1: root::sigval)>,
        pub sigev_notify_attributes: *mut root::pthread_attr_t,
    }
    const _: () = {
        ["Size of sigevent"][::std::mem::size_of::<sigevent>() - 32usize];
        ["Alignment of sigevent"][::std::mem::align_of::<sigevent>() - 8usize];
        ["Offset of field: sigevent::sigev_notify"]
            [::std::mem::offset_of!(sigevent, sigev_notify) - 0usize];
        ["Offset of field: sigevent::sigev_signo"]
            [::std::mem::offset_of!(sigevent, sigev_signo) - 4usize];
        ["Offset of field: sigevent::sigev_value"]
            [::std::mem::offset_of!(sigevent, sigev_value) - 8usize];
        ["Offset of field: sigevent::sigev_notify_function"]
            [::std::mem::offset_of!(sigevent, sigev_notify_function) - 16usize];
        ["Offset of field: sigevent::sigev_notify_attributes"]
            [::std::mem::offset_of!(sigevent, sigev_notify_attributes) - 24usize];
    };
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct __siginfo {
        pub si_signo: ::std::os::raw::c_int,
        pub si_errno: ::std::os::raw::c_int,
        pub si_code: ::std::os::raw::c_int,
        pub si_pid: root::pid_t,
        pub si_uid: root::uid_t,
        pub si_status: ::std::os::raw::c_int,
        pub si_addr: *mut ::std::os::raw::c_void,
        pub si_value: root::sigval,
        pub si_band: ::std::os::raw::c_long,
        pub __pad: [::std::os::raw::c_ulong; 7usize],
    }
    const _: () = {
        ["Size of __siginfo"][::std::mem::size_of::<__siginfo>() - 104usize];
        ["Alignment of __siginfo"][::std::mem::align_of::<__siginfo>() - 8usize];
        ["Offset of field: __siginfo::si_signo"]
            [::std::mem::offset_of!(__siginfo, si_signo) - 0usize];
        ["Offset of field: __siginfo::si_errno"]
            [::std::mem::offset_of!(__siginfo, si_errno) - 4usize];
        ["Offset of field: __siginfo::si_code"]
            [::std::mem::offset_of!(__siginfo, si_code) - 8usize];
        ["Offset of field: __siginfo::si_pid"][::std::mem::offset_of!(__siginfo, si_pid) - 12usize];
        ["Offset of field: __siginfo::si_uid"][::std::mem::offset_of!(__siginfo, si_uid) - 16usize];
        ["Offset of field: __siginfo::si_status"]
            [::std::mem::offset_of!(__siginfo, si_status) - 20usize];
        ["Offset of field: __siginfo::si_addr"]
            [::std::mem::offset_of!(__siginfo, si_addr) - 24usize];
        ["Offset of field: __siginfo::si_value"]
            [::std::mem::offset_of!(__siginfo, si_value) - 32usize];
        ["Offset of field: __siginfo::si_band"]
            [::std::mem::offset_of!(__siginfo, si_band) - 40usize];
        ["Offset of field: __siginfo::__pad"][::std::mem::offset_of!(__siginfo, __pad) - 48usize];
    };
    pub type siginfo_t = root::__siginfo;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __sigaction_u {
        pub __sa_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        pub __sa_sigaction: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: *mut root::__siginfo,
                arg3: *mut ::std::os::raw::c_void,
            ),
        >,
    }
    const _: () = {
        ["Size of __sigaction_u"][::std::mem::size_of::<__sigaction_u>() - 8usize];
        ["Alignment of __sigaction_u"][::std::mem::align_of::<__sigaction_u>() - 8usize];
        ["Offset of field: __sigaction_u::__sa_handler"]
            [::std::mem::offset_of!(__sigaction_u, __sa_handler) - 0usize];
        ["Offset of field: __sigaction_u::__sa_sigaction"]
            [::std::mem::offset_of!(__sigaction_u, __sa_sigaction) - 0usize];
    };
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct __sigaction {
        pub __sigaction_u: root::__sigaction_u,
        pub sa_tramp: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                arg4: *mut root::siginfo_t,
                arg5: *mut ::std::os::raw::c_void,
            ),
        >,
        pub sa_mask: root::sigset_t,
        pub sa_flags: ::std::os::raw::c_int,
    }
    const _: () = {
        ["Size of __sigaction"][::std::mem::size_of::<__sigaction>() - 24usize];
        ["Alignment of __sigaction"][::std::mem::align_of::<__sigaction>() - 8usize];
        ["Offset of field: __sigaction::__sigaction_u"]
            [::std::mem::offset_of!(__sigaction, __sigaction_u) - 0usize];
        ["Offset of field: __sigaction::sa_tramp"]
            [::std::mem::offset_of!(__sigaction, sa_tramp) - 8usize];
        ["Offset of field: __sigaction::sa_mask"]
            [::std::mem::offset_of!(__sigaction, sa_mask) - 16usize];
        ["Offset of field: __sigaction::sa_flags"]
            [::std::mem::offset_of!(__sigaction, sa_flags) - 20usize];
    };
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct sigaction {
        pub __sigaction_u: root::__sigaction_u,
        pub sa_mask: root::sigset_t,
        pub sa_flags: ::std::os::raw::c_int,
    }
    const _: () = {
        ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 16usize];
        ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 8usize];
        ["Offset of field: sigaction::__sigaction_u"]
            [::std::mem::offset_of!(sigaction, __sigaction_u) - 0usize];
        ["Offset of field: sigaction::sa_mask"]
            [::std::mem::offset_of!(sigaction, sa_mask) - 8usize];
        ["Offset of field: sigaction::sa_flags"]
            [::std::mem::offset_of!(sigaction, sa_flags) - 12usize];
    };
    pub type sig_t = ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct sigvec {
        pub sv_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        pub sv_mask: ::std::os::raw::c_int,
        pub sv_flags: ::std::os::raw::c_int,
    }
    const _: () = {
        ["Size of sigvec"][::std::mem::size_of::<sigvec>() - 16usize];
        ["Alignment of sigvec"][::std::mem::align_of::<sigvec>() - 8usize];
        ["Offset of field: sigvec::sv_handler"]
            [::std::mem::offset_of!(sigvec, sv_handler) - 0usize];
        ["Offset of field: sigvec::sv_mask"][::std::mem::offset_of!(sigvec, sv_mask) - 8usize];
        ["Offset of field: sigvec::sv_flags"][::std::mem::offset_of!(sigvec, sv_flags) - 12usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct sigstack {
        pub ss_sp: *mut ::std::os::raw::c_char,
        pub ss_onstack: ::std::os::raw::c_int,
    }
    const _: () = {
        ["Size of sigstack"][::std::mem::size_of::<sigstack>() - 16usize];
        ["Alignment of sigstack"][::std::mem::align_of::<sigstack>() - 8usize];
        ["Offset of field: sigstack::ss_sp"][::std::mem::offset_of!(sigstack, ss_sp) - 0usize];
        ["Offset of field: sigstack::ss_onstack"]
            [::std::mem::offset_of!(sigstack, ss_onstack) - 8usize];
    };
    extern "C" {
        pub fn signal(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        ) -> ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
            ),
        >;
    }
    pub type int_least8_t = i8;
    pub type int_least16_t = i16;
    pub type int_least32_t = i32;
    pub type int_least64_t = i64;
    pub type uint_least8_t = u8;
    pub type uint_least16_t = u16;
    pub type uint_least32_t = u32;
    pub type uint_least64_t = u64;
    pub type int_fast8_t = i8;
    pub type int_fast16_t = i16;
    pub type int_fast32_t = i32;
    pub type int_fast64_t = i64;
    pub type uint_fast8_t = u8;
    pub type uint_fast16_t = u16;
    pub type uint_fast32_t = u32;
    pub type uint_fast64_t = u64;
    pub type intmax_t = ::std::os::raw::c_long;
    pub type uintmax_t = ::std::os::raw::c_ulong;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct timeval {
        pub tv_sec: root::__darwin_time_t,
        pub tv_usec: root::__darwin_suseconds_t,
    }
    const _: () = {
        ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
        ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
        ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
        ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
    };
    pub type rlim_t = root::__uint64_t;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct rusage {
        pub ru_utime: root::timeval,
        pub ru_stime: root::timeval,
        pub ru_maxrss: ::std::os::raw::c_long,
        pub ru_ixrss: ::std::os::raw::c_long,
        pub ru_idrss: ::std::os::raw::c_long,
        pub ru_isrss: ::std::os::raw::c_long,
        pub ru_minflt: ::std::os::raw::c_long,
        pub ru_majflt: ::std::os::raw::c_long,
        pub ru_nswap: ::std::os::raw::c_long,
        pub ru_inblock: ::std::os::raw::c_long,
        pub ru_oublock: ::std::os::raw::c_long,
        pub ru_msgsnd: ::std::os::raw::c_long,
        pub ru_msgrcv: ::std::os::raw::c_long,
        pub ru_nsignals: ::std::os::raw::c_long,
        pub ru_nvcsw: ::std::os::raw::c_long,
        pub ru_nivcsw: ::std::os::raw::c_long,
    }
    const _: () = {
        ["Size of rusage"][::std::mem::size_of::<rusage>() - 144usize];
        ["Alignment of rusage"][::std::mem::align_of::<rusage>() - 8usize];
        ["Offset of field: rusage::ru_utime"][::std::mem::offset_of!(rusage, ru_utime) - 0usize];
        ["Offset of field: rusage::ru_stime"][::std::mem::offset_of!(rusage, ru_stime) - 16usize];
        ["Offset of field: rusage::ru_maxrss"][::std::mem::offset_of!(rusage, ru_maxrss) - 32usize];
        ["Offset of field: rusage::ru_ixrss"][::std::mem::offset_of!(rusage, ru_ixrss) - 40usize];
        ["Offset of field: rusage::ru_idrss"][::std::mem::offset_of!(rusage, ru_idrss) - 48usize];
        ["Offset of field: rusage::ru_isrss"][::std::mem::offset_of!(rusage, ru_isrss) - 56usize];
        ["Offset of field: rusage::ru_minflt"][::std::mem::offset_of!(rusage, ru_minflt) - 64usize];
        ["Offset of field: rusage::ru_majflt"][::std::mem::offset_of!(rusage, ru_majflt) - 72usize];
        ["Offset of field: rusage::ru_nswap"][::std::mem::offset_of!(rusage, ru_nswap) - 80usize];
        ["Offset of field: rusage::ru_inblock"]
            [::std::mem::offset_of!(rusage, ru_inblock) - 88usize];
        ["Offset of field: rusage::ru_oublock"]
            [::std::mem::offset_of!(rusage, ru_oublock) - 96usize];
        ["Offset of field: rusage::ru_msgsnd"]
            [::std::mem::offset_of!(rusage, ru_msgsnd) - 104usize];
        ["Offset of field: rusage::ru_msgrcv"]
            [::std::mem::offset_of!(rusage, ru_msgrcv) - 112usize];
        ["Offset of field: rusage::ru_nsignals"]
            [::std::mem::offset_of!(rusage, ru_nsignals) - 120usize];
        ["Offset of field: rusage::ru_nvcsw"][::std::mem::offset_of!(rusage, ru_nvcsw) - 128usize];
        ["Offset of field: rusage::ru_nivcsw"]
            [::std::mem::offset_of!(rusage, ru_nivcsw) - 136usize];
    };
    pub type rusage_info_t = *mut ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct rusage_info_v0 {
        pub ri_uuid: [u8; 16usize],
        pub ri_user_time: u64,
        pub ri_system_time: u64,
        pub ri_pkg_idle_wkups: u64,
        pub ri_interrupt_wkups: u64,
        pub ri_pageins: u64,
        pub ri_wired_size: u64,
        pub ri_resident_size: u64,
        pub ri_phys_footprint: u64,
        pub ri_proc_start_abstime: u64,
        pub ri_proc_exit_abstime: u64,
    }
    const _: () = {
        ["Size of rusage_info_v0"][::std::mem::size_of::<rusage_info_v0>() - 96usize];
        ["Alignment of rusage_info_v0"][::std::mem::align_of::<rusage_info_v0>() - 8usize];
        ["Offset of field: rusage_info_v0::ri_uuid"]
            [::std::mem::offset_of!(rusage_info_v0, ri_uuid) - 0usize];
        ["Offset of field: rusage_info_v0::ri_user_time"]
            [::std::mem::offset_of!(rusage_info_v0, ri_user_time) - 16usize];
        ["Offset of field: rusage_info_v0::ri_system_time"]
            [::std::mem::offset_of!(rusage_info_v0, ri_system_time) - 24usize];
        ["Offset of field: rusage_info_v0::ri_pkg_idle_wkups"]
            [::std::mem::offset_of!(rusage_info_v0, ri_pkg_idle_wkups) - 32usize];
        ["Offset of field: rusage_info_v0::ri_interrupt_wkups"]
            [::std::mem::offset_of!(rusage_info_v0, ri_interrupt_wkups) - 40usize];
        ["Offset of field: rusage_info_v0::ri_pageins"]
            [::std::mem::offset_of!(rusage_info_v0, ri_pageins) - 48usize];
        ["Offset of field: rusage_info_v0::ri_wired_size"]
            [::std::mem::offset_of!(rusage_info_v0, ri_wired_size) - 56usize];
        ["Offset of field: rusage_info_v0::ri_resident_size"]
            [::std::mem::offset_of!(rusage_info_v0, ri_resident_size) - 64usize];
        ["Offset of field: rusage_info_v0::ri_phys_footprint"]
            [::std::mem::offset_of!(rusage_info_v0, ri_phys_footprint) - 72usize];
        ["Offset of field: rusage_info_v0::ri_proc_start_abstime"]
            [::std::mem::offset_of!(rusage_info_v0, ri_proc_start_abstime) - 80usize];
        ["Offset of field: rusage_info_v0::ri_proc_exit_abstime"]
            [::std::mem::offset_of!(rusage_info_v0, ri_proc_exit_abstime) - 88usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct rusage_info_v1 {
        pub ri_uuid: [u8; 16usize],
        pub ri_user_time: u64,
        pub ri_system_time: u64,
        pub ri_pkg_idle_wkups: u64,
        pub ri_interrupt_wkups: u64,
        pub ri_pageins: u64,
        pub ri_wired_size: u64,
        pub ri_resident_size: u64,
        pub ri_phys_footprint: u64,
        pub ri_proc_start_abstime: u64,
        pub ri_proc_exit_abstime: u64,
        pub ri_child_user_time: u64,
        pub ri_child_system_time: u64,
        pub ri_child_pkg_idle_wkups: u64,
        pub ri_child_interrupt_wkups: u64,
        pub ri_child_pageins: u64,
        pub ri_child_elapsed_abstime: u64,
    }
    const _: () = {
        ["Size of rusage_info_v1"][::std::mem::size_of::<rusage_info_v1>() - 144usize];
        ["Alignment of rusage_info_v1"][::std::mem::align_of::<rusage_info_v1>() - 8usize];
        ["Offset of field: rusage_info_v1::ri_uuid"]
            [::std::mem::offset_of!(rusage_info_v1, ri_uuid) - 0usize];
        ["Offset of field: rusage_info_v1::ri_user_time"]
            [::std::mem::offset_of!(rusage_info_v1, ri_user_time) - 16usize];
        ["Offset of field: rusage_info_v1::ri_system_time"]
            [::std::mem::offset_of!(rusage_info_v1, ri_system_time) - 24usize];
        ["Offset of field: rusage_info_v1::ri_pkg_idle_wkups"]
            [::std::mem::offset_of!(rusage_info_v1, ri_pkg_idle_wkups) - 32usize];
        ["Offset of field: rusage_info_v1::ri_interrupt_wkups"]
            [::std::mem::offset_of!(rusage_info_v1, ri_interrupt_wkups) - 40usize];
        ["Offset of field: rusage_info_v1::ri_pageins"]
            [::std::mem::offset_of!(rusage_info_v1, ri_pageins) - 48usize];
        ["Offset of field: rusage_info_v1::ri_wired_size"]
            [::std::mem::offset_of!(rusage_info_v1, ri_wired_size) - 56usize];
        ["Offset of field: rusage_info_v1::ri_resident_size"]
            [::std::mem::offset_of!(rusage_info_v1, ri_resident_size) - 64usize];
        ["Offset of field: rusage_info_v1::ri_phys_footprint"]
            [::std::mem::offset_of!(rusage_info_v1, ri_phys_footprint) - 72usize];
        ["Offset of field: rusage_info_v1::ri_proc_start_abstime"]
            [::std::mem::offset_of!(rusage_info_v1, ri_proc_start_abstime) - 80usize];
        ["Offset of field: rusage_info_v1::ri_proc_exit_abstime"]
            [::std::mem::offset_of!(rusage_info_v1, ri_proc_exit_abstime) - 88usize];
        ["Offset of field: rusage_info_v1::ri_child_user_time"]
            [::std::mem::offset_of!(rusage_info_v1, ri_child_user_time) - 96usize];
        ["Offset of field: rusage_info_v1::ri_child_system_time"]
            [::std::mem::offset_of!(rusage_info_v1, ri_child_system_time) - 104usize];
        ["Offset of field: rusage_info_v1::ri_child_pkg_idle_wkups"]
            [::std::mem::offset_of!(rusage_info_v1, ri_child_pkg_idle_wkups) - 112usize];
        ["Offset of field: rusage_info_v1::ri_child_interrupt_wkups"]
            [::std::mem::offset_of!(rusage_info_v1, ri_child_interrupt_wkups) - 120usize];
        ["Offset of field: rusage_info_v1::ri_child_pageins"]
            [::std::mem::offset_of!(rusage_info_v1, ri_child_pageins) - 128usize];
        ["Offset of field: rusage_info_v1::ri_child_elapsed_abstime"]
            [::std::mem::offset_of!(rusage_info_v1, ri_child_elapsed_abstime) - 136usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct rusage_info_v2 {
        pub ri_uuid: [u8; 16usize],
        pub ri_user_time: u64,
        pub ri_system_time: u64,
        pub ri_pkg_idle_wkups: u64,
        pub ri_interrupt_wkups: u64,
        pub ri_pageins: u64,
        pub ri_wired_size: u64,
        pub ri_resident_size: u64,
        pub ri_phys_footprint: u64,
        pub ri_proc_start_abstime: u64,
        pub ri_proc_exit_abstime: u64,
        pub ri_child_user_time: u64,
        pub ri_child_system_time: u64,
        pub ri_child_pkg_idle_wkups: u64,
        pub ri_child_interrupt_wkups: u64,
        pub ri_child_pageins: u64,
        pub ri_child_elapsed_abstime: u64,
        pub ri_diskio_bytesread: u64,
        pub ri_diskio_byteswritten: u64,
    }
    const _: () = {
        ["Size of rusage_info_v2"][::std::mem::size_of::<rusage_info_v2>() - 160usize];
        ["Alignment of rusage_info_v2"][::std::mem::align_of::<rusage_info_v2>() - 8usize];
        ["Offset of field: rusage_info_v2::ri_uuid"]
            [::std::mem::offset_of!(rusage_info_v2, ri_uuid) - 0usize];
        ["Offset of field: rusage_info_v2::ri_user_time"]
            [::std::mem::offset_of!(rusage_info_v2, ri_user_time) - 16usize];
        ["Offset of field: rusage_info_v2::ri_system_time"]
            [::std::mem::offset_of!(rusage_info_v2, ri_system_time) - 24usize];
        ["Offset of field: rusage_info_v2::ri_pkg_idle_wkups"]
            [::std::mem::offset_of!(rusage_info_v2, ri_pkg_idle_wkups) - 32usize];
        ["Offset of field: rusage_info_v2::ri_interrupt_wkups"]
            [::std::mem::offset_of!(rusage_info_v2, ri_interrupt_wkups) - 40usize];
        ["Offset of field: rusage_info_v2::ri_pageins"]
            [::std::mem::offset_of!(rusage_info_v2, ri_pageins) - 48usize];
        ["Offset of field: rusage_info_v2::ri_wired_size"]
            [::std::mem::offset_of!(rusage_info_v2, ri_wired_size) - 56usize];
        ["Offset of field: rusage_info_v2::ri_resident_size"]
            [::std::mem::offset_of!(rusage_info_v2, ri_resident_size) - 64usize];
        ["Offset of field: rusage_info_v2::ri_phys_footprint"]
            [::std::mem::offset_of!(rusage_info_v2, ri_phys_footprint) - 72usize];
        ["Offset of field: rusage_info_v2::ri_proc_start_abstime"]
            [::std::mem::offset_of!(rusage_info_v2, ri_proc_start_abstime) - 80usize];
        ["Offset of field: rusage_info_v2::ri_proc_exit_abstime"]
            [::std::mem::offset_of!(rusage_info_v2, ri_proc_exit_abstime) - 88usize];
        ["Offset of field: rusage_info_v2::ri_child_user_time"]
            [::std::mem::offset_of!(rusage_info_v2, ri_child_user_time) - 96usize];
        ["Offset of field: rusage_info_v2::ri_child_system_time"]
            [::std::mem::offset_of!(rusage_info_v2, ri_child_system_time) - 104usize];
        ["Offset of field: rusage_info_v2::ri_child_pkg_idle_wkups"]
            [::std::mem::offset_of!(rusage_info_v2, ri_child_pkg_idle_wkups) - 112usize];
        ["Offset of field: rusage_info_v2::ri_child_interrupt_wkups"]
            [::std::mem::offset_of!(rusage_info_v2, ri_child_interrupt_wkups) - 120usize];
        ["Offset of field: rusage_info_v2::ri_child_pageins"]
            [::std::mem::offset_of!(rusage_info_v2, ri_child_pageins) - 128usize];
        ["Offset of field: rusage_info_v2::ri_child_elapsed_abstime"]
            [::std::mem::offset_of!(rusage_info_v2, ri_child_elapsed_abstime) - 136usize];
        ["Offset of field: rusage_info_v2::ri_diskio_bytesread"]
            [::std::mem::offset_of!(rusage_info_v2, ri_diskio_bytesread) - 144usize];
        ["Offset of field: rusage_info_v2::ri_diskio_byteswritten"]
            [::std::mem::offset_of!(rusage_info_v2, ri_diskio_byteswritten) - 152usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct rusage_info_v3 {
        pub ri_uuid: [u8; 16usize],
        pub ri_user_time: u64,
        pub ri_system_time: u64,
        pub ri_pkg_idle_wkups: u64,
        pub ri_interrupt_wkups: u64,
        pub ri_pageins: u64,
        pub ri_wired_size: u64,
        pub ri_resident_size: u64,
        pub ri_phys_footprint: u64,
        pub ri_proc_start_abstime: u64,
        pub ri_proc_exit_abstime: u64,
        pub ri_child_user_time: u64,
        pub ri_child_system_time: u64,
        pub ri_child_pkg_idle_wkups: u64,
        pub ri_child_interrupt_wkups: u64,
        pub ri_child_pageins: u64,
        pub ri_child_elapsed_abstime: u64,
        pub ri_diskio_bytesread: u64,
        pub ri_diskio_byteswritten: u64,
        pub ri_cpu_time_qos_default: u64,
        pub ri_cpu_time_qos_maintenance: u64,
        pub ri_cpu_time_qos_background: u64,
        pub ri_cpu_time_qos_utility: u64,
        pub ri_cpu_time_qos_legacy: u64,
        pub ri_cpu_time_qos_user_initiated: u64,
        pub ri_cpu_time_qos_user_interactive: u64,
        pub ri_billed_system_time: u64,
        pub ri_serviced_system_time: u64,
    }
    const _: () = {
        ["Size of rusage_info_v3"][::std::mem::size_of::<rusage_info_v3>() - 232usize];
        ["Alignment of rusage_info_v3"][::std::mem::align_of::<rusage_info_v3>() - 8usize];
        ["Offset of field: rusage_info_v3::ri_uuid"]
            [::std::mem::offset_of!(rusage_info_v3, ri_uuid) - 0usize];
        ["Offset of field: rusage_info_v3::ri_user_time"]
            [::std::mem::offset_of!(rusage_info_v3, ri_user_time) - 16usize];
        ["Offset of field: rusage_info_v3::ri_system_time"]
            [::std::mem::offset_of!(rusage_info_v3, ri_system_time) - 24usize];
        ["Offset of field: rusage_info_v3::ri_pkg_idle_wkups"]
            [::std::mem::offset_of!(rusage_info_v3, ri_pkg_idle_wkups) - 32usize];
        ["Offset of field: rusage_info_v3::ri_interrupt_wkups"]
            [::std::mem::offset_of!(rusage_info_v3, ri_interrupt_wkups) - 40usize];
        ["Offset of field: rusage_info_v3::ri_pageins"]
            [::std::mem::offset_of!(rusage_info_v3, ri_pageins) - 48usize];
        ["Offset of field: rusage_info_v3::ri_wired_size"]
            [::std::mem::offset_of!(rusage_info_v3, ri_wired_size) - 56usize];
        ["Offset of field: rusage_info_v3::ri_resident_size"]
            [::std::mem::offset_of!(rusage_info_v3, ri_resident_size) - 64usize];
        ["Offset of field: rusage_info_v3::ri_phys_footprint"]
            [::std::mem::offset_of!(rusage_info_v3, ri_phys_footprint) - 72usize];
        ["Offset of field: rusage_info_v3::ri_proc_start_abstime"]
            [::std::mem::offset_of!(rusage_info_v3, ri_proc_start_abstime) - 80usize];
        ["Offset of field: rusage_info_v3::ri_proc_exit_abstime"]
            [::std::mem::offset_of!(rusage_info_v3, ri_proc_exit_abstime) - 88usize];
        ["Offset of field: rusage_info_v3::ri_child_user_time"]
            [::std::mem::offset_of!(rusage_info_v3, ri_child_user_time) - 96usize];
        ["Offset of field: rusage_info_v3::ri_child_system_time"]
            [::std::mem::offset_of!(rusage_info_v3, ri_child_system_time) - 104usize];
        ["Offset of field: rusage_info_v3::ri_child_pkg_idle_wkups"]
            [::std::mem::offset_of!(rusage_info_v3, ri_child_pkg_idle_wkups) - 112usize];
        ["Offset of field: rusage_info_v3::ri_child_interrupt_wkups"]
            [::std::mem::offset_of!(rusage_info_v3, ri_child_interrupt_wkups) - 120usize];
        ["Offset of field: rusage_info_v3::ri_child_pageins"]
            [::std::mem::offset_of!(rusage_info_v3, ri_child_pageins) - 128usize];
        ["Offset of field: rusage_info_v3::ri_child_elapsed_abstime"]
            [::std::mem::offset_of!(rusage_info_v3, ri_child_elapsed_abstime) - 136usize];
        ["Offset of field: rusage_info_v3::ri_diskio_bytesread"]
            [::std::mem::offset_of!(rusage_info_v3, ri_diskio_bytesread) - 144usize];
        ["Offset of field: rusage_info_v3::ri_diskio_byteswritten"]
            [::std::mem::offset_of!(rusage_info_v3, ri_diskio_byteswritten) - 152usize];
        ["Offset of field: rusage_info_v3::ri_cpu_time_qos_default"]
            [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_default) - 160usize];
        ["Offset of field: rusage_info_v3::ri_cpu_time_qos_maintenance"]
            [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_maintenance) - 168usize];
        ["Offset of field: rusage_info_v3::ri_cpu_time_qos_background"]
            [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_background) - 176usize];
        ["Offset of field: rusage_info_v3::ri_cpu_time_qos_utility"]
            [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_utility) - 184usize];
        ["Offset of field: rusage_info_v3::ri_cpu_time_qos_legacy"]
            [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_legacy) - 192usize];
