/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const SWIFT_ABI_ANDROID_ARM64_SWIFT_SPARE_BITS_MASK: u64 = 67553994410557447;
pub const SWIFT_ABI_ANDROID_ARM64_OBJC_RESERVED_BITS_MASK: u32 = 0;
pub const SWIFT_ABI_ARM64_SWIFT_SPARE_BITS_MASK: i64 = -1152921504606846969;
pub const SWIFT_ABI_ARM64_OBJC_RESERVED_BITS_MASK: i64 = -9223372036854775808;
pub const SWIFT_ABI_ARM64_OBJC_NUM_RESERVED_LOW_BITS: u32 = 0;
pub const SWIFT_ABI_ARM64_IS_OBJC_BIT: u64 = 4611686018427387904;
pub const SWIFT_ABI_ARM64_OBJC_WEAK_REFERENCE_MARKER_MASK: i64 = -9223372036854775807;
pub const SWIFT_ABI_ARM64_OBJC_WEAK_REFERENCE_MARKER_VALUE: u32 = 1;
pub const SWIFT_ABI_POWERPC_SWIFT_SPARE_BITS_MASK: u32 = 3;
pub const SWIFT_ABI_POWERPC64_SWIFT_SPARE_BITS_MASK: i64 = -72057594037927929;
pub const SWIFT_ABI_S390X_SWIFT_SPARE_BITS_MASK: i64 = -72057594037927929;
pub const SWIFT_ABI_S390X_OBJC_RESERVED_BITS_MASK: i64 = -9223372036854775808;
pub const SWIFT_ABI_S390X_OBJC_NUM_RESERVED_LOW_BITS: u32 = 0;
pub const SWIFT_ABI_S390X_IS_OBJC_BIT: u64 = 4611686018427387904;
pub const SWIFT_ABI_S390X_OBJC_WEAK_REFERENCE_MARKER_MASK: i64 = -9223372036854775807;
pub const SWIFT_ABI_S390X_OBJC_WEAK_REFERENCE_MARKER_VALUE: u32 = 1;
pub const SWIFT_ABI_WASM32_LEAST_VALID_POINTER: u32 = 4096;
pub const SWIFT_TARGET_OS_SIMULATOR: u32 = 0;
pub const SWIFT_TARGET_OS_DARWIN: u32 = 1;
pub const SWIFT_ABI_HEAP_OBJECT_HEADER_SIZE_64: u32 = 16;
pub const SWIFT_ABI_HEAP_OBJECT_HEADER_SIZE_32: u32 = 8;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__122__libcpp_verbose_abortEPKcz"]
    pub fn std___libcpp_verbose_abort(__format: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15__useEPKcz"]
    pub fn std___use(arg1: *const ::std::os::raw::c_char, ...);
}
pub type std___enable_if_t = u8;
pub type std_enable_if_t = u8;
pub type std_integral_constant_value_type<_Tp> = _Tp;
pub type std_integral_constant_type = u8;
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std_value: _Tp;
}
pub type std_true_type = u8;
pub type std_false_type = u8;
pub type std__BoolConstant = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_const {
    pub _address: u8,
}
pub type std_remove_const_type<_Tp> = _Tp;
pub type std___remove_const_t<_Tp> = _Tp;
pub type std_remove_const_t<_Tp> = std___remove_const_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_volatile {
    pub _address: u8,
}
pub type std_remove_volatile_type<_Tp> = _Tp;
pub type std___remove_volatile_t<_Tp> = _Tp;
pub type std_remove_volatile_t<_Tp> = std___remove_volatile_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_cv {
    pub _address: u8,
}
pub type std_remove_cv_type<_Tp> = _Tp;
pub type std___remove_cv_t<_Tp> = _Tp;
pub type std_remove_cv_t<_Tp> = std___remove_cv_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_integral {
    pub _address: u8,
}
pub const std___libcpp_is_integral_value: std___libcpp_is_integral__bindgen_ty_1 = 0;
pub type std___libcpp_is_integral__bindgen_ty_1 = i32;
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_bool__close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_bool__close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_char_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_char_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_signed_char_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_signed_char_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_unsigned_char_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_unsigned_char_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_wchar_t_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_wchar_t_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_char16_t_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_char16_t_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_char32_t_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_char32_t_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_short_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_short_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_unsigned_short_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_unsigned_short_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_int_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_int_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_unsigned_int_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_unsigned_int_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_long_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_long_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_unsigned_long_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_unsigned_long_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_long_long_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_long_long_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_unsigned_long_long_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_unsigned_long_long_close0"] [:: std :: mem :: align_of :: < std___libcpp_is_integral > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0___int128_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0___int128_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_integral_open0_unsigned___int128_close0"]
        [::std::mem::size_of::<std___libcpp_is_integral>() - 1usize];
    ["Align of template specialization: std___libcpp_is_integral_open0_unsigned___int128_close0"]
        [::std::mem::align_of::<std___libcpp_is_integral>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_integral {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_alignment_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_const {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_lvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_rvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_same {
    pub _address: u8,
}
pub type std__IsSame = std__BoolConstant;
pub type std__IsNotSame = std__BoolConstant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_referenceable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_void {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_reference {
    pub _address: u8,
}
pub type std_remove_reference_type<_Tp> = _Tp;
pub type std___libcpp_remove_reference_t<_Tp> = _Tp;
pub type std_remove_reference_t<_Tp> = std___libcpp_remove_reference_t<_Tp>;
pub type std___add_pointer_t<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_pointer {
    pub _address: u8,
}
pub type std_add_pointer_type = std___add_pointer_t<_Tp>;
pub type std_add_pointer_t<_Tp> = std___add_pointer_t<_Tp>;
pub type std__If = u8;
pub type std_conditional_type<_If> = _If;
pub type std_conditional_t = u8;
pub type std___conditional_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_array {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_extent {
    pub _address: u8,
}
pub type std_remove_extent_type<_Tp> = _Tp;
pub type std___remove_extent_t<_Tp> = _Tp;
pub type std_remove_extent_t<_Tp> = std___remove_extent_t<_Tp>;
pub type std___decay_t<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_decay {
    pub _address: u8,
}
pub type std_decay_type = std___decay_t<_Tp>;
pub type std_decay_t<_Tp> = std___decay_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_base_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_class {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_convertible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_const {
    pub _address: u8,
}
pub type std_add_const_type<_Tp> = _Tp;
pub type std_add_const_t = std_add_const;
pub type std___add_lvalue_reference_t<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_lvalue_reference {
    pub _address: u8,
}
pub type std_add_lvalue_reference_type = std___add_lvalue_reference_t<_Tp>;
pub type std_add_lvalue_reference_t<_Tp> = std___add_lvalue_reference_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_final {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_final {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_polymorphic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_cv {
    pub _address: u8,
}
pub type std_add_cv_type<_Tp> = _Tp;
pub type std_add_cv_t = std_add_cv;
pub type std___add_rvalue_reference_t<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_rvalue_reference {
    pub _address: u8,
}
pub type std_add_rvalue_reference_type<_Tp> = std___add_rvalue_reference_t<_Tp>;
pub type std_add_rvalue_reference_t<_Tp> = std___add_rvalue_reference_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_volatile {
    pub _address: u8,
}
pub type std_add_volatile_type<_Tp> = _Tp;
pub type std_add_volatile_t = std_add_volatile;
#[repr(C)]
#[derive(Debug)]
pub struct std___nat {
    pub _address: u8,
}
const _: () = {
    ["Size of std___nat"][::std::mem::size_of::<std___nat>() - 1usize];
    ["Alignment of std___nat"][::std::mem::align_of::<std___nat>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_list {
    pub _address: u8,
}
pub type std___type_list__Head<_Hp> = _Hp;
pub type std___type_list__Tail<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___align_type {
    pub _address: u8,
}
pub type std___align_type_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___struct_double {
    pub __lx: f64,
}
const _: () = {
    ["Size of std___struct_double"][::std::mem::size_of::<std___struct_double>() - 8usize];
    ["Alignment of std___struct_double"][::std::mem::align_of::<std___struct_double>() - 8usize];
    ["Offset of field: std___struct_double::__lx"]
        [::std::mem::offset_of!(std___struct_double, __lx) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___struct_double4 {
    pub __lx: [f64; 4usize],
}
const _: () = {
    ["Size of std___struct_double4"][::std::mem::size_of::<std___struct_double4>() - 32usize];
    ["Alignment of std___struct_double4"][::std::mem::align_of::<std___struct_double4>() - 8usize];
    ["Offset of field: std___struct_double4::__lx"]
        [::std::mem::offset_of!(std___struct_double4, __lx) - 0usize];
};
pub type std___all_types = std___type_list;
extern "C" {
    #[link_name = "\u{1}__min"]
    pub static std___select_align___min: ::std::os::raw::c_ulong;
}
extern "C" {
    #[link_name = "\u{1}__max"]
    pub static std___select_align___max: ::std::os::raw::c_ulong;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___select_align_value: ::std::os::raw::c_ulong;
}
pub type std_aligned_storage__Aligner = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub union std_aligned_storage_type {
    pub __align: std_aligned_storage__Aligner,
    pub __data: *mut ::std::os::raw::c_uchar,
}
const _: () = {
    ["Size of std_aligned_storage_type"]
        [::std::mem::size_of::<std_aligned_storage_type>() - 8usize];
    ["Alignment of std_aligned_storage_type"]
        [::std::mem::align_of::<std_aligned_storage_type>() - 8usize];
};
pub type std_aligned_storage_t = u8;
pub type std_aligned_union_type = u8;
pub type std_aligned_union_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_volatile {
    pub _address: u8,
}
pub type std___apply_cv_impl___apply<_Up> = _Up;
pub type std___apply_cv_t = u8;
pub type std___remove_const_ref_t<_Tp> = std___remove_const_t<std___libcpp_remove_reference_t<_Tp>>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___extract_key_fail_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___extract_key_fail_tag"]
        [::std::mem::size_of::<std___extract_key_fail_tag>() - 1usize];
    ["Alignment of std___extract_key_fail_tag"]
        [::std::mem::align_of::<std___extract_key_fail_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___extract_key_self_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___extract_key_self_tag"]
        [::std::mem::size_of::<std___extract_key_self_tag>() - 1usize];
    ["Alignment of std___extract_key_self_tag"]
        [::std::mem::align_of::<std___extract_key_self_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___extract_key_first_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___extract_key_first_tag"]
        [::std::mem::size_of::<std___extract_key_first_tag>() - 1usize];
    ["Alignment of std___extract_key_first_tag"]
        [::std::mem::align_of::<std___extract_key_first_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_extract_key {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_extract_map_key {
    pub _address: u8,
}
pub type std___remove_cvref_t<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_same_uncvref {
    pub _address: u8,
}
pub type std___void_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_type2_imp {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_type_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_types {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_common_type {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_common_type_open0_close0"]
        [::std::mem::size_of::<std_common_type>() - 1usize];
    ["Align of template specialization: std_common_type_open0_close0"]
        [::std::mem::align_of::<std_common_type>() - 1usize];
};
pub type std_common_type_t = std_common_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___copy_cv {
    pub _address: u8,
}
pub type std___copy_cv_type<_To> = _To;
pub type std___copy_cv_t = std___copy_cv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___copy_cvref {
    pub _address: u8,
}
pub type std___copy_cvref_type = std___copy_cv_t;
pub type std___copy_cvref_t = std___copy_cvref;
pub type std___expand_to_true = std_true_type;
pub type std__And<_Pred> = _Pred;
pub type std__Or = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_all_extents {
    pub _address: u8,
}
pub type std_remove_all_extents_type<_Tp> = _Tp;
pub type std___remove_all_extents_t<_Tp> = _Tp;
pub type std_remove_all_extents_t<_Tp> = std___remove_all_extents_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_has_virtual_destructor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_core_convertible {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_member_pointer {
    pub _address: u8,
}
pub const std___libcpp_is_member_pointer___is_member: std___libcpp_is_member_pointer__bindgen_ty_1 =
    0;
pub const std___libcpp_is_member_pointer___is_func: std___libcpp_is_member_pointer__bindgen_ty_1 =
    0;
pub const std___libcpp_is_member_pointer___is_obj: std___libcpp_is_member_pointer__bindgen_ty_1 = 0;
pub type std___libcpp_is_member_pointer__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_function_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_object_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_reference_wrapper_impl {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_reference_wrapper {
    pub _base: std___is_reference_wrapper_impl,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___any {
    pub _address: u8,
}
const _: () = {
    ["Size of std___any"][::std::mem::size_of::<std___any>() - 1usize];
    ["Alignment of std___any"][::std::mem::align_of::<std___any>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15__anyC1Ez"]
    pub fn std___any___any(this: *mut std___any, ...);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___member_pointer_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___member_pointer_class_type {
    pub _address: u8,
}
pub type std___enable_if_bullet1 = u8;
pub type std___enable_if_bullet2 = u8;
pub type std___enable_if_bullet3 = u8;
pub type std___enable_if_bullet4 = u8;
pub type std___enable_if_bullet5 = u8;
pub type std___enable_if_bullet6 = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invokable_r {
    pub _address: u8,
}
pub type std___invokable_r__Result<_Fp> = _Fp;
pub type std___invokable_r_type = std___conditional_t;
pub type std___invokable = std___invokable_r;
pub type std___nothrow_invokable_r = u8;
pub type std___nothrow_invokable = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_abstract {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_floating_point {
    pub _base: std_false_type,
}
const _: () = {
    ["Size of template specialization: std___libcpp_is_floating_point_open0_float_close0"]
        [::std::mem::size_of::<std___libcpp_is_floating_point>() - 1usize];
    ["Align of template specialization: std___libcpp_is_floating_point_open0_float_close0"]
        [::std::mem::align_of::<std___libcpp_is_floating_point>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_floating_point_open0_double_close0"]
        [::std::mem::size_of::<std___libcpp_is_floating_point>() - 1usize];
    ["Align of template specialization: std___libcpp_is_floating_point_open0_double_close0"]
        [::std::mem::align_of::<std___libcpp_is_floating_point>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_floating_point_open0_long_double_close0"]
        [::std::mem::size_of::<std___libcpp_is_floating_point>() - 1usize];
    ["Align of template specialization: std___libcpp_is_floating_point_open0_long_double_close0"]
        [::std::mem::align_of::<std___libcpp_is_floating_point>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_floating_point {
    pub _base: std___libcpp_is_floating_point,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_bounded_array {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_callable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_standard_layout {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivial {
    pub _address: u8,
}
pub type std__IsCharLikeType = std__And<_Pred>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nullptr_t_impl {
    pub _base: std_false_type,
}
const _: () = {
    ["Size of template specialization: std___is_nullptr_t_impl_open0_nullptr_t_close0"]
        [::std::mem::size_of::<std___is_nullptr_t_impl>() - 1usize];
    ["Align of template specialization: std___is_nullptr_t_impl_open0_nullptr_t_close0"]
        [::std::mem::align_of::<std___is_nullptr_t_impl>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nullptr_t {
    pub _base: std___is_nullptr_t_impl,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_null_pointer {
    pub _base: std___is_nullptr_t_impl,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_fundamental {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_compound {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_empty {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_enum {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_implicitly_default_constructible {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_literal_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Lazy {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_scalar {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_union {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_object {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pod {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_underlying_type {
    pub _address: u8,
}
pub type std_underlying_type_t = std_underlying_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_signed {
    pub _address: u8,
}
pub type std___swap_result_t = u8;
pub type std___detail___swappable_with___swap1<_Tp> = _Tp;
pub type std___detail___swappable_with___swap2<_Up> = _Up;
pub const __block_size: std___detail__bindgen_ty_1 = 64;
pub type std___detail__bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nothrow_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copyable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_unbounded_array {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_unsigned {
    pub _address: u8,
}
pub type std___make_const_lvalue_ref<_Tp> = *const std___libcpp_remove_reference_t<_Tp>;
pub type std___make_signed_t<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_signed {
    pub _address: u8,
}
pub type std_make_signed_type = std___make_signed_t<_Tp>;
pub type std_make_signed_t<_Tp> = std___make_signed_t<_Tp>;
pub type std___make_unsigned_t<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_unsigned {
    pub _address: u8,
}
pub type std_make_unsigned_type = std___make_unsigned_t<_Tp>;
pub type std_make_unsigned_t<_Tp> = std___make_unsigned_t<_Tp>;
pub type std___copy_unsigned_t = std___conditional_t;
pub type std___maybe_const = std___conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Not {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_rank {
    pub _base: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_pointer {
    pub _address: u8,
}
pub type std_remove_pointer_type<_Tp> = _Tp;
pub type std___remove_pointer_t<_Tp> = _Tp;
pub type std_remove_pointer_t<_Tp> = std___remove_pointer_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_result_of {
    pub _address: u8,
}
pub type std_result_of_t = std_result_of;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_identity {
    pub _address: u8,
}
pub type std___type_identity_type<_Tp> = _Tp;
pub type std___type_identity_t = std___type_identity;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unwrap_reference {
    pub _address: u8,
}
pub type std___unwrap_reference_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unwrap_ref_decay {
    pub _address: u8,
}
pub type std___move_if_noexcept_result_t = std___conditional_t;
pub const std_float_round_style_round_indeterminate: std_float_round_style = -1;
pub const std_float_round_style_round_toward_zero: std_float_round_style = 0;
pub const std_float_round_style_round_to_nearest: std_float_round_style = 1;
pub const std_float_round_style_round_toward_infinity: std_float_round_style = 2;
pub const std_float_round_style_round_toward_neg_infinity: std_float_round_style = 3;
pub type std_float_round_style = ::std::os::raw::c_int;
pub const std_float_denorm_style_denorm_indeterminate: std_float_denorm_style = -1;
pub const std_float_denorm_style_denorm_absent: std_float_denorm_style = 0;
pub const std_float_denorm_style_denorm_present: std_float_denorm_style = 1;
pub type std_float_denorm_style = ::std::os::raw::c_int;
pub type std___libcpp_numeric_limits_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numeric_limits {
    pub _address: u8,
}
pub type std_numeric_limits___base = u8;
pub type std_numeric_limits_type = std_numeric_limits___base;
extern "C" {
    #[link_name = "\u{1}is_specialized"]
    pub static std_is_specialized: bool;
}
extern "C" {
    #[link_name = "\u{1}digits"]
    pub static std_digits: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}digits10"]
    pub static std_digits10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}max_digits10"]
    pub static std_max_digits10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}is_signed"]
    pub static std_is_signed: bool;
}
extern "C" {
    #[link_name = "\u{1}is_integer"]
    pub static std_is_integer: bool;
}
extern "C" {
    #[link_name = "\u{1}is_exact"]
    pub static std_is_exact: bool;
}
extern "C" {
    #[link_name = "\u{1}radix"]
    pub static std_radix: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}min_exponent"]
    pub static std_min_exponent: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}min_exponent10"]
    pub static std_min_exponent10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}max_exponent"]
    pub static std_max_exponent: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}max_exponent10"]
    pub static std_max_exponent10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}has_infinity"]
    pub static std_has_infinity: bool;
}
extern "C" {
    #[link_name = "\u{1}has_quiet_NaN"]
    pub static std_has_quiet_NaN: bool;
}
extern "C" {
    #[link_name = "\u{1}has_signaling_NaN"]
    pub static std_has_signaling_NaN: bool;
}
extern "C" {
    #[link_name = "\u{1}has_denorm"]
    pub static std_has_denorm: std_float_denorm_style;
}
extern "C" {
    #[link_name = "\u{1}has_denorm_loss"]
    pub static std_has_denorm_loss: bool;
}
extern "C" {
    #[link_name = "\u{1}is_iec559"]
    pub static std_is_iec559: bool;
}
extern "C" {
    #[link_name = "\u{1}is_bounded"]
    pub static std_is_bounded: bool;
}
extern "C" {
    #[link_name = "\u{1}is_modulo"]
    pub static std_is_modulo: bool;
}
extern "C" {
    #[link_name = "\u{1}traps"]
    pub static std_traps: bool;
}
extern "C" {
    #[link_name = "\u{1}tinyness_before"]
    pub static std_tinyness_before: bool;
}
extern "C" {
    #[link_name = "\u{1}round_style"]
    pub static std_round_style: std_float_round_style;
}
#[repr(C)]
#[derive(Debug)]
pub struct std___exception_guard_exceptions<_Rollback> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Rollback>>,
    pub __rollback_: _Rollback,
    pub __completed_: bool,
}
#[repr(C)]
#[derive(Debug)]
pub struct std___exception_guard_noexceptions {
    pub __completed_: bool,
}
pub type std___exception_guard<_Rollback> = std___exception_guard_exceptions<_Rollback>;
pub type std___integer_sequence___convert = u8;
pub type std___integer_sequence___to_tuple_indices = u8;
pub type std___make_indices_imp = u8;
pub type std_integer_sequence_value_type<_Tp> = _Tp;
pub type std_index_sequence = u8;
pub type std___make_integer_sequence = u8;
pub type std_make_integer_sequence = std___make_integer_sequence;
pub type std_make_index_sequence = std_make_integer_sequence;
pub type std_index_sequence_for = std_make_index_sequence;
pub type std___make_tuple_indices_type = std___make_indices_imp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_types {
    pub _address: u8,
}
pub type std_tuple_element_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple_size {
    pub _address: u8,
}
pub type std___enable_if_tuple_size_imp<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_tuple_types_flat {
    pub _address: u8,
}
pub type std___make_tuple_types__RawTp<_Tp> =
    std___remove_cv_t<std___libcpp_remove_reference_t<_Tp>>;
pub type std___make_tuple_types__Maker = std___make_tuple_types_flat;
pub type std___make_tuple_types_type = std___make_tuple_types__Maker;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_like_ext {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_sfinae_base {
    pub _address: u8,
}
pub type std___tuple_sfinae_base___constructible = std_is_constructible;
pub type std___tuple_sfinae_base___convertible = std_is_convertible;
pub type std___tuple_sfinae_base___assignable = std_is_assignable;
const _: () = {
    ["Size of std___tuple_sfinae_base"][::std::mem::size_of::<std___tuple_sfinae_base>() - 1usize];
    ["Alignment of std___tuple_sfinae_base"]
        [::std::mem::align_of::<std___tuple_sfinae_base>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___check_tuple_constructor_fail {
    pub _address: u8,
}
const _: () = {
    ["Size of std___check_tuple_constructor_fail"]
        [::std::mem::size_of::<std___check_tuple_constructor_fail>() - 1usize];
    ["Alignment of std___check_tuple_constructor_fail"]
        [::std::mem::align_of::<std___check_tuple_constructor_fail>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_piecewise_construct_t {
    pub _address: u8,
}
const _: () = {
    ["Size of std_piecewise_construct_t"]
        [::std::mem::size_of::<std_piecewise_construct_t>() - 1usize];
    ["Alignment of std_piecewise_construct_t"]
        [::std::mem::align_of::<std_piecewise_construct_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__1L19piecewise_constructE"]
    pub static std_piecewise_construct: std_piecewise_construct_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___non_trivially_copyable_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair<_T1, _T2> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T2>>,
    pub first: _T1,
    pub second: _T2,
}
pub type std_pair_first_type<_T1> = _T1;
pub type std_pair_second_type<_T2> = _T2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair__CheckArgs {
    pub _address: u8,
}
pub type std_pair__CheckArgsDep = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___numeric_type {
    pub _address: u8,
}
pub type std___numeric_type_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std___numeric_type_open0_void_close0"]
        [::std::mem::size_of::<std___numeric_type>() - 1usize];
    ["Align of template specialization: std___numeric_type_open0_void_close0"]
        [::std::mem::align_of::<std___numeric_type>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___promote {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pmr_polymorphic_allocator {
    pub _address: u8,
}
pub type std_string = std_basic_string;
pub type std_wstring = std_basic_string;
pub type std_u16string = std_basic_string;
pub type std_u32string = std_basic_string;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_filebuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ifstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ofstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_fstream {
    pub _address: u8,
}
pub type std_filebuf = std_basic_filebuf;
pub type std_ifstream = std_basic_ifstream;
pub type std_ofstream = std_basic_ofstream;
pub type std_fstream = std_basic_fstream;
pub type std_wfilebuf = std_basic_filebuf;
pub type std_wifstream = std_basic_ifstream;
pub type std_wofstream = std_basic_ofstream;
pub type std_wfstream = std_basic_fstream;
pub type std_ios = std_basic_ios;
pub type std_wios = std_basic_ios;
pub type std_streamoff = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_iostream {
    pub _address: u8,
}
pub type std_istream = std_basic_istream;
pub type std_iostream = std_basic_iostream;
pub type std_wistream = std_basic_istream;
pub type std_wiostream = std_basic_iostream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostream {
    pub _address: u8,
}
pub type std_ostream = std_basic_ostream;
pub type std_wostream = std_basic_ostream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_stringbuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_stringstream {
    pub _address: u8,
}
pub type std_stringbuf = std_basic_stringbuf;
pub type std_istringstream = std_basic_istringstream;
pub type std_ostringstream = std_basic_ostringstream;
pub type std_stringstream = std_basic_stringstream;
pub type std_wstringbuf = std_basic_stringbuf;
pub type std_wistringstream = std_basic_istringstream;
pub type std_wostringstream = std_basic_ostringstream;
pub type std_wstringstream = std_basic_stringstream;
pub type std_streambuf = std_basic_streambuf<::std::os::raw::c_char>;
pub type std_wstreambuf = std_basic_streambuf<u32>;
pub type std_streampos = std_fpos<__mbstate_t>;
pub type std_wstreampos = std_fpos<__mbstate_t>;
pub type std_u16streampos = std_fpos<__mbstate_t>;
pub type std_u32streampos = std_fpos<__mbstate_t>;
#[repr(C)]
pub struct std___save_flags<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __stream_: *mut std___save_flags___stream_type,
    pub __fmtflags_: std___save_flags_fmtflags,
    pub __fill_: _CharT,
}
pub type std___save_flags___stream_type = std_basic_ios;
pub type std___save_flags_fmtflags = std___save_flags___stream_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_always_lock_free {
    pub _address: u8,
}
pub const std___legacy_memory_order___mo_relaxed: std___legacy_memory_order = 0;
pub const std___legacy_memory_order___mo_consume: std___legacy_memory_order = 1;
pub const std___legacy_memory_order___mo_acquire: std___legacy_memory_order = 2;
pub const std___legacy_memory_order___mo_release: std___legacy_memory_order = 3;
pub const std___legacy_memory_order___mo_acq_rel: std___legacy_memory_order = 4;
pub const std___legacy_memory_order___mo_seq_cst: std___legacy_memory_order = 5;
pub type std___legacy_memory_order = ::std::os::raw::c_uint;
pub type std___memory_order_underlying_t = type_;
pub const std_memory_order_memory_order_relaxed: std_memory_order = 0;
pub const std_memory_order_memory_order_consume: std_memory_order = 1;
pub const std_memory_order_memory_order_acquire: std_memory_order = 2;
pub const std_memory_order_memory_order_release: std_memory_order = 3;
pub const std_memory_order_memory_order_acq_rel: std_memory_order = 4;
pub const std_memory_order_memory_order_seq_cst: std_memory_order = 5;
pub type std_memory_order = ::std::os::raw::c_uint;
#[repr(C)]
pub struct std___cxx_atomic_base_impl {
    pub __a_value: [u8; 0usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___cxx_atomic_impl<_Base> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Base>>,
    pub _base: _Base,
}
pub type std___cxx_contention_t = ::std::os::raw::c_longlong;
pub type std___cxx_atomic_contention_t = std___cxx_atomic_impl<std___cxx_atomic_base_impl>;
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___static_gcd_value: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___static_lcm_value: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___static_abs_value: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___static_sign_value: ::std::os::raw::c_long;
}
pub const std___ll_mul_nan: ::std::os::raw::c_long = -9223372036854775808;
pub const std___ll_mul_min: ::std::os::raw::c_long = -9223372036854775807;
pub const std___ll_mul_max: ::std::os::raw::c_long = 9223372036854775807;
extern "C" {
    #[link_name = "\u{1}__a_x"]
    pub static std___ll_mul___a_x: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__a_y"]
    pub static std___ll_mul___a_y: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___ll_mul_value: ::std::os::raw::c_long;
}
pub const std___ll_div_nan: ::std::os::raw::c_long = -9223372036854775808;
pub const std___ll_div_min: ::std::os::raw::c_long = -9223372036854775807;
pub const std___ll_div_max: ::std::os::raw::c_long = 9223372036854775807;
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___ll_div_value: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__na"]
    pub static std_ratio___na: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__da"]
    pub static std_ratio___da: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__s"]
    pub static std_ratio___s: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__gcd"]
    pub static std_ratio___gcd: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}num"]
    pub static std_ratio_num: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}den"]
    pub static std_ratio_den: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}num"]
    pub static std_num: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}den"]
    pub static std_den: ::std::os::raw::c_long;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_ratio {
    pub _base: std_false_type,
}
pub type std_atto = u8;
pub type std_femto = u8;
pub type std_pico = u8;
pub type std_nano = u8;
pub type std_micro = u8;
pub type std_milli = u8;
pub type std_centi = u8;
pub type std_deci = u8;
pub type std_deca = u8;
pub type std_hecto = u8;
pub type std_kilo = u8;
pub type std_mega = u8;
pub type std_giga = u8;
pub type std_tera = u8;
pub type std_peta = u8;
pub type std_exa = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_multiply {
    pub _address: u8,
}
pub type std___ratio_multiply_type = u8;
pub type std_ratio_multiply = std___ratio_multiply;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_divide {
    pub _address: u8,
}
pub type std___ratio_divide_type = u8;
pub type std_ratio_divide = std___ratio_divide;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_add {
    pub _address: u8,
}
pub type std___ratio_add_type = std_ratio_multiply;
pub type std_ratio_add = std___ratio_add;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_subtract {
    pub _address: u8,
}
pub type std___ratio_subtract_type = std_ratio_multiply;
pub type std_ratio_subtract = std___ratio_subtract;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_not_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_less_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_greater {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_greater_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_gcd {
    pub _address: u8,
}
pub type std___ratio_gcd_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono___is_duration {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_treat_as_floating_point {
    pub _base: std_is_floating_point,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration_values {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration<_Rep> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Rep>>,
    pub __rep_: std_chrono_duration_rep<_Rep>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration___no_overflow {
    pub _address: u8,
}
pub type std_chrono_duration___no_overflow_type = u8;
pub type std_chrono_duration_rep<_Rep> = _Rep;
pub type std_chrono_duration_period = [u8; 0usize];
pub type std_chrono_nanoseconds = std_chrono_duration<::std::os::raw::c_longlong>;
pub type std_chrono_microseconds = std_chrono_duration<::std::os::raw::c_longlong>;
pub type std_chrono_milliseconds = std_chrono_duration<::std::os::raw::c_longlong>;
pub type std_chrono_seconds = std_chrono_duration<::std::os::raw::c_longlong>;
pub type std_chrono_minutes = std_chrono_duration<::std::os::raw::c_long>;
pub type std_chrono_hours = std_chrono_duration<::std::os::raw::c_long>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono___duration_eq {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono___duration_lt {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_time_point<_Duration> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Duration>>,
    pub __d_: std_chrono_time_point_duration<_Duration>,
}
pub type std_chrono_time_point_clock<_Clock> = _Clock;
pub type std_chrono_time_point_duration<_Duration> = _Duration;
pub type std_chrono_time_point_rep = [u8; 0usize];
pub type std_chrono_time_point_period = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_steady_clock {
    pub _address: u8,
}
pub type std_chrono_steady_clock_duration = std_chrono_nanoseconds;
pub type std_chrono_steady_clock_rep = rep;
pub type std_chrono_steady_clock_period = u8;
pub type std_chrono_steady_clock_time_point =
    std_chrono_time_point<std_chrono_steady_clock_duration>;
pub const std_chrono_steady_clock_is_steady: bool = true;
const _: () = {
    ["Size of std_chrono_steady_clock"][::std::mem::size_of::<std_chrono_steady_clock>() - 1usize];
    ["Alignment of std_chrono_steady_clock"]
        [::std::mem::align_of::<std_chrono_steady_clock>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16chrono12steady_clock3nowEv"]
    pub fn std_chrono_steady_clock_now() -> std_chrono_steady_clock_time_point;
}
impl std_chrono_steady_clock {
    #[inline]
    pub unsafe fn now() -> std_chrono_steady_clock_time_point {
        std_chrono_steady_clock_now()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_system_clock {
    pub _address: u8,
}
pub type std_chrono_system_clock_duration = std_chrono_microseconds;
pub type std_chrono_system_clock_rep = rep;
pub type std_chrono_system_clock_period = u8;
pub type std_chrono_system_clock_time_point =
    std_chrono_time_point<std_chrono_duration<::std::os::raw::c_longlong>>;
pub const std_chrono_system_clock_is_steady: bool = false;
const _: () = {
    ["Size of std_chrono_system_clock"][::std::mem::size_of::<std_chrono_system_clock>() - 1usize];
    ["Alignment of std_chrono_system_clock"]
        [::std::mem::align_of::<std_chrono_system_clock>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16chrono12system_clock3nowEv"]
    pub fn std_chrono_system_clock_now() -> std_chrono_system_clock_time_point;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16chrono12system_clock9to_time_tERKNS0_10time_pointIS1_NS0_8durationIxNS_5ratioILl1ELl1000000EEEEEEE"]
    pub fn std_chrono_system_clock_to_time_t(
        __t: *const std_chrono_system_clock_time_point,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16chrono12system_clock11from_time_tEl"]
    pub fn std_chrono_system_clock_from_time_t(
        __t: ::std::os::raw::c_long,
    ) -> std_chrono_system_clock_time_point;
}
impl std_chrono_system_clock {
    #[inline]
    pub unsafe fn now() -> std_chrono_system_clock_time_point {
        std_chrono_system_clock_now()
    }
    #[inline]
    pub unsafe fn to_time_t(
        __t: *const std_chrono_system_clock_time_point,
    ) -> ::std::os::raw::c_long {
        std_chrono_system_clock_to_time_t(__t)
    }
    #[inline]
    pub unsafe fn from_time_t(__t: ::std::os::raw::c_long) -> std_chrono_system_clock_time_point {
        std_chrono_system_clock_from_time_t(__t)
    }
}
pub type std_chrono_high_resolution_clock = std_chrono_steady_clock;
pub const std___libcpp_polling_count: ::std::os::raw::c_int = 64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___spinning_backoff_policy {
    pub _address: u8,
}
const _: () = {
    ["Size of std___spinning_backoff_policy"]
        [::std::mem::size_of::<std___spinning_backoff_policy>() - 1usize];
    ["Alignment of std___spinning_backoff_policy"]
        [::std::mem::align_of::<std___spinning_backoff_policy>() - 1usize];
};
pub type std___libcpp_mutex_t = pthread_mutex_t;
pub type std___libcpp_recursive_mutex_t = pthread_mutex_t;
pub type std___libcpp_condvar_t = pthread_cond_t;
pub type std___libcpp_exec_once_flag = pthread_once_t;
pub type std___libcpp_thread_id = pthread_t;
pub type std___libcpp_thread_t = pthread_t;
pub type std___libcpp_tls_key = pthread_key_t;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_oneEPVKv"]
    pub fn std___cxx_atomic_notify_one(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_allEPVKv"]
    pub fn std___cxx_atomic_notify_all(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__libcpp_atomic_monitorEPVKv"]
    pub fn std___libcpp_atomic_monitor(
        arg1: *const ::std::os::raw::c_void,
    ) -> std___cxx_contention_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__120__libcpp_atomic_waitEPVKvx"]
    pub fn std___libcpp_atomic_wait(
        arg1: *const ::std::os::raw::c_void,
        arg2: std___cxx_contention_t,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_oneEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
    pub fn std___cxx_atomic_notify_one1(arg1: *const std___cxx_atomic_contention_t);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__cxx_atomic_notify_allEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
    pub fn std___cxx_atomic_notify_all1(arg1: *const std___cxx_atomic_contention_t);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__123__libcpp_atomic_monitorEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEE"]
    pub fn std___libcpp_atomic_monitor1(
        arg1: *const std___cxx_atomic_contention_t,
    ) -> std___cxx_contention_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__120__libcpp_atomic_waitEPVKNS_17__cxx_atomic_implIxNS_22__cxx_atomic_base_implIxEEEEx"]
    pub fn std___libcpp_atomic_wait1(
        arg1: *const std___cxx_atomic_contention_t,
        arg2: std___cxx_contention_t,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_atomic_wait_backoff_impl<_Atp, _Fn> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Atp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Fn>>,
    pub __a: *mut _Atp,
    pub __test_fn: _Fn,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___cxx_atomic_wait_test_fn_impl<_Atp, _Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Atp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __a: *mut _Atp,
    pub __val: _Tp,
    pub __order: std_memory_order,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic {
    pub _address: u8,
}
pub type std_atomic___base = u8;
pub type std_atomic_value_type<_Tp> = _Tp;
pub type std_atomic_difference_type<_Tp> = std_atomic_value_type<_Tp>;
pub type std_atomic_bool = std_atomic;
pub type std_atomic_char = std_atomic;
pub type std_atomic_schar = std_atomic;
pub type std_atomic_uchar = std_atomic;
pub type std_atomic_short = std_atomic;
pub type std_atomic_ushort = std_atomic;
pub type std_atomic_int = std_atomic;
pub type std_atomic_uint = std_atomic;
pub type std_atomic_long = std_atomic;
pub type std_atomic_ulong = std_atomic;
pub type std_atomic_llong = std_atomic;
pub type std_atomic_ullong = std_atomic;
pub type std_atomic_char16_t = std_atomic;
pub type std_atomic_char32_t = std_atomic;
pub type std_atomic_wchar_t = std_atomic;
pub type std_atomic_int_least8_t = std_atomic;
pub type std_atomic_uint_least8_t = std_atomic;
pub type std_atomic_int_least16_t = std_atomic;
pub type std_atomic_uint_least16_t = std_atomic;
pub type std_atomic_int_least32_t = std_atomic;
pub type std_atomic_uint_least32_t = std_atomic;
pub type std_atomic_int_least64_t = std_atomic;
pub type std_atomic_uint_least64_t = std_atomic;
pub type std_atomic_int_fast8_t = std_atomic;
pub type std_atomic_uint_fast8_t = std_atomic;
pub type std_atomic_int_fast16_t = std_atomic;
pub type std_atomic_uint_fast16_t = std_atomic;
pub type std_atomic_int_fast32_t = std_atomic;
pub type std_atomic_uint_fast32_t = std_atomic;
pub type std_atomic_int_fast64_t = std_atomic;
pub type std_atomic_uint_fast64_t = std_atomic;
pub type std_atomic_int8_t = std_atomic;
pub type std_atomic_uint8_t = std_atomic;
pub type std_atomic_int16_t = std_atomic;
pub type std_atomic_uint16_t = std_atomic;
pub type std_atomic_int32_t = std_atomic;
pub type std_atomic_uint32_t = std_atomic;
pub type std_atomic_int64_t = std_atomic;
pub type std_atomic_uint64_t = std_atomic;
pub type std_atomic_intptr_t = std_atomic;
pub type std_atomic_uintptr_t = std_atomic;
pub type std_atomic_size_t = std_atomic;
pub type std_atomic_ptrdiff_t = std_atomic;
pub type std_atomic_intmax_t = std_atomic;
pub type std_atomic_uintmax_t = std_atomic;
pub type std___libcpp_signed_lock_free = std___conditional_t;
pub type std___libcpp_unsigned_lock_free = std___conditional_t;
pub type std_atomic_signed_lock_free = std_atomic;
pub type std_atomic_unsigned_lock_free = std_atomic;
#[repr(C)]
pub struct std_atomic_flag {
    pub __a_: std___cxx_atomic_impl<std___cxx_atomic_base_impl>,
}
const _: () = {
    ["Size of std_atomic_flag"][::std::mem::size_of::<std_atomic_flag>() - 1usize];
    ["Alignment of std_atomic_flag"][::std::mem::align_of::<std_atomic_flag>() - 1usize];
    ["Offset of field: std_atomic_flag::__a_"]
        [::std::mem::offset_of!(std_atomic_flag, __a_) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_trivial_equality_predicate {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___equal_to {
    pub _address: u8,
}
const _: () = {
    ["Size of std___equal_to"][::std::mem::size_of::<std___equal_to>() - 1usize];
    ["Alignment of std___equal_to"][::std::mem::align_of::<std___equal_to>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___less {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std___less_open0_void_void_close0"]
        [::std::mem::size_of::<std___less>() - 1usize];
    ["Align of template specialization: std___less_open0_void_void_close0"]
        [::std::mem::align_of::<std___less>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_signed_integer {
    pub _base: std_false_type,
}
const _: () = {
    ["Size of template specialization: std___libcpp_is_signed_integer_open0_signed_char_close0"]
        [::std::mem::size_of::<std___libcpp_is_signed_integer>() - 1usize];
    ["Align of template specialization: std___libcpp_is_signed_integer_open0_signed_char_close0"]
        [::std::mem::align_of::<std___libcpp_is_signed_integer>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_signed_integer_open0_short_close0"]
        [::std::mem::size_of::<std___libcpp_is_signed_integer>() - 1usize];
    ["Align of template specialization: std___libcpp_is_signed_integer_open0_short_close0"]
        [::std::mem::align_of::<std___libcpp_is_signed_integer>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_signed_integer_open0_int_close0"]
        [::std::mem::size_of::<std___libcpp_is_signed_integer>() - 1usize];
    ["Align of template specialization: std___libcpp_is_signed_integer_open0_int_close0"]
        [::std::mem::align_of::<std___libcpp_is_signed_integer>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_signed_integer_open0_long_close0"]
        [::std::mem::size_of::<std___libcpp_is_signed_integer>() - 1usize];
    ["Align of template specialization: std___libcpp_is_signed_integer_open0_long_close0"]
        [::std::mem::align_of::<std___libcpp_is_signed_integer>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_signed_integer_open0_long_long_close0"]
        [::std::mem::size_of::<std___libcpp_is_signed_integer>() - 1usize];
    ["Align of template specialization: std___libcpp_is_signed_integer_open0_long_long_close0"]
        [::std::mem::align_of::<std___libcpp_is_signed_integer>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_signed_integer_open0___int128_close0"]
        [::std::mem::size_of::<std___libcpp_is_signed_integer>() - 1usize];
    ["Align of template specialization: std___libcpp_is_signed_integer_open0___int128_close0"]
        [::std::mem::align_of::<std___libcpp_is_signed_integer>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_unsigned_integer {
    pub _base: std_false_type,
}
const _: () = {
    ["Size of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_char_close0"] [:: std :: mem :: size_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
    ["Align of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_char_close0"] [:: std :: mem :: align_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_short_close0"] [:: std :: mem :: size_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
    ["Align of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_short_close0"] [:: std :: mem :: align_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_int_close0"] [:: std :: mem :: size_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
    ["Align of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_int_close0"] [:: std :: mem :: align_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_long_close0"] [:: std :: mem :: size_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
    ["Align of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_long_close0"] [:: std :: mem :: align_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_long_long_close0"] [:: std :: mem :: size_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
    ["Align of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned_long_long_close0"] [:: std :: mem :: align_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned___int128_close0"] [:: std :: mem :: size_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
    ["Align of template specialization: std___libcpp_is_unsigned_integer_open0_unsigned___int128_close0"] [:: std :: mem :: align_of :: < std___libcpp_is_unsigned_integer > () - 1usize] ;
};
pub type std__IsValidExpansion = u8;
pub type std___test_for_primary_template = std___enable_if_t;
pub type std___is_primary_template = std__IsValidExpansion;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_input_iterator_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std_input_iterator_tag"][::std::mem::size_of::<std_input_iterator_tag>() - 1usize];
    ["Alignment of std_input_iterator_tag"]
        [::std::mem::align_of::<std_input_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_output_iterator_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std_output_iterator_tag"][::std::mem::size_of::<std_output_iterator_tag>() - 1usize];
    ["Alignment of std_output_iterator_tag"]
        [::std::mem::align_of::<std_output_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std_forward_iterator_tag"]
        [::std::mem::size_of::<std_forward_iterator_tag>() - 1usize];
    ["Alignment of std_forward_iterator_tag"]
        [::std::mem::align_of::<std_forward_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bidirectional_iterator_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std_bidirectional_iterator_tag"]
        [::std::mem::size_of::<std_bidirectional_iterator_tag>() - 1usize];
    ["Alignment of std_bidirectional_iterator_tag"]
        [::std::mem::align_of::<std_bidirectional_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_random_access_iterator_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std_random_access_iterator_tag"]
        [::std::mem::size_of::<std_random_access_iterator_tag>() - 1usize];
    ["Alignment of std_random_access_iterator_tag"]
        [::std::mem::align_of::<std_random_access_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_traits_cache {
    pub _address: u8,
}
pub type std___iter_traits_cache_type = std__If;
pub type std__ITER_TRAITS = std___iter_traits_cache;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_concept_concept_test {
    pub _address: u8,
}
pub type std___iter_concept_concept_test__Apply = std__ITER_TRAITS;
const _: () = {
    ["Size of std___iter_concept_concept_test"]
        [::std::mem::size_of::<std___iter_concept_concept_test>() - 1usize];
    ["Alignment of std___iter_concept_concept_test"]
        [::std::mem::align_of::<std___iter_concept_concept_test>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_concept_category_test {
    pub _address: u8,
}
pub type std___iter_concept_category_test__Apply = std__ITER_TRAITS;
const _: () = {
    ["Size of std___iter_concept_category_test"]
        [::std::mem::size_of::<std___iter_concept_category_test>() - 1usize];
    ["Alignment of std___iter_concept_category_test"]
        [::std::mem::align_of::<std___iter_concept_category_test>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_concept_random_fallback {
    pub _address: u8,
}
pub type std___iter_concept_random_fallback__Apply = std___enable_if_t;
const _: () = {
    ["Size of std___iter_concept_random_fallback"]
        [::std::mem::size_of::<std___iter_concept_random_fallback>() - 1usize];
    ["Alignment of std___iter_concept_random_fallback"]
        [::std::mem::align_of::<std___iter_concept_random_fallback>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___test_iter_concept<_Tester> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tester>>,
    pub _base_1: _Tester,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iter_concept_cache {
    pub _address: u8,
}
pub type std___iter_concept_cache_type = std__Or;
pub type std__ITER_CONCEPT = std___iter_concept_cache;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_typedefs {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_category {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_concept {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator_traits {
    pub _address: u8,
}
pub type std_iterator_traits___primary_template = std_iterator_traits;
pub type std___has_input_iterator_category = u8;
pub type std___has_forward_iterator_category = u8;
pub type std___has_bidirectional_iterator_category = u8;
pub type std___has_random_access_iterator_category = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_contiguous_iterator {
    pub _base: std_false_type,
}
pub type std___has_exactly_input_iterator_category = u8;
pub type std___has_exactly_forward_iterator_category = u8;
pub type std___has_exactly_bidirectional_iterator_category = u8;
pub type std___iter_value_type = std_iterator_traits;
pub type std___iter_key_type = std___remove_const_t<std_iterator_traits>;
pub type std___iter_mapped_type = std_iterator_traits;
pub type std___iter_to_alloc_type = std_pair<std_add_const, std_iterator_traits>;
pub type std___iterator_category_type = std_iterator_traits;
pub type std___iterator_pointer_type = std_iterator_traits;
pub type std___iter_diff_t = std_iterator_traits;
pub type std___iter_reference = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_element_type {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_difference_type {
    pub _base: std_false_type,
}
pub type std___pointer_traits_difference_type_type = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_rebind {
    pub _address: u8,
}
pub type std___pointer_traits_rebind_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits {
    pub _address: u8,
}
pub type std_pointer_traits_pointer<_Ptr> = _Ptr;
pub type std_pointer_traits_element_type = u8;
pub type std_pointer_traits_difference_type = u8;
pub type std_pointer_traits_rebind = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits___nat {
    pub _address: u8,
}
pub type std___rebind_pointer_t = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__HasToAddress {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__HasArrow {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__IsFancyPointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___to_address_helper {
    pub _address: u8,
}
pub type std___sfinae_underlying_type_type = std_underlying_type;
pub type std___sfinae_underlying_type___promoted_type = std___sfinae_underlying_type_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__IterOps {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__ClassicAlgPolicy {
    pub _address: u8,
}
const _: () = {
    ["Size of std__ClassicAlgPolicy"][::std::mem::size_of::<std__ClassicAlgPolicy>() - 1usize];
    ["Alignment of std__ClassicAlgPolicy"]
        [::std::mem::align_of::<std__ClassicAlgPolicy>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std__IterOps_open0_std__ClassicAlgPolicy_close0"]
        [::std::mem::size_of::<std__IterOps>() - 1usize];
    ["Align of template specialization: std__IterOps_open0_std__ClassicAlgPolicy_close0"]
        [::std::mem::align_of::<std__IterOps>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_identity {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___identity {
    pub _address: u8,
}
pub type std___identity_is_transparent = ::std::os::raw::c_void;
const _: () = {
    ["Size of std___identity"][::std::mem::size_of::<std___identity>() - 1usize];
    ["Alignment of std___identity"][::std::mem::align_of::<std___identity>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___is_identity_open0_std___identity_close0"]
        [::std::mem::size_of::<std___is_identity>() - 1usize];
    ["Align of template specialization: std___is_identity_open0_std___identity_close0"]
        [::std::mem::align_of::<std___is_identity>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_function {
    pub _address: u8,
}
pub type std_binary_function_first_argument_type<_Arg1> = _Arg1;
pub type std_binary_function_second_argument_type<_Arg2> = _Arg2;
pub type std_binary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___binary_function_keep_layout_base {
    pub _address: u8,
}
pub type std___binary_function_keep_layout_base_first_argument_type<_Arg1> = _Arg1;
pub type std___binary_function_keep_layout_base_second_argument_type<_Arg2> = _Arg2;
pub type std___binary_function_keep_layout_base_result_type<_Result> = _Result;
pub type std___binary_function = std_binary_function;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_negate<_Predicate> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
    pub __pred_: _Predicate,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unary_function {
    pub _address: u8,
}
pub type std_unary_function_argument_type<_Arg> = _Arg;
pub type std_unary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unary_function_keep_layout_base {
    pub _address: u8,
}
pub type std___unary_function_keep_layout_base_argument_type<_Arg> = _Arg;
pub type std___unary_function_keep_layout_base_result_type<_Result> = _Result;
pub type std___unary_function = std_unary_function;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_result_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___derives_from_unary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___derives_from_unary_function___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
pub type std___derives_from_unary_function_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___derives_from_binary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___derives_from_binary_function___two {
    pub __lx: ::std::os::raw::c_char,
    pub __lxx: ::std::os::raw::c_char,
}
pub type std___derives_from_binary_function_type<_Tp> = _Tp;
pub type std___weak_result_type_imp_result_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___weak_result_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_return {
    pub _address: u8,
}
pub type std___invoke_return_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_allocator_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uses_allocator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_arg_t {
    pub _address: u8,
}
const _: () = {
    ["Size of std_allocator_arg_t"][::std::mem::size_of::<std_allocator_arg_t>() - 1usize];
    ["Alignment of std_allocator_arg_t"][::std::mem::align_of::<std_allocator_arg_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__1L13allocator_argE"]
    pub static std_allocator_arg: std_allocator_arg_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc_ctor_imp {
    pub _address: u8,
}
pub type std___uses_alloc_ctor_imp__RawAlloc = std___remove_cvref_t<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc_ctor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___all_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple {
    pub __base_: std_tuple__BaseT,
}
pub type std_tuple__BaseT = std___tuple_impl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__IsThisTuple {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__EnableUTypesCtor {
    pub _base: std__And<_Pred>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__EnableCtorFromUTypesTuple {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__CtorPredicateFromPair {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__EnableCtorFromPair {
    pub _base: std_tuple__CtorPredicateFromPair,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__NothrowConstructibleFromPair {
    pub _base: std_tuple__CtorPredicateFromPair,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__BothImplicitlyConvertible {
    pub _base: std_false_type,
}
const _: () = {
    ["Size of template specialization: std_tuple_open0_close0"]
        [::std::mem::size_of::<std_tuple>() - 1usize];
    ["Align of template specialization: std_tuple_open0_close0"]
        [::std::mem::align_of::<std_tuple>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__113__find_detailL11__not_foundE"]
    pub static std___find_detail___not_found: ::std::os::raw::c_ulong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__113__find_detailL11__ambiguousE"]
    pub static std___find_detail___ambiguous: ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___find_detail___find_exactly_one_checked {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___find_exactly_one_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ignore_t {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std___ignore_t_open0_unsigned_char_close0"]
        [::std::mem::size_of::<std___ignore_t>() - 1usize];
    ["Align of template specialization: std___ignore_t_open0_unsigned_char_close0"]
        [::std::mem::align_of::<std___ignore_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112_GLOBAL__N_16ignoreE"]
    pub static std__bindgen_mod_id_38667_ignore: std___ignore_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_cat_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_cat_return {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std___tuple_cat_return_open0_close0"]
        [::std::mem::size_of::<std___tuple_cat_return>() - 1usize];
    ["Align of template specialization: std___tuple_cat_return_open0_close0"]
        [::std::mem::align_of::<std___tuple_cat_return>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_cat_return_ref_imp {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_cat_return_ref {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_cat {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_bind_expression {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_placeholder {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_1E"]
    pub static std_placeholders__1: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_2E"]
    pub static std_placeholders__2: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_3E"]
    pub static std_placeholders__3: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_4E"]
    pub static std_placeholders__4: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_5E"]
    pub static std_placeholders__5: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_6E"]
    pub static std_placeholders__6: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_7E"]
    pub static std_placeholders__7: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_8E"]
    pub static std_placeholders__8: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders2_9E"]
    pub static std_placeholders__9: u8;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112placeholders3_10E"]
    pub static std_placeholders__10: u8;
}
pub type std___mu_return_invokable_type = std___nat;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___mu_return {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_valid_bind_return {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___bind<_Fp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Fp>>,
    pub __f_: std___bind__Fd<_Fp>,
    pub __bound_args_: std___bind__Td,
}
pub type std___bind__Fd<_Fp> = std___decay_t<_Fp>;
pub type std___bind__Td = std_tuple;
pub type std___bind___indices = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___bind_r<_Fp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Fp>>,
    pub _base: std___bind<_Fp>,
}
pub type std___bind_r_base<_Fp> = std___bind<_Fp>;
pub type std___bind_r__Fd<_Fp> = std___bind_r_base<_Fp>;
pub type std___bind_r__Td<_Fp> = std___bind_r_base<_Fp>;
pub type std___bind_r_result_type<_Rp> = _Rp;
#[repr(C)]
pub struct std_binder1st<_Operation> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation>>,
    pub op: _Operation,
    pub value: [u8; 0usize],
}
#[repr(C)]
pub struct std_binder2nd<_Operation> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation>>,
    pub op: _Operation,
    pub value: [u8; 0usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__PairT {
    pub first: ::std::os::raw::c_ulong,
    pub second: ::std::os::raw::c_ulong,
}
const _: () = {
    ["Size of std__PairT"][::std::mem::size_of::<std__PairT>() - 16usize];
    ["Alignment of std__PairT"][::std::mem::align_of::<std__PairT>() - 8usize];
    ["Offset of field: std__PairT::first"][::std::mem::offset_of!(std__PairT, first) - 0usize];
    ["Offset of field: std__PairT::second"][::std::mem::offset_of!(std__PairT, second) - 8usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_bool__close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_bool__close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_char_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_char_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_signed_char_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_signed_char_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_unsigned_char_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_unsigned_char_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_char16_t_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_char16_t_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_char32_t_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_char32_t_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_short_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_short_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_unsigned_short_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_unsigned_short_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_int_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_int_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_unsigned_int_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_unsigned_int_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_long_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_long_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_unsigned_long_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_unsigned_long_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_long_long_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_long_long_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_unsigned_long_long_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_unsigned_long_long_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0___int128_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0___int128_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_unsigned___int128_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_unsigned___int128_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_float_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_float_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_double_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_double_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_hash_open0_long_double_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_long_double_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_hash {
    pub _address: u8,
}
pub type std___check_hash_requirements = u8;
pub type std___has_enabled_hash = u8;
pub type std___enable_hash_helper<_Type> = _Type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_trivial_plus_operation {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_plus {
    pub _address: u8,
}
pub type std_plus___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_plus_open0_void_close0"]
        [::std::mem::size_of::<std_plus>() - 1usize];
    ["Align of template specialization: std_plus_open0_void_close0"]
        [::std::mem::align_of::<std_plus>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_minus {
    pub _address: u8,
}
pub type std_minus___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_minus_open0_void_close0"]
        [::std::mem::size_of::<std_minus>() - 1usize];
    ["Align of template specialization: std_minus_open0_void_close0"]
        [::std::mem::align_of::<std_minus>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_multiplies {
    pub _address: u8,
}
pub type std_multiplies___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_multiplies_open0_void_close0"]
        [::std::mem::size_of::<std_multiplies>() - 1usize];
    ["Align of template specialization: std_multiplies_open0_void_close0"]
        [::std::mem::align_of::<std_multiplies>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_divides {
    pub _address: u8,
}
pub type std_divides___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_divides_open0_void_close0"]
        [::std::mem::size_of::<std_divides>() - 1usize];
    ["Align of template specialization: std_divides_open0_void_close0"]
        [::std::mem::align_of::<std_divides>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_modulus {
    pub _address: u8,
}
pub type std_modulus___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_modulus_open0_void_close0"]
        [::std::mem::size_of::<std_modulus>() - 1usize];
    ["Align of template specialization: std_modulus_open0_void_close0"]
        [::std::mem::align_of::<std_modulus>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_negate {
    pub _address: u8,
}
pub type std_negate___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_negate_open0_void_close0"]
        [::std::mem::size_of::<std_negate>() - 1usize];
    ["Align of template specialization: std_negate_open0_void_close0"]
        [::std::mem::align_of::<std_negate>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_and {
    pub _address: u8,
}
pub type std_bit_and___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_bit_and_open0_void_close0"]
        [::std::mem::size_of::<std_bit_and>() - 1usize];
    ["Align of template specialization: std_bit_and_open0_void_close0"]
        [::std::mem::align_of::<std_bit_and>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_not {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_bit_not_open0_void_close0"]
        [::std::mem::size_of::<std_bit_not>() - 1usize];
    ["Align of template specialization: std_bit_not_open0_void_close0"]
        [::std::mem::align_of::<std_bit_not>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_or {
    pub _address: u8,
}
pub type std_bit_or___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_bit_or_open0_void_close0"]
        [::std::mem::size_of::<std_bit_or>() - 1usize];
    ["Align of template specialization: std_bit_or_open0_void_close0"]
        [::std::mem::align_of::<std_bit_or>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_xor {
    pub _address: u8,
}
pub type std_bit_xor___result_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_bit_xor_open0_void_close0"]
        [::std::mem::size_of::<std_bit_xor>() - 1usize];
    ["Align of template specialization: std_bit_xor_open0_void_close0"]
        [::std::mem::align_of::<std_bit_xor>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_equal_to {
    pub _address: u8,
}
pub type std_equal_to___result_type = bool;
const _: () = {
    ["Size of template specialization: std_equal_to_open0_void_close0"]
        [::std::mem::size_of::<std_equal_to>() - 1usize];
    ["Align of template specialization: std_equal_to_open0_void_close0"]
        [::std::mem::align_of::<std_equal_to>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_not_equal_to {
    pub _address: u8,
}
pub type std_not_equal_to___result_type = bool;
const _: () = {
    ["Size of template specialization: std_not_equal_to_open0_void_close0"]
        [::std::mem::size_of::<std_not_equal_to>() - 1usize];
    ["Align of template specialization: std_not_equal_to_open0_void_close0"]
        [::std::mem::align_of::<std_not_equal_to>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less {
    pub _address: u8,
}
pub type std_less___result_type = bool;
const _: () = {
    ["Size of template specialization: std_less_open0_void_close0"]
        [::std::mem::size_of::<std_less>() - 1usize];
    ["Align of template specialization: std_less_open0_void_close0"]
        [::std::mem::align_of::<std_less>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less_equal {
    pub _address: u8,
}
pub type std_less_equal___result_type = bool;
const _: () = {
    ["Size of template specialization: std_less_equal_open0_void_close0"]
        [::std::mem::size_of::<std_less_equal>() - 1usize];
    ["Align of template specialization: std_less_equal_open0_void_close0"]
        [::std::mem::align_of::<std_less_equal>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater_equal {
    pub _address: u8,
}
pub type std_greater_equal___result_type = bool;
const _: () = {
    ["Size of template specialization: std_greater_equal_open0_void_close0"]
        [::std::mem::size_of::<std_greater_equal>() - 1usize];
    ["Align of template specialization: std_greater_equal_open0_void_close0"]
        [::std::mem::align_of::<std_greater_equal>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater {
    pub _address: u8,
}
pub type std_greater___result_type = bool;
const _: () = {
    ["Size of template specialization: std_greater_open0_void_close0"]
        [::std::mem::size_of::<std_greater>() - 1usize];
    ["Align of template specialization: std_greater_open0_void_close0"]
        [::std::mem::align_of::<std_greater>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_and {
    pub _address: u8,
}
pub type std_logical_and___result_type = bool;
const _: () = {
    ["Size of template specialization: std_logical_and_open0_void_close0"]
        [::std::mem::size_of::<std_logical_and>() - 1usize];
    ["Align of template specialization: std_logical_and_open0_void_close0"]
        [::std::mem::align_of::<std_logical_and>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_not {
    pub _address: u8,
}
pub type std_logical_not___result_type = bool;
const _: () = {
    ["Size of template specialization: std_logical_not_open0_void_close0"]
        [::std::mem::size_of::<std_logical_not>() - 1usize];
    ["Align of template specialization: std_logical_not_open0_void_close0"]
        [::std::mem::align_of::<std_logical_not>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_or {
    pub _address: u8,
}
pub type std_logical_or___result_type = bool;
const _: () = {
    ["Size of template specialization: std_logical_or_open0_void_close0"]
        [::std::mem::size_of::<std_logical_or>() - 1usize];
    ["Align of template specialization: std_logical_or_open0_void_close0"]
        [::std::mem::align_of::<std_logical_or>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reference_wrapper<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __f_: *mut std_reference_wrapper_type<_Tp>,
}
pub type std_reference_wrapper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_pointer {
    pub _base: std_false_type,
}
pub type std___pointer_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_const_pointer {
    pub _base: std_false_type,
}
pub type std___const_pointer_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_void_pointer {
    pub _base: std_false_type,
}
pub type std___void_pointer_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_const_void_pointer {
    pub _base: std_false_type,
}
pub type std___const_void_pointer_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_size_type {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_alloc_traits_difference_type {
    pub _base: std_false_type,
}
pub type std___alloc_traits_difference_type_type = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_propagate_on_container_copy_assignment {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_propagate_on_container_move_assignment {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_propagate_on_container_swap {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_is_always_equal {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_rebind_other {
    pub _base: std_false_type,
}
pub type std___allocator_traits_rebind_type = [u8; 0usize];
pub type std___allocator_traits_rebind_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_allocate_hint {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_construct_impl {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_construct {
    pub _base: std___has_construct_impl,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_destroy {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_max_size {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_select_on_container_copy_construction {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits {
    pub _address: u8,
}
pub type std_allocator_traits_allocator_type<_Alloc> = _Alloc;
pub type std_allocator_traits_value_type = [u8; 0usize];
pub type std_allocator_traits_pointer = [u8; 0usize];
pub type std_allocator_traits_const_pointer = [u8; 0usize];
pub type std_allocator_traits_void_pointer = [u8; 0usize];
pub type std_allocator_traits_const_void_pointer = [u8; 0usize];
pub type std_allocator_traits_difference_type = [u8; 0usize];
pub type std_allocator_traits_size_type = [u8; 0usize];
pub type std_allocator_traits_propagate_on_container_copy_assignment = u8;
pub type std_allocator_traits_propagate_on_container_move_assignment = u8;
pub type std_allocator_traits_propagate_on_container_swap = u8;
pub type std_allocator_traits_is_always_equal = u8;
pub type std_allocator_traits_rebind_alloc = std___allocator_traits_rebind_t;
pub type std_allocator_traits_rebind_traits = std_allocator_traits;
pub type std___rebind_alloc = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_default_allocator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_move_insertable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_cpp17_copy_insertable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std___allocation_guard<_Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub __alloc_: _Alloc,
    pub __n_: std___allocation_guard__Size,
    pub __ptr_: std___allocation_guard__Pointer,
}
pub type std___allocation_guard__Pointer = std_allocator_traits;
pub type std___allocation_guard__Size = std_allocator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocation_result<_Pointer> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Pointer>>,
    pub ptr: _Pointer,
    pub count: ::std::os::raw::c_ulong,
}
const _: () = {
    ["Size of template specialization: std_allocator_open0_void_close0"]
        [::std::mem::size_of::<std_allocator>() - 1usize];
    ["Align of template specialization: std_allocator_open0_void_close0"]
        [::std::mem::align_of::<std_allocator>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_allocator_open0_const_void_close0"]
        [::std::mem::size_of::<std_allocator>() - 1usize];
    ["Align of template specialization: std_allocator_open0_const_void_close0"]
        [::std::mem::align_of::<std_allocator>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator_size_type = ::std::os::raw::c_ulong;
pub type std_allocator_difference_type = ::std::os::raw::c_long;
pub type std_allocator_value_type<_Tp> = _Tp;
pub type std_allocator_propagate_on_container_move_assignment = std_true_type;
pub type std_allocator_is_always_equal = std_true_type;
pub type std_allocator_pointer<_Tp> = *mut _Tp;
pub type std_allocator_const_pointer<_Tp> = *const _Tp;
pub type std_allocator_reference<_Tp> = *mut _Tp;
pub type std_allocator_const_reference<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_rebind {
    pub _address: u8,
}
pub type std_allocator_rebind_other = std_allocator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocator_destructor<_Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub __alloc_: *mut _Alloc,
    pub __s_: std___allocator_destructor_size_type,
}
pub type std___allocator_destructor___alloc_traits = std_allocator_traits;
pub type std___allocator_destructor_pointer = std___allocator_destructor___alloc_traits;
pub type std___allocator_destructor_size_type = std___allocator_destructor___alloc_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_auto_ptr_ref<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __ptr_: *mut _Tp,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_auto_ptr<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __ptr_: *mut _Tp,
}
pub type std_auto_ptr_element_type<_Tp> = _Tp;
const _: () = {
    ["Size of template specialization: std_auto_ptr_open0_void_close0"]
        [::std::mem::size_of::<std_auto_ptr<::std::os::raw::c_void>>() - 1usize];
    ["Align of template specialization: std_auto_ptr_open0_void_close0"]
        [::std::mem::align_of::<std_auto_ptr<::std::os::raw::c_void>>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___default_init_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___default_init_tag"][::std::mem::size_of::<std___default_init_tag>() - 1usize];
    ["Alignment of std___default_init_tag"]
        [::std::mem::align_of::<std___default_init_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___value_init_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___value_init_tag"][::std::mem::size_of::<std___value_init_tag>() - 1usize];
    ["Alignment of std___value_init_tag"][::std::mem::align_of::<std___value_init_tag>() - 1usize];
};
pub type std___compressed_pair_elem__ParamT<_Tp> = _Tp;
pub type std___compressed_pair_elem_reference<_Tp> = *mut _Tp;
pub type std___compressed_pair_elem_const_reference<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___compressed_pair {
    pub _address: u8,
}
pub type std___compressed_pair__Base1 = u8;
pub type std___compressed_pair__Base2 = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_datasizeof {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_datasizeof__FirstPaddingByte<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __v_: _Tp,
    pub __first_padding_byte_: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_always_bitcastable {
    pub _address: u8,
}
pub type std___is_always_bitcastable__UnqualFrom<_From> = std___remove_cv_t<_From>;
pub type std___is_always_bitcastable__UnqualTo<_To> = std___remove_cv_t<_To>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_equality_comparable {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_trivially_equality_comparable_impl {
    pub _base: std_false_type,
}
pub type std___libcpp_is_trivially_equality_comparable =
    std___libcpp_is_trivially_equality_comparable_impl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_is_trivially_lexicographically_comparable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_less_than_comparable {
    pub _base: std_false_type,
}
pub type std___element_count = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_lower_copy_assignment_to_memmove {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_lower_move_assignment_to_memmove {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___overload<_F1, _F2> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_F1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_F2>>,
    pub _base: _F1,
    pub _base_1: _F2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_rewrap {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___segmented_iterator_traits {
    pub _address: u8,
}
pub type std___is_segmented_iterator = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___debug_less<_Compare> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
    pub __comp_: *mut _Compare,
}
pub type std___comp_ref_type<_Comp> = *mut _Comp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___copy_loop {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___copy_loop__CopySegment<_OutIter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_OutIter>>,
    pub __result_: *mut _OutIter,
}
pub type std___copy_loop__CopySegment__Traits = std___segmented_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___copy_trivial {
    pub _address: u8,
}
const _: () = {
    ["Size of std___copy_trivial"][::std::mem::size_of::<std___copy_trivial>() - 1usize];
    ["Alignment of std___copy_trivial"][::std::mem::align_of::<std___copy_trivial>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___move_loop {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___move_loop__MoveSegment<_OutIter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_OutIter>>,
    pub __result_: *mut _OutIter,
}
pub type std___move_loop__MoveSegment__Traits = std___segmented_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___move_trivial {
    pub _address: u8,
}
const _: () = {
    ["Size of std___move_trivial"][::std::mem::size_of::<std___move_trivial>() - 1usize];
    ["Alignment of std___move_trivial"][::std::mem::align_of::<std___move_trivial>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator {
    pub _address: u8,
}
pub type std_iterator_value_type<_Tp> = _Tp;
pub type std_iterator_difference_type<_Distance> = _Distance;
pub type std_iterator_pointer<_Pointer> = _Pointer;
pub type std_iterator_reference<_Reference> = _Reference;
pub type std_iterator_iterator_category<_Category> = _Category;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reverse_iterator<_Iter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
    pub __t_: _Iter,
    pub current: _Iter,
}
pub type std_reverse_iterator_iterator_type<_Iter> = _Iter;
pub type std_reverse_iterator_iterator_category = std__If;
pub type std_reverse_iterator_pointer = std_iterator_traits;
pub type std_reverse_iterator_value_type = std_iterator_traits;
pub type std_reverse_iterator_difference_type = std_iterator_traits;
pub type std_reverse_iterator_reference = std_iterator_traits;
pub type std___unconstrained_reverse_iterator<_Iter> = std_reverse_iterator<_Iter>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unwrap_reverse_iter_impl {
    pub _address: u8,
}
pub type std___unwrap_reverse_iter_impl__UnwrappedIter = u8;
pub type std___unwrap_reverse_iter_impl__ReverseWrapper = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unreachable_sentinel {
    pub _address: u8,
}
const _: () = {
    ["Size of std___unreachable_sentinel"]
        [::std::mem::size_of::<std___unreachable_sentinel>() - 1usize];
    ["Alignment of std___unreachable_sentinel"]
        [::std::mem::align_of::<std___unreachable_sentinel>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__AllocatorDestroyRangeReverse<_Alloc, _Iter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
    pub __alloc_: *mut _Alloc,
    pub __first_: *mut _Iter,
    pub __last_: *mut _Iter,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocator_has_trivial_copy_construct {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocator_has_trivial_move_construct {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_default_delete {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unique_ptr_deleter_sfinae {
    pub _address: u8,
}
pub type std___unique_ptr_deleter_sfinae___lval_ref_type<_Deleter> = *const _Deleter;
pub type std___unique_ptr_deleter_sfinae___good_rval_ref_type<_Deleter> = *mut _Deleter;
pub type std___unique_ptr_deleter_sfinae___enable_rval_overload = std_true_type;
#[repr(C)]
#[derive(Debug)]
pub struct std_unique_ptr {
    pub __ptr_: std___compressed_pair,
}
pub type std_unique_ptr_element_type<_Tp> = _Tp;
pub type std_unique_ptr_deleter_type<_Dp> = _Dp;
pub type std_unique_ptr_pointer = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_ptr___nat {
    pub __for_bool_: ::std::os::raw::c_int,
}
pub type std_unique_ptr__DeleterSFINAE = std___unique_ptr_deleter_sfinae;
pub type std_unique_ptr__LValRefType = u8;
pub type std_unique_ptr__GoodRValRefType = u8;
pub type std_unique_ptr__BadRValRefType = u8;
pub type std_unique_ptr__EnableIfDeleterDefaultConstructible = u8;
pub type std_unique_ptr__EnableIfDeleterConstructible = u8;
pub type std_unique_ptr__EnableIfMoveConvertible = u8;
pub type std_unique_ptr__EnableIfDeleterConvertible = u8;
pub type std_unique_ptr__EnableIfDeleterAssignable = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unique_if {
    pub _address: u8,
}
pub type std___unique_if___unique_single = std_unique_ptr;
#[repr(C)]
#[derive(Debug)]
pub struct std___libcpp_refstring {
    pub __imp_: *const ::std::os::raw::c_char,
}
const _: () = {
    ["Size of std___libcpp_refstring"][::std::mem::size_of::<std___libcpp_refstring>() - 8usize];
    ["Alignment of std___libcpp_refstring"]
        [::std::mem::align_of::<std___libcpp_refstring>() - 8usize];
    ["Offset of field: std___libcpp_refstring::__imp_"]
        [::std::mem::offset_of!(std___libcpp_refstring, __imp_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121__throw_runtime_errorEPKc"]
    pub fn std___throw_runtime_error(arg1: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_weak_ptr {
    pub _base: std_exception,
}
const _: () = {
    ["Size of std_bad_weak_ptr"][::std::mem::size_of::<std_bad_weak_ptr>() - 8usize];
    ["Alignment of std_bad_weak_ptr"][::std::mem::align_of::<std_bad_weak_ptr>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112bad_weak_ptrD1Ev"]
    pub fn std_bad_weak_ptr_bad_weak_ptr_destructor(this: *mut std_bad_weak_ptr);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__112bad_weak_ptr4whatEv"]
    pub fn std_bad_weak_ptr_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
pub struct std___shared_count__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_count {
    pub vtable_: *const std___shared_count__bindgen_vtable,
    pub __shared_owners_: ::std::os::raw::c_long,
}
const _: () = {
    ["Size of std___shared_count"][::std::mem::size_of::<std___shared_count>() - 16usize];
    ["Alignment of std___shared_count"][::std::mem::align_of::<std___shared_count>() - 8usize];
    ["Offset of field: std___shared_count::__shared_owners_"]
        [::std::mem::offset_of!(std___shared_count, __shared_owners_) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__shared_countD1Ev"]
    pub fn std___shared_count___shared_count_destructor(this: *mut std___shared_count);
}
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_weak_count {
    pub _base: std___shared_count,
    pub __shared_weak_owners_: ::std::os::raw::c_long,
}
const _: () = {
    ["Size of std___shared_weak_count"][::std::mem::size_of::<std___shared_weak_count>() - 24usize];
    ["Alignment of std___shared_weak_count"]
        [::std::mem::align_of::<std___shared_weak_count>() - 8usize];
    ["Offset of field: std___shared_weak_count::__shared_weak_owners_"]
        [::std::mem::offset_of!(std___shared_weak_count, __shared_weak_owners_) - 16usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_count14__release_weakEv"]
    pub fn std___shared_weak_count___release_weak(this: *mut std___shared_weak_count);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_count4lockEv"]
    pub fn std___shared_weak_count_lock(
        this: *mut std___shared_weak_count,
    ) -> *mut std___shared_weak_count;
}
impl std___shared_weak_count {
    #[inline]
    pub unsafe fn __release_weak(&mut self) {
        std___shared_weak_count___release_weak(self)
    }
    #[inline]
    pub unsafe fn lock(&mut self) -> *mut std___shared_weak_count {
        std___shared_weak_count_lock(self)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_countD1Ev"]
    pub fn std___shared_weak_count___shared_weak_count_destructor(
        this: *mut std___shared_weak_count,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"]
    pub fn std___shared_weak_count___get_deleter(
        this: *mut ::std::os::raw::c_void,
        arg1: *const std_type_info,
    ) -> *const ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_ptr_pointer {
    pub _base: std___shared_weak_count,
    pub __data_: std___compressed_pair,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___for_overwrite_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___for_overwrite_tag"][::std::mem::size_of::<std___for_overwrite_tag>() - 1usize];
    ["Alignment of std___for_overwrite_tag"]
        [::std::mem::align_of::<std___for_overwrite_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_ptr_emplace {
    pub _base: std___shared_weak_count,
    pub __storage_: std___shared_ptr_emplace__Storage,
}
pub type std___shared_ptr_emplace__CompressedPair = std___compressed_pair;
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_ptr_emplace__Storage {
    pub __blob_: *mut ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___shared_ptr_dummy_rebind_allocator_type {
    _unused: [u8; 0],
}
const _: () = {
    ["Size of template specialization: std_allocator_open0_std___shared_ptr_dummy_rebind_allocator_type_close0"] [:: std :: mem :: size_of :: < std_allocator > () - 1usize] ;
    ["Align of template specialization: std_allocator_open0_std___shared_ptr_dummy_rebind_allocator_type_close0"] [:: std :: mem :: align_of :: < std_allocator > () - 1usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___compatible_with {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___raw_pointer_compatible_with {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_deletable {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_array_deletable {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___well_formed_deleter {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___shared_ptr_deleter_ctor_reqs {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_shared_ptr<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __ptr_: *mut std_shared_ptr_element_type<_Tp>,
    pub __cntrl_: *mut std___shared_weak_count,
}
pub type std_shared_ptr_element_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_shared_ptr___shared_ptr_default_delete {
    pub _address: u8,
}
pub type std_shared_ptr___shared_ptr_default_allocator_type = std_allocator;
#[repr(C)]
#[derive(Debug)]
pub struct std_weak_ptr<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __ptr_: *mut std_weak_ptr_element_type<_Tp>,
    pub __cntrl_: *mut std___shared_weak_count,
}
pub type std_weak_ptr_element_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_owner_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_enable_shared_from_this<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __weak_this_: std_weak_ptr<_Tp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___sp_mut {
    pub __lx_: *mut ::std::os::raw::c_void,
}
const _: () = {
    ["Size of std___sp_mut"][::std::mem::size_of::<std___sp_mut>() - 8usize];
    ["Alignment of std___sp_mut"][::std::mem::align_of::<std___sp_mut>() - 8usize];
    ["Offset of field: std___sp_mut::__lx_"][::std::mem::offset_of!(std___sp_mut, __lx_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18__sp_mut4lockEv"]
    pub fn std___sp_mut_lock(this: *mut std___sp_mut);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18__sp_mut6unlockEv"]
    pub fn std___sp_mut_unlock(this: *mut std___sp_mut);
}
impl std___sp_mut {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std___sp_mut_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std___sp_mut_unlock(self)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__get_sp_mutEPKv"]
    pub fn std___get_sp_mut(arg1: *const ::std::os::raw::c_void) -> *mut std___sp_mut;
}
pub type std_array___self = u8;
pub type std_array_value_type<_Tp> = _Tp;
pub type std_array_reference<_Tp> = *mut std_array_value_type<_Tp>;
pub type std_array_const_reference<_Tp> = *const std_array_value_type<_Tp>;
pub type std_array_iterator<_Tp> = *mut std_array_value_type<_Tp>;
pub type std_array_const_iterator<_Tp> = *const std_array_value_type<_Tp>;
pub type std_array_pointer<_Tp> = *mut std_array_value_type<_Tp>;
pub type std_array_const_pointer<_Tp> = *const std_array_value_type<_Tp>;
pub type std_array_size_type = ::std::os::raw::c_ulong;
pub type std_array_difference_type = ::std::os::raw::c_long;
pub type std_array_reverse_iterator<_Tp> = std_reverse_iterator<std_array_iterator<_Tp>>;
pub type std_array_const_reverse_iterator<_Tp> =
    std_reverse_iterator<std_array_const_iterator<_Tp>>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___copy_backward_loop {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___copy_backward_trivial {
    pub _address: u8,
}
const _: () = {
    ["Size of std___copy_backward_trivial"]
        [::std::mem::size_of::<std___copy_backward_trivial>() - 1usize];
    ["Alignment of std___copy_backward_trivial"]
        [::std::mem::align_of::<std___copy_backward_trivial>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___move_backward_loop {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___move_backward_trivial {
    pub _address: u8,
}
const _: () = {
    ["Size of std___move_backward_trivial"]
        [::std::mem::size_of::<std___move_backward_trivial>() - 1usize];
    ["Alignment of std___move_backward_trivial"]
        [::std::mem::align_of::<std___move_backward_trivial>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___destruct_n {
    pub __size_: ::std::os::raw::c_ulong,
}
const _: () = {
    ["Size of std___destruct_n"][::std::mem::size_of::<std___destruct_n>() - 8usize];
    ["Alignment of std___destruct_n"][::std::mem::align_of::<std___destruct_n>() - 8usize];
    ["Offset of field: std___destruct_n::__size_"]
        [::std::mem::offset_of!(std___destruct_n, __size_) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___return_temporary_buffer {
    pub _address: u8,
}
const _: () = {
    ["Size of std___return_temporary_buffer"]
        [::std::mem::size_of::<std___return_temporary_buffer>() - 1usize];
    ["Alignment of std___return_temporary_buffer"]
        [::std::mem::align_of::<std___return_temporary_buffer>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invert<_Predicate> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
    pub __p_: _Predicate,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__ConstTimeDistance {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__MinmaxElementLessFunc<_Comp, _Proj> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Comp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Proj>>,
    pub __comp_: *mut _Comp,
    pub __proj_: *mut _Proj,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_simple_comparator {
    pub _base: std_false_type,
}
const _: () = {
    ["Size of template specialization: std___is_simple_comparator_open0_ref___less_close0"]
        [::std::mem::size_of::<std___is_simple_comparator>() - 1usize];
    ["Align of template specialization: std___is_simple_comparator_open0_ref___less_close0"]
        [::std::mem::align_of::<std___is_simple_comparator>() - 1usize];
};
pub type std___use_branchless_sort = u8;
pub type std___is_any_of = std__Or;
pub type std___sort_is_specialized_in_library = std___is_any_of;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__ProjectedPred<_Pred, _Proj> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Pred>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Proj>>,
    pub __pred: *mut _Pred,
    pub __proj: *mut _Proj,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_move_iterator<_Iter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
    pub __current_: _Iter,
}
pub type std_move_iterator_iterator_type<_Iter> = _Iter;
pub type std_move_iterator_iterator_category = std__If;
pub type std_move_iterator_value_type = std_iterator_traits;
pub type std_move_iterator_difference_type = std_iterator_traits;
pub type std_move_iterator_pointer<_Iter> = std_move_iterator_iterator_type<_Iter>;
pub type std_move_iterator___reference = std_iterator_traits;
pub type std_move_iterator_reference = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___stable_sort_switch {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___wrap_iter<_Iter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
    pub __i_: std___wrap_iter_iterator_type<_Iter>,
}
pub type std___wrap_iter_iterator_type<_Iter> = _Iter;
pub type std___wrap_iter_value_type = std_iterator_traits;
pub type std___wrap_iter_difference_type = std_iterator_traits;
pub type std___wrap_iter_pointer = std_iterator_traits;
pub type std___wrap_iter_reference = std_iterator_traits;
pub type std___wrap_iter_iterator_category = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_random_is_valid_inttype {
    pub _base: std_false_type,
}
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_signed_char_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_signed_char_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_short_close0"]
        [::std::mem::size_of::<std___libcpp_random_is_valid_inttype>() - 1usize];
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_short_close0"]
        [::std::mem::align_of::<std___libcpp_random_is_valid_inttype>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_int_close0"]
        [::std::mem::size_of::<std___libcpp_random_is_valid_inttype>() - 1usize];
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_int_close0"]
        [::std::mem::align_of::<std___libcpp_random_is_valid_inttype>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_long_close0"]
        [::std::mem::size_of::<std___libcpp_random_is_valid_inttype>() - 1usize];
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_long_close0"]
        [::std::mem::align_of::<std___libcpp_random_is_valid_inttype>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_long_long_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_long_long_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_char_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_char_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_short_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_short_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_int_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_int_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_long_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_long_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_long_long_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned_long_long_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0___int128_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0___int128_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned___int128_close0"] [:: std :: mem :: size_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
    ["Align of template specialization: std___libcpp_random_is_valid_inttype_open0_unsigned___int128_close0"] [:: std :: mem :: align_of :: < std___libcpp_random_is_valid_inttype > () - 1usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_random_is_valid_urng {
    pub _base: std_false_type,
}
#[repr(C)]
pub struct std___independent_bits_engine<_Engine> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Engine>>,
    pub __e_: *mut _Engine,
    pub __w_: ::std::os::raw::c_ulong,
    pub __w0_: ::std::os::raw::c_ulong,
    pub __n_: ::std::os::raw::c_ulong,
    pub __n0_: ::std::os::raw::c_ulong,
    pub __y0_: std___independent_bits_engine__Working_result_type,
    pub __y1_: std___independent_bits_engine__Working_result_type,
    pub __mask0_: std___independent_bits_engine__Engine_result_type,
    pub __mask1_: std___independent_bits_engine__Engine_result_type,
}
pub type std___independent_bits_engine_result_type<_UIntType> = _UIntType;
pub type std___independent_bits_engine__Engine_result_type = [u8; 0usize];
pub type std___independent_bits_engine__Working_result_type = std___conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uniform_int_distribution<_IntType> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_IntType>>,
    pub __p_: std_uniform_int_distribution_param_type<_IntType>,
}
pub type std_uniform_int_distribution_result_type<_IntType> = _IntType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uniform_int_distribution_param_type<_IntType> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_IntType>>,
    pub __a_: std_uniform_int_distribution_result_type<_IntType>,
    pub __b_: std_uniform_int_distribution_result_type<_IntType>,
}
pub type std_uniform_int_distribution_param_type_distribution_type<_IntType> =
    std_uniform_int_distribution<_IntType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___set_intersection_result<_InIter1, _InIter2, _OutIter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_InIter1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_InIter2>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_OutIter>>,
    pub __in1_: _InIter1,
    pub __in2_: _InIter2,
    pub __out_: _OutIter,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___set_symmetric_difference_result<_InIter1, _InIter2, _OutIter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_InIter1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_InIter2>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_OutIter>>,
    pub __in1_: _InIter1,
    pub __in2_: _InIter2,
    pub __out_: _OutIter,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___set_union_result<_InIter1, _InIter2, _OutIter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_InIter1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_InIter2>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_OutIter>>,
    pub __in1_: _InIter1,
    pub __in2_: _InIter2,
    pub __out_: _OutIter,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___libcpp_debug_randomizer {
    pub __state_: ::std::os::raw::c_ulonglong,
    pub __inc_: ::std::os::raw::c_ulonglong,
}
pub type std___libcpp_debug_randomizer_result_type = ::std::os::raw::c_uint;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__125__libcpp_debug_randomizer4_MinE"]
    pub static std___libcpp_debug_randomizer__Min: std___libcpp_debug_randomizer_result_type;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__125__libcpp_debug_randomizer4_MaxE"]
    pub static std___libcpp_debug_randomizer__Max: std___libcpp_debug_randomizer_result_type;
}
const _: () = {
    ["Size of std___libcpp_debug_randomizer"]
        [::std::mem::size_of::<std___libcpp_debug_randomizer>() - 16usize];
    ["Alignment of std___libcpp_debug_randomizer"]
        [::std::mem::align_of::<std___libcpp_debug_randomizer>() - 8usize];
    ["Offset of field: std___libcpp_debug_randomizer::__state_"]
        [::std::mem::offset_of!(std___libcpp_debug_randomizer, __state_) - 0usize];
    ["Offset of field: std___libcpp_debug_randomizer::__inc_"]
        [::std::mem::offset_of!(std___libcpp_debug_randomizer, __inc_) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18__rs_getEv"]
    pub fn std___rs_get() -> std___rs_default;
}
#[repr(C)]
#[derive(Debug)]
pub struct std___rs_default {
    pub _address: u8,
}
pub type std___rs_default_result_type = ::std::os::raw::c_uint;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__rs_default4__c_E"]
    pub static mut std___rs_default___c_: ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__rs_default4_MinE"]
    pub static std___rs_default__Min: std___rs_default_result_type;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__rs_default4_MaxE"]
    pub static std___rs_default__Max: std___rs_default_result_type;
}
const _: () = {
    ["Size of std___rs_default"][::std::mem::size_of::<std___rs_default>() - 1usize];
    ["Alignment of std___rs_default"][::std::mem::align_of::<std___rs_default>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__rs_defaultC1ERKS0_"]
    pub fn std___rs_default___rs_default(
        this: *mut std___rs_default,
        arg1: *const std___rs_default,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__rs_defaultD1Ev"]
    pub fn std___rs_default___rs_default_destructor(this: *mut std___rs_default);
}
impl std___rs_default {
    #[inline]
    pub unsafe fn new(arg1: *const std___rs_default) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___rs_default___rs_default(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___rs_default___rs_default_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unique_copy_tags___reread_from_input_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___unique_copy_tags___reread_from_input_tag"]
        [::std::mem::size_of::<std___unique_copy_tags___reread_from_input_tag>() - 1usize];
    ["Alignment of std___unique_copy_tags___reread_from_input_tag"]
        [::std::mem::align_of::<std___unique_copy_tags___reread_from_input_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unique_copy_tags___reread_from_output_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___unique_copy_tags___reread_from_output_tag"]
        [::std::mem::size_of::<std___unique_copy_tags___reread_from_output_tag>() - 1usize];
    ["Alignment of std___unique_copy_tags___reread_from_output_tag"]
        [::std::mem::align_of::<std___unique_copy_tags___reread_from_output_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unique_copy_tags___read_from_tmp_value_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___unique_copy_tags___read_from_tmp_value_tag"]
        [::std::mem::size_of::<std___unique_copy_tags___read_from_tmp_value_tag>() - 1usize];
    ["Alignment of std___unique_copy_tags___read_from_tmp_value_tag"]
        [::std::mem::align_of::<std___unique_copy_tags___read_from_tmp_value_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_back_insert_iterator<_Container> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    pub container: *mut _Container,
}
pub type std_back_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_back_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_back_insert_iterator_difference_type = ::std::os::raw::c_void;
pub type std_back_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_back_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_back_insert_iterator_container_type<_Container> = _Container;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___bounded_iter<_Iterator> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
    pub __current_: _Iterator,
    pub __begin_: _Iterator,
    pub __end_: _Iterator,
}
pub type std___bounded_iter_value_type = std_iterator_traits;
pub type std___bounded_iter_difference_type = std_iterator_traits;
pub type std___bounded_iter_pointer = std_iterator_traits;
pub type std___bounded_iter_reference = std_iterator_traits;
pub type std___bounded_iter_iterator_category = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_front_insert_iterator<_Container> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    pub container: *mut _Container,
}
pub type std_front_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_front_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_front_insert_iterator_difference_type = ::std::os::raw::c_void;
pub type std_front_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_front_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_front_insert_iterator_container_type<_Container> = _Container;
pub type std___insert_iterator_iter_t = [u8; 0usize];
#[repr(C)]
pub struct std_insert_iterator<_Container> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    pub container: *mut _Container,
    pub iter: std___insert_iterator_iter_t,
}
pub type std_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_insert_iterator_difference_type = ::std::os::raw::c_void;
pub type std_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_insert_iterator_container_type<_Container> = _Container;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istream_iterator<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __in_stream_: *mut std_istream_iterator_istream_type,
    pub __value_: _Tp,
}
pub type std_istream_iterator_iterator_category = std_input_iterator_tag;
pub type std_istream_iterator_value_type<_Tp> = _Tp;
pub type std_istream_iterator_difference_type<_Distance> = _Distance;
pub type std_istream_iterator_pointer<_Tp> = *const _Tp;
pub type std_istream_iterator_reference<_Tp> = *const _Tp;
pub type std_istream_iterator_char_type<_CharT> = _CharT;
pub type std_istream_iterator_traits_type<_Traits> = _Traits;
pub type std_istream_iterator_istream_type = std_basic_istream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istreambuf_iterator<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __sbuf_: *mut std_istreambuf_iterator_streambuf_type<_CharT>,
}
pub type std_istreambuf_iterator_iterator_category = std_input_iterator_tag;
pub type std_istreambuf_iterator_value_type<_CharT> = _CharT;
pub type std_istreambuf_iterator_difference_type = [u8; 0usize];
pub type std_istreambuf_iterator_pointer<_CharT> = *mut _CharT;
pub type std_istreambuf_iterator_reference<_CharT> = _CharT;
pub type std_istreambuf_iterator_char_type<_CharT> = _CharT;
pub type std_istreambuf_iterator_traits_type<_Traits> = _Traits;
pub type std_istreambuf_iterator_int_type = [u8; 0usize];
pub type std_istreambuf_iterator_streambuf_type<_CharT> = std_basic_streambuf<_CharT>;
pub type std_istreambuf_iterator_istream_type = std_basic_istream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istreambuf_iterator___proxy<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __keep_: std_istreambuf_iterator_char_type<_CharT>,
    pub __sbuf_: *mut std_istreambuf_iterator_streambuf_type<_CharT>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ostream_iterator<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __out_stream_: *mut std_ostream_iterator_ostream_type,
    pub __delim_: *const std_ostream_iterator_char_type<_CharT>,
}
pub type std_ostream_iterator_iterator_category = std_output_iterator_tag;
pub type std_ostream_iterator_value_type = ::std::os::raw::c_void;
pub type std_ostream_iterator_difference_type = ::std::os::raw::c_void;
pub type std_ostream_iterator_pointer = ::std::os::raw::c_void;
pub type std_ostream_iterator_reference = ::std::os::raw::c_void;
pub type std_ostream_iterator_char_type<_CharT> = _CharT;
pub type std_ostream_iterator_traits_type<_Traits> = _Traits;
pub type std_ostream_iterator_ostream_type = std_basic_ostream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ostreambuf_iterator<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __sbuf_: *mut std_ostreambuf_iterator_streambuf_type<_CharT>,
}
pub type std_ostreambuf_iterator_iterator_category = std_output_iterator_tag;
pub type std_ostreambuf_iterator_value_type = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_difference_type = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_pointer = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_reference = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_char_type<_CharT> = _CharT;
pub type std_ostreambuf_iterator_traits_type<_Traits> = _Traits;
pub type std_ostreambuf_iterator_streambuf_type<_CharT> = std_basic_streambuf<_CharT>;
pub type std_ostreambuf_iterator_ostream_type = std_basic_ostream;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15alignEmmRPvRm"]
    pub fn std_align(
        __align: ::std::os::raw::c_ulong,
        __sz: ::std::os::raw::c_ulong,
        __ptr: *mut *mut ::std::os::raw::c_void,
        __space: *mut ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_raw_storage_iterator<_OutputIterator> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_OutputIterator>>,
    pub __x_: _OutputIterator,
}
pub type std_raw_storage_iterator_iterator_category = std_output_iterator_tag;
pub type std_raw_storage_iterator_value_type = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_difference_type = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_pointer = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_reference = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_transparent {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_hash_value_type_imp {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_hash_value_type {
    pub _base: std_false_type,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__next_primeEm"]
    pub fn std___next_prime(__n: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_node_base {
    pub __next_: std___hash_node_base___next_pointer,
}
pub type std___hash_node_base___node_type = std_pointer_traits;
pub type std___hash_node_base___first_node = std___hash_node_base;
pub type std___hash_node_base___node_base_pointer = std___rebind_pointer_t;
pub type std___hash_node_base___node_pointer<_NodePtr> = _NodePtr;
pub type std___hash_node_base___next_pointer = std___conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_node<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub _base: std___hash_node_base,
    pub __hash_: ::std::os::raw::c_ulong,
    pub __value_: std___hash_node___node_value_type<_Tp>,
}
pub type std___hash_node___node_value_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_key_value_types {
    pub _address: u8,
}
pub type std___hash_key_value_types_key_type<_Tp> = _Tp;
pub type std___hash_key_value_types___node_value_type<_Tp> = _Tp;
pub type std___hash_key_value_types___container_value_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_node_types {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_node_types_from_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_hash_node_types {
    pub _address: u8,
}
pub type std___make_hash_node_types__NodeTp<_NodeValueTp> = std___hash_node<_NodeValueTp>;
pub type std___make_hash_node_types__NodePtr = std___rebind_pointer_t;
pub type std___make_hash_node_types_type = std___hash_node_types;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_iterator {
    pub __node_: std___hash_iterator___next_pointer,
}
pub type std___hash_iterator__NodeTypes = std___hash_node_types;
pub type std___hash_iterator___node_pointer<_NodePtr> = _NodePtr;
pub type std___hash_iterator___next_pointer = std___hash_iterator__NodeTypes;
pub type std___hash_iterator_iterator_category = std_forward_iterator_tag;
pub type std___hash_iterator_value_type = std___hash_iterator__NodeTypes;
pub type std___hash_iterator_difference_type = std___hash_iterator__NodeTypes;
pub type std___hash_iterator_reference = *mut std___hash_iterator_value_type;
pub type std___hash_iterator_pointer = std___hash_iterator__NodeTypes;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_const_iterator {
    pub __node_: std___hash_const_iterator___next_pointer,
}
pub type std___hash_const_iterator__NodeTypes = std___hash_node_types;
pub type std___hash_const_iterator___node_pointer<_NodePtr> = _NodePtr;
pub type std___hash_const_iterator___next_pointer = std___hash_const_iterator__NodeTypes;
pub type std___hash_const_iterator___non_const_iterator = std___hash_iterator;
pub type std___hash_const_iterator_iterator_category = std_forward_iterator_tag;
pub type std___hash_const_iterator_value_type = std___hash_const_iterator__NodeTypes;
pub type std___hash_const_iterator_difference_type = std___hash_const_iterator__NodeTypes;
pub type std___hash_const_iterator_reference = *const std___hash_const_iterator_value_type;
pub type std___hash_const_iterator_pointer = std___hash_const_iterator__NodeTypes;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_local_iterator {
    pub __node_: std___hash_local_iterator___next_pointer,
    pub __bucket_: ::std::os::raw::c_ulong,
    pub __bucket_count_: ::std::os::raw::c_ulong,
}
pub type std___hash_local_iterator__NodeTypes = std___hash_node_types;
pub type std___hash_local_iterator___node_pointer<_NodePtr> = _NodePtr;
pub type std___hash_local_iterator___next_pointer = std___hash_local_iterator__NodeTypes;
pub type std___hash_local_iterator_iterator_category = std_forward_iterator_tag;
pub type std___hash_local_iterator_value_type = std___hash_local_iterator__NodeTypes;
pub type std___hash_local_iterator_difference_type = std___hash_local_iterator__NodeTypes;
pub type std___hash_local_iterator_reference = *mut std___hash_local_iterator_value_type;
pub type std___hash_local_iterator_pointer = std___hash_local_iterator__NodeTypes;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_const_local_iterator {
    pub __node_: std___hash_const_local_iterator___next_pointer,
    pub __bucket_: ::std::os::raw::c_ulong,
    pub __bucket_count_: ::std::os::raw::c_ulong,
}
pub type std___hash_const_local_iterator__NodeTypes = std___hash_node_types;
pub type std___hash_const_local_iterator___node_pointer<_ConstNodePtr> = _ConstNodePtr;
pub type std___hash_const_local_iterator___next_pointer =
    std___hash_const_local_iterator__NodeTypes;
pub type std___hash_const_local_iterator___pointer_traits = std_pointer_traits;
pub type std___hash_const_local_iterator___node = std___hash_const_local_iterator___pointer_traits;
pub type std___hash_const_local_iterator___non_const_node =
    std___remove_const_t<std___hash_const_local_iterator___node>;
pub type std___hash_const_local_iterator___non_const_node_pointer = std___rebind_pointer_t;
pub type std___hash_const_local_iterator___non_const_iterator = std___hash_local_iterator;
pub type std___hash_const_local_iterator_iterator_category = std_forward_iterator_tag;
pub type std___hash_const_local_iterator_value_type = std___hash_const_local_iterator__NodeTypes;
pub type std___hash_const_local_iterator_difference_type =
    std___hash_const_local_iterator__NodeTypes;
pub type std___hash_const_local_iterator_reference =
    *const std___hash_const_local_iterator_value_type;
pub type std___hash_const_local_iterator_pointer = std___hash_const_local_iterator__NodeTypes;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___bucket_list_deallocator {
    pub __data_: std___compressed_pair,
}
pub type std___bucket_list_deallocator_allocator_type<_Alloc> = _Alloc;
pub type std___bucket_list_deallocator___alloc_traits = std_allocator_traits;
pub type std___bucket_list_deallocator_size_type = std___bucket_list_deallocator___alloc_traits;
pub type std___bucket_list_deallocator_pointer = std___bucket_list_deallocator___alloc_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_node_destructor<_Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub __na_: *mut std___hash_node_destructor_allocator_type<_Alloc>,
    pub __value_constructed: bool,
}
pub type std___hash_node_destructor_allocator_type<_Alloc> = _Alloc;
pub type std___hash_node_destructor___alloc_traits = std_allocator_traits;
pub type std___hash_node_destructor_pointer = std___hash_node_destructor___alloc_traits;
pub type std___hash_node_destructor__NodeTypes = std___hash_node_types;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___enforce_unordered_container_requirements {
    pub _address: u8,
}
pub type std___enforce_unordered_container_requirements_type = ::std::os::raw::c_int;
#[repr(C)]
pub struct std___hash_table {
    pub __bucket_list_: std___hash_table___bucket_list,
    pub __p1_: std___compressed_pair,
    pub __p2_: std___compressed_pair,
    pub __p3_: std___compressed_pair,
}
pub type std___hash_table_value_type<_Tp> = _Tp;
pub type std___hash_table_hasher<_Hash> = _Hash;
pub type std___hash_table_key_equal<_Equal> = _Equal;
pub type std___hash_table_allocator_type<_Alloc> = _Alloc;
pub type std___hash_table___alloc_traits = std_allocator_traits;
pub type std___hash_table__NodeTypes = std___make_hash_node_types;
pub type std___hash_table___node_value_type = std___hash_table__NodeTypes;
pub type std___hash_table___container_value_type = std___hash_table__NodeTypes;
pub type std___hash_table_key_type = std___hash_table__NodeTypes;
pub type std___hash_table_reference<_Tp> = *mut std___hash_table_value_type<_Tp>;
pub type std___hash_table_const_reference<_Tp> = *const std___hash_table_value_type<_Tp>;
pub type std___hash_table_pointer = std___hash_table___alloc_traits;
pub type std___hash_table_const_pointer = std___hash_table___alloc_traits;
pub type std___hash_table_size_type = std___hash_table___alloc_traits;
pub type std___hash_table_difference_type = std___hash_table__NodeTypes;
pub type std___hash_table___node = std___hash_table__NodeTypes;
pub type std___hash_table___node_allocator = std___rebind_alloc;
pub type std___hash_table___node_traits = std_allocator_traits;
pub type std___hash_table___void_pointer = std___hash_table__NodeTypes;
pub type std___hash_table___node_pointer = std___hash_table__NodeTypes;
pub type std___hash_table___node_const_pointer = std___hash_table__NodeTypes;
pub type std___hash_table___first_node = std___hash_table__NodeTypes;
pub type std___hash_table___node_base_pointer = std___hash_table__NodeTypes;
pub type std___hash_table___next_pointer = std___hash_table__NodeTypes;
pub type std___hash_table___node_base_allocator = std___rebind_alloc;
pub type std___hash_table___node_base_traits = std_allocator_traits;
pub type std___hash_table___pointer_allocator = std___rebind_alloc;
pub type std___hash_table___bucket_list_deleter = std___bucket_list_deallocator;
pub type std___hash_table___bucket_list = std_unique_ptr;
pub type std___hash_table___pointer_alloc_traits = std_allocator_traits;
pub type std___hash_table___node_pointer_pointer = std___hash_table___bucket_list_deleter;
pub type std___hash_table_iterator = std___hash_iterator;
pub type std___hash_table_const_iterator = std___hash_const_iterator;
pub type std___hash_table_local_iterator = std___hash_local_iterator;
pub type std___hash_table_const_local_iterator = std___hash_const_local_iterator;
pub type std___hash_table__Dp = std___hash_node_destructor<std___hash_table___node_allocator>;
pub type std___hash_table___node_holder = std_unique_ptr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_allocator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_map_node_destructor<_Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub __na_: *mut std___hash_map_node_destructor_allocator_type<_Alloc>,
    pub __first_constructed: bool,
    pub __second_constructed: bool,
}
pub type std___hash_map_node_destructor_allocator_type<_Alloc> = _Alloc;
pub type std___hash_map_node_destructor___alloc_traits = std_allocator_traits;
pub type std___hash_map_node_destructor_pointer = std___hash_map_node_destructor___alloc_traits;
#[repr(C)]
#[derive(Debug)]
pub struct std___hash_value_type<_Key, _Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Key>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __cc_: std___hash_value_type_value_type<_Key, _Tp>,
}
pub type std___hash_value_type_key_type<_Key> = _Key;
pub type std___hash_value_type_mapped_type<_Tp> = _Tp;
pub type std___hash_value_type_value_type<_Key, _Tp> =
    std_pair<std___hash_value_type_key_type<_Key>, std___hash_value_type_mapped_type<_Tp>>;
pub type std___hash_value_type___nc_ref_pair_type<_Key, _Tp> =
    std_pair<std___hash_value_type_key_type<_Key>, std___hash_value_type_mapped_type<_Tp>>;
pub type std___hash_value_type___nc_rref_pair_type<_Key, _Tp> =
    std_pair<std___hash_value_type_key_type<_Key>, std___hash_value_type_mapped_type<_Tp>>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_map_iterator<_HashIterator> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_HashIterator>>,
    pub __i_: _HashIterator,
}
pub type std___hash_map_iterator__NodeTypes = std___hash_node_types_from_iterator;
pub type std___hash_map_iterator_iterator_category = std_forward_iterator_tag;
pub type std___hash_map_iterator_value_type = std___hash_map_iterator__NodeTypes;
pub type std___hash_map_iterator_difference_type = std___hash_map_iterator__NodeTypes;
pub type std___hash_map_iterator_reference = *mut std___hash_map_iterator_value_type;
pub type std___hash_map_iterator_pointer = std___hash_map_iterator__NodeTypes;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_map_const_iterator<_HashIterator> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_HashIterator>>,
    pub __i_: _HashIterator,
}
pub type std___hash_map_const_iterator__NodeTypes = std___hash_node_types_from_iterator;
pub type std___hash_map_const_iterator_iterator_category = std_forward_iterator_tag;
pub type std___hash_map_const_iterator_value_type = std___hash_map_const_iterator__NodeTypes;
pub type std___hash_map_const_iterator_difference_type = std___hash_map_const_iterator__NodeTypes;
pub type std___hash_map_const_iterator_reference = *const std___hash_map_const_iterator_value_type;
pub type std___hash_map_const_iterator_pointer = std___hash_map_const_iterator__NodeTypes;
#[repr(C)]
pub struct std_unordered_map {
    pub __table_: std_unordered_map___table,
}
pub type std_unordered_map_key_type<_Key> = _Key;
pub type std_unordered_map_mapped_type<_Tp> = _Tp;
pub type std_unordered_map_hasher = std___type_identity_t;
pub type std_unordered_map_key_equal = std___type_identity_t;
pub type std_unordered_map_allocator_type = std___type_identity_t;
pub type std_unordered_map_value_type<_Key, _Tp> =
    std_pair<std_unordered_map_key_type<_Key>, std_unordered_map_mapped_type<_Tp>>;
pub type std_unordered_map_reference<_Key, _Tp> = *mut std_unordered_map_value_type<_Key, _Tp>;
pub type std_unordered_map_const_reference<_Key, _Tp> =
    *const std_unordered_map_value_type<_Key, _Tp>;
pub type std_unordered_map___value_type<_Key, _Tp> =
    std___hash_value_type<std_unordered_map_key_type<_Key>, std_unordered_map_mapped_type<_Tp>>;
pub type std_unordered_map___hasher = u8;
pub type std_unordered_map___key_equal = u8;
pub type std_unordered_map___allocator_type = std___rebind_alloc;
pub type std_unordered_map___table = std___hash_table;
pub type std_unordered_map__NodeTypes = std_unordered_map___table;
pub type std_unordered_map___node_pointer = std_unordered_map___table;
pub type std_unordered_map___node_const_pointer = std_unordered_map___table;
pub type std_unordered_map___node_traits = std_unordered_map___table;
pub type std_unordered_map___node_allocator = std_unordered_map___table;
pub type std_unordered_map___node = std_unordered_map___table;
pub type std_unordered_map__Dp = std___hash_map_node_destructor<std_unordered_map___node_allocator>;
pub type std_unordered_map___node_holder = std_unique_ptr;
pub type std_unordered_map___alloc_traits = std_allocator_traits;
pub type std_unordered_map_pointer = std_unordered_map___alloc_traits;
pub type std_unordered_map_const_pointer = std_unordered_map___alloc_traits;
pub type std_unordered_map_size_type = std_unordered_map___table;
pub type std_unordered_map_difference_type = std_unordered_map___table;
pub type std_unordered_map_iterator = std___hash_map_iterator<std_unordered_map___table>;
pub type std_unordered_map_const_iterator =
    std___hash_map_const_iterator<std_unordered_map___table>;
pub type std_unordered_map_local_iterator = std___hash_map_iterator<std_unordered_map___table>;
pub type std_unordered_map_const_local_iterator =
    std___hash_map_const_iterator<std_unordered_map___table>;
#[repr(C)]
pub struct std_unordered_multimap {
    pub __table_: std_unordered_multimap___table,
}
pub type std_unordered_multimap_key_type<_Key> = _Key;
pub type std_unordered_multimap_mapped_type<_Tp> = _Tp;
pub type std_unordered_multimap_hasher = std___type_identity_t;
pub type std_unordered_multimap_key_equal = std___type_identity_t;
pub type std_unordered_multimap_allocator_type = std___type_identity_t;
pub type std_unordered_multimap_value_type<_Key, _Tp> =
    std_pair<std_unordered_multimap_key_type<_Key>, std_unordered_multimap_mapped_type<_Tp>>;
pub type std_unordered_multimap_reference<_Key, _Tp> =
    *mut std_unordered_multimap_value_type<_Key, _Tp>;
pub type std_unordered_multimap_const_reference<_Key, _Tp> =
    *const std_unordered_multimap_value_type<_Key, _Tp>;
pub type std_unordered_multimap___value_type<_Key, _Tp> = std___hash_value_type<
    std_unordered_multimap_key_type<_Key>,
    std_unordered_multimap_mapped_type<_Tp>,
>;
pub type std_unordered_multimap___hasher = u8;
pub type std_unordered_multimap___key_equal = u8;
pub type std_unordered_multimap___allocator_type = std___rebind_alloc;
pub type std_unordered_multimap___table = std___hash_table;
pub type std_unordered_multimap__NodeTypes = std_unordered_multimap___table;
pub type std_unordered_multimap___node_traits = std_unordered_multimap___table;
pub type std_unordered_multimap___node_allocator = std_unordered_multimap___table;
pub type std_unordered_multimap___node = std_unordered_multimap___table;
pub type std_unordered_multimap__Dp =
    std___hash_map_node_destructor<std_unordered_multimap___node_allocator>;
pub type std_unordered_multimap___node_holder = std_unique_ptr;
pub type std_unordered_multimap___alloc_traits = std_allocator_traits;
pub type std_unordered_multimap_pointer = std_unordered_multimap___alloc_traits;
pub type std_unordered_multimap_const_pointer = std_unordered_multimap___alloc_traits;
pub type std_unordered_multimap_size_type = std_unordered_multimap___table;
pub type std_unordered_multimap_difference_type = std_unordered_multimap___table;
pub type std_unordered_multimap_iterator = std___hash_map_iterator<std_unordered_multimap___table>;
pub type std_unordered_multimap_const_iterator =
    std___hash_map_const_iterator<std_unordered_multimap___table>;
pub type std_unordered_multimap_local_iterator =
    std___hash_map_iterator<std_unordered_multimap___table>;
pub type std_unordered_multimap_const_local_iterator =
    std___hash_map_const_iterator<std_unordered_multimap___table>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_storage_type {
    pub _address: u8,
}
pub type std___bit_reference___storage_type = [u8; 0usize];
pub type std___bit_reference___storage_pointer = [u8; 0usize];
pub type std___bit_reference___container = [u8; 0usize];
#[repr(C)]
pub struct std___bit_const_reference {
    pub __seg_: std___bit_const_reference___storage_pointer,
    pub __mask_: std___bit_const_reference___storage_type,
}
pub type std___bit_const_reference___storage_type = [u8; 0usize];
pub type std___bit_const_reference___storage_pointer = [u8; 0usize];
pub type std___bit_const_reference___container = [u8; 0usize];
#[repr(C)]
pub struct std___bit_array {
    pub __size_: std___bit_array_difference_type,
    pub __word_: [std___bit_array___storage_type; 4usize],
}
pub type std___bit_array_difference_type = [u8; 0usize];
pub type std___bit_array___storage_type = [u8; 0usize];
pub type std___bit_array___storage_pointer = [u8; 0usize];
pub type std___bit_array_iterator = [u8; 0usize];
pub type std___bit_iterator_difference_type = [u8; 0usize];
pub type std___bit_iterator_value_type = bool;
pub type std___bit_iterator_pointer = u8;
pub type std___bit_iterator_reference = std___conditional_t;
pub type std___bit_iterator_iterator_category = std_random_access_iterator_tag;
pub type std___bit_iterator___storage_type = [u8; 0usize];
pub type std___bit_iterator___storage_pointer = std___conditional_t;
pub type std_string_view = std_basic_string_view<::std::os::raw::c_char>;
pub type std_u16string_view = std_basic_string_view<u16>;
pub type std_u32string_view = std_basic_string_view<u32>;
pub type std_wstring_view = std_basic_string_view<u32>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
pub type std_char_traits_char_type<_CharT> = _CharT;
pub type std_char_traits_int_type = ::std::os::raw::c_int;
pub type std_char_traits_off_type = std_streamoff;
pub type std_char_traits_pos_type = std_streampos;
pub type std_char_traits_state_type = __mbstate_t;
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_char_traits_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char16_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char16_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char32_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char32_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string_view<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __data_: *const std_basic_string_view_value_type<_CharT>,
    pub __size_: std_basic_string_view_size_type,
}
pub type std_basic_string_view_traits_type<_Traits> = _Traits;
pub type std_basic_string_view_value_type<_CharT> = _CharT;
pub type std_basic_string_view_pointer<_CharT> = *mut _CharT;
pub type std_basic_string_view_const_pointer<_CharT> = *const _CharT;
pub type std_basic_string_view_reference<_CharT> = *mut _CharT;
pub type std_basic_string_view_const_reference<_CharT> = *const _CharT;
pub type std_basic_string_view_const_iterator<_CharT> = std_basic_string_view_const_pointer<_CharT>;
pub type std_basic_string_view_iterator<_CharT> = std_basic_string_view_const_iterator<_CharT>;
pub type std_basic_string_view_const_reverse_iterator<_CharT> =
    std_reverse_iterator<std_basic_string_view_const_iterator<_CharT>>;
pub type std_basic_string_view_reverse_iterator<_CharT> =
    std_basic_string_view_const_reverse_iterator<_CharT>;
pub type std_basic_string_view_size_type = ::std::os::raw::c_ulong;
pub type std_basic_string_view_difference_type = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___string_view_hash {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_hash_open0_std_basic_string_view_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_hash > () - 1usize] ;
    ["Align of template specialization: std_hash_open0_std_basic_string_view_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_hash > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std_hash_open0_std_basic_string_view_open1_char16_t_std_char_traits_open2_char16_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_hash > () - 1usize] ;
    ["Align of template specialization: std_hash_open0_std_basic_string_view_open1_char16_t_std_char_traits_open2_char16_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_hash > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std_hash_open0_std_basic_string_view_open1_char32_t_std_char_traits_open2_char32_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_hash > () - 1usize] ;
    ["Align of template specialization: std_hash_open0_std_basic_string_view_open1_char32_t_std_char_traits_open2_char32_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_hash > () - 1usize] ;
};
const _: () = {
    ["Size of template specialization: std_hash_open0_std_basic_string_view_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_hash > () - 1usize] ;
    ["Align of template specialization: std_hash_open0_std_basic_string_view_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_hash > () - 1usize] ;
};
pub const std_errc_address_family_not_supported: std_errc = 47;
pub const std_errc_address_in_use: std_errc = 48;
pub const std_errc_address_not_available: std_errc = 49;
pub const std_errc_already_connected: std_errc = 56;
pub const std_errc_argument_list_too_long: std_errc = 7;
pub const std_errc_argument_out_of_domain: std_errc = 33;
pub const std_errc_bad_address: std_errc = 14;
pub const std_errc_bad_file_descriptor: std_errc = 9;
pub const std_errc_bad_message: std_errc = 94;
pub const std_errc_broken_pipe: std_errc = 32;
pub const std_errc_connection_aborted: std_errc = 53;
pub const std_errc_connection_already_in_progress: std_errc = 37;
pub const std_errc_connection_refused: std_errc = 61;
pub const std_errc_connection_reset: std_errc = 54;
pub const std_errc_cross_device_link: std_errc = 18;
pub const std_errc_destination_address_required: std_errc = 39;
pub const std_errc_device_or_resource_busy: std_errc = 16;
pub const std_errc_directory_not_empty: std_errc = 66;
pub const std_errc_executable_format_error: std_errc = 8;
pub const std_errc_file_exists: std_errc = 17;
pub const std_errc_file_too_large: std_errc = 27;
pub const std_errc_filename_too_long: std_errc = 63;
pub const std_errc_function_not_supported: std_errc = 78;
pub const std_errc_host_unreachable: std_errc = 65;
pub const std_errc_identifier_removed: std_errc = 90;
pub const std_errc_illegal_byte_sequence: std_errc = 92;
pub const std_errc_inappropriate_io_control_operation: std_errc = 25;
pub const std_errc_interrupted: std_errc = 4;
pub const std_errc_invalid_argument: std_errc = 22;
pub const std_errc_invalid_seek: std_errc = 29;
pub const std_errc_io_error: std_errc = 5;
pub const std_errc_is_a_directory: std_errc = 21;
pub const std_errc_message_size: std_errc = 40;
pub const std_errc_network_down: std_errc = 50;
pub const std_errc_network_reset: std_errc = 52;
pub const std_errc_network_unreachable: std_errc = 51;
pub const std_errc_no_buffer_space: std_errc = 55;
pub const std_errc_no_child_process: std_errc = 10;
pub const std_errc_no_link: std_errc = 97;
pub const std_errc_no_lock_available: std_errc = 77;
pub const std_errc_no_message_available: std_errc = 96;
pub const std_errc_no_message: std_errc = 91;
pub const std_errc_no_protocol_option: std_errc = 42;
pub const std_errc_no_space_on_device: std_errc = 28;
pub const std_errc_no_stream_resources: std_errc = 98;
pub const std_errc_no_such_device_or_address: std_errc = 6;
pub const std_errc_no_such_device: std_errc = 19;
pub const std_errc_no_such_file_or_directory: std_errc = 2;
pub const std_errc_no_such_process: std_errc = 3;
pub const std_errc_not_a_directory: std_errc = 20;
pub const std_errc_not_a_socket: std_errc = 38;
pub const std_errc_not_a_stream: std_errc = 99;
pub const std_errc_not_connected: std_errc = 57;
pub const std_errc_not_enough_memory: std_errc = 12;
pub const std_errc_not_supported: std_errc = 45;
pub const std_errc_operation_canceled: std_errc = 89;
pub const std_errc_operation_in_progress: std_errc = 36;
pub const std_errc_operation_not_permitted: std_errc = 1;
pub const std_errc_operation_not_supported: std_errc = 102;
pub const std_errc_operation_would_block: std_errc = 35;
pub const std_errc_owner_dead: std_errc = 105;
pub const std_errc_permission_denied: std_errc = 13;
pub const std_errc_protocol_error: std_errc = 100;
pub const std_errc_protocol_not_supported: std_errc = 43;
pub const std_errc_read_only_file_system: std_errc = 30;
pub const std_errc_resource_deadlock_would_occur: std_errc = 11;
pub const std_errc_resource_unavailable_try_again: std_errc = 35;
pub const std_errc_result_out_of_range: std_errc = 34;
pub const std_errc_state_not_recoverable: std_errc = 104;
pub const std_errc_stream_timeout: std_errc = 101;
pub const std_errc_text_file_busy: std_errc = 26;
pub const std_errc_timed_out: std_errc = 60;
pub const std_errc_too_many_files_open_in_system: std_errc = 23;
pub const std_errc_too_many_files_open: std_errc = 24;
pub const std_errc_too_many_links: std_errc = 31;
pub const std_errc_too_many_symbolic_link_levels: std_errc = 62;
pub const std_errc_value_too_large: std_errc = 84;
pub const std_errc_wrong_protocol_type: std_errc = 41;
pub type std_errc = ::std::os::raw::c_int;
pub type std___make_32_64_or_128_bit_t = std___copy_unsigned_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fpos<_StateT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_StateT>>,
    pub __st_: _StateT,
    pub __off_: std_streamoff,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___noexcept_move_assign_container {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___string_is_trivial_iterator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_be_converted_to_string_view {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uninitialized_size_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___uninitialized_size_tag"]
        [::std::mem::size_of::<std___uninitialized_size_tag>() - 1usize];
    ["Alignment of std___uninitialized_size_tag"]
        [::std::mem::align_of::<std___uninitialized_size_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___init_with_sentinel_tag {
    pub _address: u8,
}
const _: () = {
    ["Size of std___init_with_sentinel_tag"]
        [::std::mem::size_of::<std___init_with_sentinel_tag>() - 1usize];
    ["Alignment of std___init_with_sentinel_tag"]
        [::std::mem::align_of::<std___init_with_sentinel_tag>() - 1usize];
};
#[repr(C)]
pub struct std_basic_string {
    pub __r_: std___compressed_pair,
}
pub type std_basic_string___self = std_basic_string;
pub type std_basic_string___self_view<_CharT> = std_basic_string_view<_CharT>;
pub type std_basic_string_traits_type<_Traits> = _Traits;
pub type std_basic_string_value_type<_CharT> = _CharT;
pub type std_basic_string_allocator_type<_Allocator> = _Allocator;
pub type std_basic_string___alloc_traits = std_allocator_traits;
pub type std_basic_string_size_type = std_basic_string___alloc_traits;
pub type std_basic_string_difference_type = std_basic_string___alloc_traits;
pub type std_basic_string_reference<_CharT> = *mut std_basic_string_value_type<_CharT>;
pub type std_basic_string_const_reference<_CharT> = *const std_basic_string_value_type<_CharT>;
pub type std_basic_string_pointer = std_basic_string___alloc_traits;
pub type std_basic_string_const_pointer = std_basic_string___alloc_traits;
pub type std_basic_string_iterator = std___wrap_iter<std_basic_string_pointer>;
pub type std_basic_string_const_iterator = std___wrap_iter<std_basic_string_const_pointer>;
pub type std_basic_string_reverse_iterator = std_reverse_iterator<std_basic_string_iterator>;
pub type std_basic_string_const_reverse_iterator =
    std_reverse_iterator<std_basic_string_const_iterator>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___long {
    pub _address: u8,
}
pub const std_basic_string___min_cap: std_basic_string__bindgen_ty_1 = 0;
pub type std_basic_string__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___short<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __data_: *mut std_basic_string_value_type<_CharT>,
    pub __padding_: *mut ::std::os::raw::c_uchar,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
impl<_CharT> std_basic_string___short<_CharT> {
    #[inline]
    pub fn __size_(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set___size_(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn __is_long_(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set___is_long_(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __size_: ::std::os::raw::c_uchar,
        __is_long_: ::std::os::raw::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let __size_: u8 = unsafe { ::std::mem::transmute(__size_) };
            __size_ as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let __is_long_: u8 = unsafe { ::std::mem::transmute(__is_long_) };
            __is_long_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(1))]
pub struct std_basic_string___ulx<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __lx: __BindgenUnionField<u8>,
    pub __lxx: __BindgenUnionField<std_basic_string___short<_CharT>>,
    pub bindgen_union_field: [u8; 0usize],
}
pub const std_basic_string___n_words: std_basic_string__bindgen_ty_2 = 0;
pub type std_basic_string__bindgen_ty_2 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___raw {
    pub __words: *mut std_basic_string_size_type,
}
#[repr(C)]
pub struct std_basic_string___rep<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __bindgen_anon_1: std_basic_string___rep__bindgen_ty_1<_CharT>,
}
#[repr(C)]
#[repr(align(1))]
pub struct std_basic_string___rep__bindgen_ty_1<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub __l: __BindgenUnionField<u8>,
    pub __s: __BindgenUnionField<std_basic_string___short<_CharT>>,
    pub __r: __BindgenUnionField<std_basic_string___raw>,
    pub bindgen_union_field: [u8; 0usize],
}
pub const std_basic_string___alignment: std_basic_string__bindgen_ty_3 = 0;
pub type std_basic_string__bindgen_ty_3 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___traits_eq {
    pub _address: u8,
}
pub type std___traits_eq_char_type = [u8; 0usize];
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stoiERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stoi(
        __str: *const std_string,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stolERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stol(
        __str: *const std_string,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stoulERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stoul(
        __str: *const std_string,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stollERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stoll(
        __str: *const std_string,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16stoullERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPmi"]
    pub fn std_stoull(
        __str: *const std_string,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stofERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
    pub fn std_stof(__str: *const std_string, __idx: *mut ::std::os::raw::c_ulong) -> f32;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stodERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
    pub fn std_stod(__str: *const std_string, __idx: *mut ::std::os::raw::c_ulong) -> f64;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stoldERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPm"]
    pub fn std_stold(__str: *const std_string, __idx: *mut ::std::os::raw::c_ulong) -> f64;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEi"]
    pub fn std_to_string(__val: ::std::os::raw::c_int) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEj"]
    pub fn std_to_string1(__val: ::std::os::raw::c_uint) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEl"]
    pub fn std_to_string2(__val: ::std::os::raw::c_long) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEm"]
    pub fn std_to_string3(__val: ::std::os::raw::c_ulong) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEx"]
    pub fn std_to_string4(__val: ::std::os::raw::c_longlong) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEy"]
    pub fn std_to_string5(__val: ::std::os::raw::c_ulonglong) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEf"]
    pub fn std_to_string6(__val: f32) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEd"]
    pub fn std_to_string7(__val: f64) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__19to_stringEe"]
    pub fn std_to_string8(__val: f64) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stoiERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stoi1(
        __str: *const std_wstring,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stolERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stol1(
        __str: *const std_wstring,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stoulERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stoul1(
        __str: *const std_wstring,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stollERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stoll1(
        __str: *const std_wstring,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16stoullERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPmi"]
    pub fn std_stoull1(
        __str: *const std_wstring,
        __idx: *mut ::std::os::raw::c_ulong,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stofERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
    pub fn std_stof1(__str: *const std_wstring, __idx: *mut ::std::os::raw::c_ulong) -> f32;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__14stodERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
    pub fn std_stod1(__str: *const std_wstring, __idx: *mut ::std::os::raw::c_ulong) -> f64;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15stoldERKNS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEEPm"]
    pub fn std_stold1(__str: *const std_wstring, __idx: *mut ::std::os::raw::c_ulong) -> f64;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEi"]
    pub fn std_to_wstring(__val: ::std::os::raw::c_int) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEj"]
    pub fn std_to_wstring1(__val: ::std::os::raw::c_uint) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEl"]
    pub fn std_to_wstring2(__val: ::std::os::raw::c_long) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEm"]
    pub fn std_to_wstring3(__val: ::std::os::raw::c_ulong) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEx"]
    pub fn std_to_wstring4(__val: ::std::os::raw::c_longlong) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEy"]
    pub fn std_to_wstring5(__val: ::std::os::raw::c_ulonglong) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEf"]
    pub fn std_to_wstring6(__val: f32) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEd"]
    pub fn std_to_wstring7(__val: f64) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110to_wstringEe"]
    pub fn std_to_wstring8(__val: f64) -> std_wstring;
}
extern "C" {
    #[link_name = "\u{1}npos"]
    pub static std_npos: std_basic_string_size_type;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___string_hash {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_mutex {
    pub __m_: std___libcpp_mutex_t,
}
pub type std_mutex_native_handle_type = *mut std___libcpp_mutex_t;
const _: () = {
    ["Size of std_mutex"][::std::mem::size_of::<std_mutex>() - 64usize];
    ["Alignment of std_mutex"][::std::mem::align_of::<std_mutex>() - 8usize];
    ["Offset of field: std_mutex::__m_"][::std::mem::offset_of!(std_mutex, __m_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex4lockEv"]
    pub fn std_mutex_lock(this: *mut std_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex8try_lockEv"]
    pub fn std_mutex_try_lock(this: *mut std_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex6unlockEv"]
    pub fn std_mutex_unlock(this: *mut std_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutexD1Ev"]
    pub fn std_mutex_mutex_destructor(this: *mut std_mutex);
}
impl std_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_mutex_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_defer_lock_t {
    pub _address: u8,
}
const _: () = {
    ["Size of std_defer_lock_t"][::std::mem::size_of::<std_defer_lock_t>() - 1usize];
    ["Alignment of std_defer_lock_t"][::std::mem::align_of::<std_defer_lock_t>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_try_to_lock_t {
    pub _address: u8,
}
const _: () = {
    ["Size of std_try_to_lock_t"][::std::mem::size_of::<std_try_to_lock_t>() - 1usize];
    ["Alignment of std_try_to_lock_t"][::std::mem::align_of::<std_try_to_lock_t>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_adopt_lock_t {
    pub _address: u8,
}
const _: () = {
    ["Size of std_adopt_lock_t"][::std::mem::size_of::<std_adopt_lock_t>() - 1usize];
    ["Alignment of std_adopt_lock_t"][::std::mem::align_of::<std_adopt_lock_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__1L10defer_lockE"]
    pub static std_defer_lock: std_defer_lock_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__1L11try_to_lockE"]
    pub static std_try_to_lock: std_try_to_lock_t;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__1L10adopt_lockE"]
    pub static std_adopt_lock: std_adopt_lock_t;
}
#[repr(C)]
pub struct std_error_category__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_error_category {
    pub vtable_: *const std_error_category__bindgen_vtable,
}
const _: () = {
    ["Size of std_error_category"][::std::mem::size_of::<std_error_category>() - 8usize];
    ["Alignment of std_error_category"][::std::mem::align_of::<std_error_category>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114error_categoryD1Ev"]
    pub fn std_error_category_error_category_destructor(this: *mut std_error_category);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category23default_error_conditionEi"]
    pub fn std_error_category_default_error_condition(
        this: *mut ::std::os::raw::c_void,
        __ev: ::std::os::raw::c_int,
    ) -> std_error_condition;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"]
    pub fn std_error_category_equivalent(
        this: *mut ::std::os::raw::c_void,
        __code: ::std::os::raw::c_int,
        __condition: *const std_error_condition,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"]
    pub fn std_error_category_equivalent1(
        this: *mut ::std::os::raw::c_void,
        __code: *const std_error_code,
        __condition: ::std::os::raw::c_int,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug)]
pub struct std___do_message {
    pub _base: std_error_category,
}
const _: () = {
    ["Size of std___do_message"][::std::mem::size_of::<std___do_message>() - 8usize];
    ["Alignment of std___do_message"][::std::mem::align_of::<std___do_message>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__116generic_categoryEv"]
    pub fn std_generic_category() -> *const std_error_category;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115system_categoryEv"]
    pub fn std_system_category() -> *const std_error_category;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_error_condition_enum {
    pub _base: std_false_type,
}
const _: () = {
    ["Size of template specialization: std_is_error_condition_enum_open0_std_errc_close0"]
        [::std::mem::size_of::<std_is_error_condition_enum>() - 1usize];
    ["Align of template specialization: std_is_error_condition_enum_open0_std_errc_close0"]
        [::std::mem::align_of::<std_is_error_condition_enum>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_error_condition {
    pub __val_: ::std::os::raw::c_int,
    pub __cat_: *const std_error_category,
}
const _: () = {
    ["Size of std_error_condition"][::std::mem::size_of::<std_error_condition>() - 16usize];
    ["Alignment of std_error_condition"][::std::mem::align_of::<std_error_condition>() - 8usize];
    ["Offset of field: std_error_condition::__val_"]
        [::std::mem::offset_of!(std_error_condition, __val_) - 0usize];
    ["Offset of field: std_error_condition::__cat_"]
        [::std::mem::offset_of!(std_error_condition, __cat_) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__115error_condition7messageEv"]
    pub fn std_error_condition_message(this: *const std_error_condition) -> std_string;
}
impl std_error_condition {
    #[inline]
    pub unsafe fn message(&self) -> std_string {
        std_error_condition_message(self)
    }
}
const _: () = {
    ["Size of template specialization: std_hash_open0_std_error_condition_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_std_error_condition_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_error_code_enum {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_error_code {
    pub __val_: ::std::os::raw::c_int,
    pub __cat_: *const std_error_category,
}
const _: () = {
    ["Size of std_error_code"][::std::mem::size_of::<std_error_code>() - 16usize];
    ["Alignment of std_error_code"][::std::mem::align_of::<std_error_code>() - 8usize];
    ["Offset of field: std_error_code::__val_"]
        [::std::mem::offset_of!(std_error_code, __val_) - 0usize];
    ["Offset of field: std_error_code::__cat_"]
        [::std::mem::offset_of!(std_error_code, __cat_) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__110error_code7messageEv"]
    pub fn std_error_code_message(this: *const std_error_code) -> std_string;
}
impl std_error_code {
    #[inline]
    pub unsafe fn message(&self) -> std_string {
        std_error_code_message(self)
    }
}
const _: () = {
    ["Size of template specialization: std_hash_open0_std_error_code_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_std_error_code_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_system_error {
    pub _base: std_runtime_error,
    pub __ec_: std_error_code,
}
const _: () = {
    ["Size of std_system_error"][::std::mem::size_of::<std_system_error>() - 32usize];
    ["Alignment of std_system_error"][::std::mem::align_of::<std_system_error>() - 8usize];
    ["Offset of field: std_system_error::__ec_"]
        [::std::mem::offset_of!(std_system_error, __ec_) - 16usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_system_error_system_error(
        this: *mut std_system_error,
        __ec: std_error_code,
        __what_arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeEPKc"]
    pub fn std_system_error_system_error1(
        this: *mut std_system_error,
        __ec: std_error_code,
        __what_arg: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeE"]
    pub fn std_system_error_system_error2(this: *mut std_system_error, __ec: std_error_code);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_system_error_system_error3(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryEPKc"]
    pub fn std_system_error_system_error4(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryE"]
    pub fn std_system_error_system_error5(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
    );
}
impl std_system_error {
    #[inline]
    pub unsafe fn new(__ec: std_error_code, __what_arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error(__bindgen_tmp.as_mut_ptr(), __ec, __what_arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__ec: std_error_code, __what_arg: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error1(__bindgen_tmp.as_mut_ptr(), __ec, __what_arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(__ec: std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error2(__bindgen_tmp.as_mut_ptr(), __ec);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const std_string,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error3(__bindgen_tmp.as_mut_ptr(), __ev, __ecat, __what_arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const ::std::os::raw::c_char,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error4(__bindgen_tmp.as_mut_ptr(), __ev, __ecat, __what_arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(__ev: ::std::os::raw::c_int, __ecat: *const std_error_category) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_system_error_system_error5(__bindgen_tmp.as_mut_ptr(), __ev, __ecat);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorD1Ev"]
    pub fn std_system_error_system_error_destructor(this: *mut std_system_error);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__120__throw_system_errorEiPKc"]
    pub fn std___throw_system_error(
        __ev: ::std::os::raw::c_int,
        __what_arg: *const ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_unique_lock<_Mutex> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Mutex>>,
    pub __m_: *mut std_unique_lock_mutex_type<_Mutex>,
    pub __owns_: bool,
}
pub type std_unique_lock_mutex_type<_Mutex> = _Mutex;
pub const std_cv_status_no_timeout: std_cv_status = 0;
pub const std_cv_status_timeout: std_cv_status = 1;
pub type std_cv_status = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug)]
pub struct std_condition_variable {
    pub __cv_: std___libcpp_condvar_t,
}
pub type std_condition_variable_native_handle_type = *mut std___libcpp_condvar_t;
const _: () = {
    ["Size of std_condition_variable"][::std::mem::size_of::<std_condition_variable>() - 48usize];
    ["Alignment of std_condition_variable"]
        [::std::mem::align_of::<std_condition_variable>() - 8usize];
    ["Offset of field: std_condition_variable::__cv_"]
        [::std::mem::offset_of!(std_condition_variable, __cv_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_oneEv"]
    pub fn std_condition_variable_notify_one(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_allEv"]
    pub fn std_condition_variable_notify_all(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable4waitERNS_11unique_lockINS_5mutexEEE"]
    pub fn std_condition_variable_wait(
        this: *mut std_condition_variable,
        __lk: *mut std_unique_lock<std_mutex>,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variableD1Ev"]
    pub fn std_condition_variable_condition_variable_destructor(this: *mut std_condition_variable);
}
impl std_condition_variable {
    #[inline]
    pub unsafe fn notify_one(&mut self) {
        std_condition_variable_notify_one(self)
    }
    #[inline]
    pub unsafe fn notify_all(&mut self) {
        std_condition_variable_notify_all(self)
    }
    #[inline]
    pub unsafe fn wait(&mut self, __lk: *mut std_unique_lock<std_mutex>) {
        std_condition_variable_wait(self, __lk)
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_condition_variable_condition_variable_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_lock_guard<_Mutex> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Mutex>>,
    pub __m_: *mut std_lock_guard_mutex_type<_Mutex>,
}
pub type std_lock_guard_mutex_type<_Mutex> = _Mutex;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___thread_id {
    pub __id_: std___libcpp_thread_id,
}
const _: () = {
    ["Size of std___thread_id"][::std::mem::size_of::<std___thread_id>() - 8usize];
    ["Alignment of std___thread_id"][::std::mem::align_of::<std___thread_id>() - 8usize];
    ["Offset of field: std___thread_id::__id_"]
        [::std::mem::offset_of!(std___thread_id, __id_) - 0usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_recursive_mutex {
    pub __m_: std___libcpp_recursive_mutex_t,
}
pub type std_recursive_mutex_native_handle_type = *mut std___libcpp_recursive_mutex_t;
const _: () = {
    ["Size of std_recursive_mutex"][::std::mem::size_of::<std_recursive_mutex>() - 64usize];
    ["Alignment of std_recursive_mutex"][::std::mem::align_of::<std_recursive_mutex>() - 8usize];
    ["Offset of field: std_recursive_mutex::__m_"]
        [::std::mem::offset_of!(std_recursive_mutex, __m_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex4lockEv"]
    pub fn std_recursive_mutex_lock(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex8try_lockEv"]
    pub fn std_recursive_mutex_try_lock(this: *mut std_recursive_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex6unlockEv"]
    pub fn std_recursive_mutex_unlock(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutexC1Ev"]
    pub fn std_recursive_mutex_recursive_mutex(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutexD1Ev"]
    pub fn std_recursive_mutex_recursive_mutex_destructor(this: *mut std_recursive_mutex);
}
impl std_recursive_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_recursive_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_recursive_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_recursive_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_recursive_mutex_recursive_mutex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_recursive_mutex_recursive_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_timed_mutex {
    pub __m_: std_mutex,
    pub __cv_: std_condition_variable,
    pub __locked_: bool,
}
const _: () = {
    ["Size of std_timed_mutex"][::std::mem::size_of::<std_timed_mutex>() - 120usize];
    ["Alignment of std_timed_mutex"][::std::mem::align_of::<std_timed_mutex>() - 8usize];
    ["Offset of field: std_timed_mutex::__m_"]
        [::std::mem::offset_of!(std_timed_mutex, __m_) - 0usize];
    ["Offset of field: std_timed_mutex::__cv_"]
        [::std::mem::offset_of!(std_timed_mutex, __cv_) - 64usize];
    ["Offset of field: std_timed_mutex::__locked_"]
        [::std::mem::offset_of!(std_timed_mutex, __locked_) - 112usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutex4lockEv"]
    pub fn std_timed_mutex_lock(this: *mut std_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutex8try_lockEv"]
    pub fn std_timed_mutex_try_lock(this: *mut std_timed_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutex6unlockEv"]
    pub fn std_timed_mutex_unlock(this: *mut std_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutexC1Ev"]
    pub fn std_timed_mutex_timed_mutex(this: *mut std_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111timed_mutexD1Ev"]
    pub fn std_timed_mutex_timed_mutex_destructor(this: *mut std_timed_mutex);
}
impl std_timed_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_timed_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_timed_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_timed_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_timed_mutex_timed_mutex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_timed_mutex_timed_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_recursive_timed_mutex {
    pub __m_: std_mutex,
    pub __cv_: std_condition_variable,
    pub __count_: ::std::os::raw::c_ulong,
    pub __id_: std___thread_id,
}
const _: () = {
    ["Size of std_recursive_timed_mutex"]
        [::std::mem::size_of::<std_recursive_timed_mutex>() - 128usize];
    ["Alignment of std_recursive_timed_mutex"]
        [::std::mem::align_of::<std_recursive_timed_mutex>() - 8usize];
    ["Offset of field: std_recursive_timed_mutex::__m_"]
        [::std::mem::offset_of!(std_recursive_timed_mutex, __m_) - 0usize];
    ["Offset of field: std_recursive_timed_mutex::__cv_"]
        [::std::mem::offset_of!(std_recursive_timed_mutex, __cv_) - 64usize];
    ["Offset of field: std_recursive_timed_mutex::__count_"]
        [::std::mem::offset_of!(std_recursive_timed_mutex, __count_) - 112usize];
    ["Offset of field: std_recursive_timed_mutex::__id_"]
        [::std::mem::offset_of!(std_recursive_timed_mutex, __id_) - 120usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex4lockEv"]
    pub fn std_recursive_timed_mutex_lock(this: *mut std_recursive_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex8try_lockEv"]
    pub fn std_recursive_timed_mutex_try_lock(this: *mut std_recursive_timed_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutex6unlockEv"]
    pub fn std_recursive_timed_mutex_unlock(this: *mut std_recursive_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutexC1Ev"]
    pub fn std_recursive_timed_mutex_recursive_timed_mutex(this: *mut std_recursive_timed_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__121recursive_timed_mutexD1Ev"]
    pub fn std_recursive_timed_mutex_recursive_timed_mutex_destructor(
        this: *mut std_recursive_timed_mutex,
    );
}
impl std_recursive_timed_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_recursive_timed_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_recursive_timed_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_recursive_timed_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_recursive_timed_mutex_recursive_timed_mutex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_recursive_timed_mutex_recursive_timed_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_once_flag {
    pub __state_: std_once_flag__State_type,
}
pub type std_once_flag__State_type = ::std::os::raw::c_ulong;
const _: () = {
    ["Size of std_once_flag"][::std::mem::size_of::<std_once_flag>() - 8usize];
    ["Alignment of std_once_flag"][::std::mem::align_of::<std_once_flag>() - 8usize];
    ["Offset of field: std_once_flag::__state_"]
        [::std::mem::offset_of!(std_once_flag, __state_) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___call_once_param<_Fp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Fp>>,
    pub __f_: *mut _Fp,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__111__call_onceERVmPvPFvS2_E"]
    pub fn std___call_once(
        arg1: *mut std_once_flag__State_type,
        arg2: *mut ::std::os::raw::c_void,
        arg3: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_locale {
    pub __locale_: *mut std_locale___imp,
}
pub type std_locale_category = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale___imp {
    _unused: [u8; 0],
}
pub const std_locale_none: std_locale_category = 0;
pub const std_locale_collate: std_locale_category = 1;
pub const std_locale_ctype: std_locale_category = 2;
pub const std_locale_monetary: std_locale_category = 8;
pub const std_locale_numeric: std_locale_category = 16;
pub const std_locale_time: std_locale_category = 32;
pub const std_locale_messages: std_locale_category = 4;
pub const std_locale_all: std_locale_category = 63;
const _: () = {
    ["Size of std_locale"][::std::mem::size_of::<std_locale>() - 8usize];
    ["Alignment of std_locale"][::std::mem::align_of::<std_locale>() - 8usize];
    ["Offset of field: std_locale::__locale_"]
        [::std::mem::offset_of!(std_locale, __locale_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__16locale4nameEv"]
    pub fn std_locale_name(this: *const std_locale) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale6globalERKS0_"]
    pub fn std_locale_global(arg1: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale7classicEv"]
    pub fn std_locale_classic() -> *const std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1Ev"]
    pub fn std_locale_locale(this: *mut std_locale);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_"]
    pub fn std_locale_locale1(this: *mut std_locale, arg1: *const std_locale);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1EPKc"]
    pub fn std_locale_locale2(this: *mut std_locale, arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_locale_locale3(this: *mut std_locale, arg1: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_PKci"]
    pub fn std_locale_locale4(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const ::std::os::raw::c_char,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_RKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEi"]
    pub fn std_locale_locale5(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const std_string,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_S2_i"]
    pub fn std_locale_locale6(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const std_locale,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeD1Ev"]
    pub fn std_locale_locale_destructor(this: *mut std_locale);
}
impl std_locale {
    #[inline]
    pub unsafe fn name(&self) -> std_string {
        std_locale_name(self)
    }
    #[inline]
    pub unsafe fn global(arg1: *const std_locale) -> std_locale {
        std_locale_global(arg1)
    }
    #[inline]
    pub unsafe fn classic() -> *const std_locale {
        std_locale_classic()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const std_locale) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(
        arg1: *const std_locale,
        arg2: *const ::std::os::raw::c_char,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale4(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(
        arg1: *const std_locale,
        arg2: *const std_string,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale5(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new6(
        arg1: *const std_locale,
        arg2: *const std_locale,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale6(__bindgen_tmp.as_mut_ptr(), arg1, arg2, arg3);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_locale_locale_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_locale_facet {
    pub _base: std___shared_count,
}
const _: () = {
    ["Size of std_locale_facet"][::std::mem::size_of::<std_locale_facet>() - 16usize];
    ["Alignment of std_locale_facet"][::std::mem::align_of::<std_locale_facet>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale5facetD1Ev"]
    pub fn std_locale_facet_facet_destructor(this: *mut std_locale_facet);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale_id {
    pub __flag_: std_once_flag,
    pub __id_: ::std::os::raw::c_int,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale2id9__next_idE"]
    pub static mut std_locale_id___next_id: ::std::os::raw::c_int;
}
const _: () = {
    ["Size of std_locale_id"][::std::mem::size_of::<std_locale_id>() - 16usize];
    ["Alignment of std_locale_id"][::std::mem::align_of::<std_locale_id>() - 8usize];
    ["Offset of field: std_locale_id::__flag_"]
        [::std::mem::offset_of!(std_locale_id, __flag_) - 0usize];
    ["Offset of field: std_locale_id::__id_"]
        [::std::mem::offset_of!(std_locale_id, __id_) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale2id5__getEv"]
    pub fn std_locale_id___get(this: *mut std_locale_id) -> ::std::os::raw::c_long;
}
impl std_locale_id {
    #[inline]
    pub unsafe fn __get(&mut self) -> ::std::os::raw::c_long {
        std_locale_id___get(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_collate {
    pub _base: std_locale_facet,
}
pub type std_collate_char_type<_CharT> = _CharT;
pub type std_collate_string_type = std_basic_string;
extern "C" {
    #[link_name = "\u{1}id"]
    pub static mut std_id: std_locale_id;
}
const _: () = {
    ["Size of template specialization: std_collate_open0_char_close0"]
        [::std::mem::size_of::<std_collate>() - 16usize];
    ["Align of template specialization: std_collate_open0_char_close0"]
        [::std::mem::align_of::<std_collate>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_collate_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_collate>() - 16usize];
    ["Align of template specialization: std_collate_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_collate>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_collate_byname {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_collate_byname_open0_char_close0"]
        [::std::mem::size_of::<std_collate_byname>() - 24usize];
    ["Align of template specialization: std_collate_byname_open0_char_close0"]
        [::std::mem::align_of::<std_collate_byname>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_collate_byname_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_collate_byname>() - 24usize];
    ["Align of template specialization: std_collate_byname_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_collate_byname>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype_base {
    pub _address: u8,
}
pub type std_ctype_base_mask = __uint32_t;
pub const std_ctype_base_space: std_ctype_base_mask = 16384;
pub const std_ctype_base_print: std_ctype_base_mask = 262144;
pub const std_ctype_base_cntrl: std_ctype_base_mask = 512;
pub const std_ctype_base_upper: std_ctype_base_mask = 32768;
pub const std_ctype_base_lower: std_ctype_base_mask = 4096;
pub const std_ctype_base_alpha: std_ctype_base_mask = 256;
pub const std_ctype_base_digit: std_ctype_base_mask = 1024;
pub const std_ctype_base_punct: std_ctype_base_mask = 8192;
pub const std_ctype_base_xdigit: std_ctype_base_mask = 65536;
pub const std_ctype_base_blank: std_ctype_base_mask = 131072;
pub const std_ctype_base___regex_word: std_ctype_base_mask = 128;
pub const std_ctype_base_alnum: std_ctype_base_mask = 1280;
pub const std_ctype_base_graph: std_ctype_base_mask = 9472;
const _: () = {
    ["Size of std_ctype_base"][::std::mem::size_of::<std_ctype_base>() - 1usize];
    ["Alignment of std_ctype_base"][::std::mem::align_of::<std_ctype_base>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_ctype_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_ctype>() - 16usize];
    ["Align of template specialization: std_ctype_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_ctype>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_ctype_open0_char_close0"]
        [::std::mem::size_of::<std_ctype>() - 32usize];
    ["Align of template specialization: std_ctype_open0_char_close0"]
        [::std::mem::align_of::<std_ctype>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype_byname {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_ctype_byname_open0_char_close0"]
        [::std::mem::size_of::<std_ctype_byname>() - 40usize];
    ["Align of template specialization: std_ctype_byname_open0_char_close0"]
        [::std::mem::align_of::<std_ctype_byname>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_ctype_byname_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_ctype_byname>() - 24usize];
    ["Align of template specialization: std_ctype_byname_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_ctype_byname>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt_base {
    pub _address: u8,
}
pub const std_codecvt_base_result_ok: std_codecvt_base_result = 0;
pub const std_codecvt_base_result_partial: std_codecvt_base_result = 1;
pub const std_codecvt_base_result_error: std_codecvt_base_result = 2;
pub const std_codecvt_base_result_noconv: std_codecvt_base_result = 3;
pub type std_codecvt_base_result = ::std::os::raw::c_uint;
const _: () = {
    ["Size of std_codecvt_base"][::std::mem::size_of::<std_codecvt_base>() - 1usize];
    ["Alignment of std_codecvt_base"][::std::mem::align_of::<std_codecvt_base>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_codecvt_open0_char_char___mbstate_t_close0"]
        [::std::mem::size_of::<std_codecvt>() - 16usize];
    ["Align of template specialization: std_codecvt_open0_char_char___mbstate_t_close0"]
        [::std::mem::align_of::<std_codecvt>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_codecvt_open0_wchar_t_char___mbstate_t_close0"]
        [::std::mem::size_of::<std_codecvt>() - 24usize];
    ["Align of template specialization: std_codecvt_open0_wchar_t_char___mbstate_t_close0"]
        [::std::mem::align_of::<std_codecvt>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_codecvt_open0_char16_t_char___mbstate_t_close0"]
        [::std::mem::size_of::<std_codecvt>() - 16usize];
    ["Align of template specialization: std_codecvt_open0_char16_t_char___mbstate_t_close0"]
        [::std::mem::align_of::<std_codecvt>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_codecvt_open0_char32_t_char___mbstate_t_close0"]
        [::std::mem::size_of::<std_codecvt>() - 16usize];
    ["Align of template specialization: std_codecvt_open0_char32_t_char___mbstate_t_close0"]
        [::std::mem::align_of::<std_codecvt>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_codecvt_byname {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_codecvt_byname_open0_char_char___mbstate_t_close0"]
        [::std::mem::size_of::<std_codecvt_byname>() - 16usize];
    ["Align of template specialization: std_codecvt_byname_open0_char_char___mbstate_t_close0"]
        [::std::mem::align_of::<std_codecvt_byname>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_codecvt_byname_open0_wchar_t_char___mbstate_t_close0"]
        [::std::mem::size_of::<std_codecvt_byname>() - 24usize];
    ["Align of template specialization: std_codecvt_byname_open0_wchar_t_char___mbstate_t_close0"] [:: std :: mem :: align_of :: < std_codecvt_byname > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_codecvt_byname_open0_char16_t_char___mbstate_t_close0"] [:: std :: mem :: size_of :: < std_codecvt_byname > () - 16usize] ;
    ["Align of template specialization: std_codecvt_byname_open0_char16_t_char___mbstate_t_close0"] [:: std :: mem :: align_of :: < std_codecvt_byname > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_codecvt_byname_open0_char32_t_char___mbstate_t_close0"] [:: std :: mem :: size_of :: < std_codecvt_byname > () - 16usize] ;
    ["Align of template specialization: std_codecvt_byname_open0_char32_t_char___mbstate_t_close0"] [:: std :: mem :: align_of :: < std_codecvt_byname > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numpunct {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_numpunct_open0_char_close0"]
        [::std::mem::size_of::<std_numpunct>() - 48usize];
    ["Align of template specialization: std_numpunct_open0_char_close0"]
        [::std::mem::align_of::<std_numpunct>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_numpunct_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_numpunct>() - 48usize];
    ["Align of template specialization: std_numpunct_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_numpunct>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numpunct_byname {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std_numpunct_byname_open0_char_close0"]
        [::std::mem::size_of::<std_numpunct_byname>() - 48usize];
    ["Align of template specialization: std_numpunct_byname_open0_char_close0"]
        [::std::mem::align_of::<std_numpunct_byname>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_numpunct_byname_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_numpunct_byname>() - 48usize];
    ["Align of template specialization: std_numpunct_byname_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_numpunct_byname>() - 8usize];
};
pub type std_streamsize = ::std::os::raw::c_long;
#[repr(C)]
pub struct std_ios_base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base {
    pub vtable_: *const std_ios_base__bindgen_vtable,
    pub __fmtflags_: std_ios_base_fmtflags,
    pub __precision_: std_streamsize,
    pub __width_: std_streamsize,
    pub __rdstate_: std_ios_base_iostate,
    pub __exceptions_: std_ios_base_iostate,
    pub __rdbuf_: *mut ::std::os::raw::c_void,
    pub __loc_: *mut ::std::os::raw::c_void,
    pub __fn_: *mut std_ios_base_event_callback,
    pub __index_: *mut ::std::os::raw::c_int,
    pub __event_size_: ::std::os::raw::c_ulong,
    pub __event_cap_: ::std::os::raw::c_ulong,
    pub __iarray_: *mut ::std::os::raw::c_long,
    pub __iarray_size_: ::std::os::raw::c_ulong,
    pub __iarray_cap_: ::std::os::raw::c_ulong,
    pub __parray_: *mut *mut ::std::os::raw::c_void,
    pub __parray_size_: ::std::os::raw::c_ulong,
    pub __parray_cap_: ::std::os::raw::c_ulong,
}
pub type std_ios_base_fmtflags = ::std::os::raw::c_uint;
pub type std_ios_base_iostate = ::std::os::raw::c_uint;
pub type std_ios_base_openmode = ::std::os::raw::c_uint;
pub const std_ios_base_seekdir_beg: std_ios_base_seekdir = 0;
pub const std_ios_base_seekdir_cur: std_ios_base_seekdir = 1;
pub const std_ios_base_seekdir_end: std_ios_base_seekdir = 2;
pub type std_ios_base_seekdir = ::std::os::raw::c_uint;
pub type std_ios_base_io_state = std_ios_base_iostate;
pub type std_ios_base_open_mode = std_ios_base_openmode;
pub use self::std_ios_base_seekdir as std_ios_base_seek_dir;
pub type std_ios_base_streamoff = std_streamoff;
pub type std_ios_base_streampos = std_streampos;
pub const std_ios_base_event_erase_event: std_ios_base_event = 0;
pub const std_ios_base_event_imbue_event: std_ios_base_event = 1;
pub const std_ios_base_event_copyfmt_event: std_ios_base_event = 2;
pub type std_ios_base_event = ::std::os::raw::c_uint;
pub type std_ios_base_event_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: std_ios_base_event,
        arg2: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ),
>;
pub const std_ios_base_boolalpha: std_ios_base_fmtflags = 1;
pub const std_ios_base_dec: std_ios_base_fmtflags = 2;
pub const std_ios_base_fixed: std_ios_base_fmtflags = 4;
pub const std_ios_base_hex: std_ios_base_fmtflags = 8;
pub const std_ios_base_internal: std_ios_base_fmtflags = 16;
pub const std_ios_base_left: std_ios_base_fmtflags = 32;
pub const std_ios_base_oct: std_ios_base_fmtflags = 64;
pub const std_ios_base_right: std_ios_base_fmtflags = 128;
pub const std_ios_base_scientific: std_ios_base_fmtflags = 256;
pub const std_ios_base_showbase: std_ios_base_fmtflags = 512;
pub const std_ios_base_showpoint: std_ios_base_fmtflags = 1024;
pub const std_ios_base_showpos: std_ios_base_fmtflags = 2048;
pub const std_ios_base_skipws: std_ios_base_fmtflags = 4096;
pub const std_ios_base_unitbuf: std_ios_base_fmtflags = 8192;
pub const std_ios_base_uppercase: std_ios_base_fmtflags = 16384;
pub const std_ios_base_adjustfield: std_ios_base_fmtflags = 176;
pub const std_ios_base_basefield: std_ios_base_fmtflags = 74;
pub const std_ios_base_floatfield: std_ios_base_fmtflags = 260;
pub const std_ios_base_badbit: std_ios_base_iostate = 1;
pub const std_ios_base_eofbit: std_ios_base_iostate = 2;
pub const std_ios_base_failbit: std_ios_base_iostate = 4;
pub const std_ios_base_goodbit: std_ios_base_iostate = 0;
pub const std_ios_base_app: std_ios_base_openmode = 1;
pub const std_ios_base_ate: std_ios_base_openmode = 2;
pub const std_ios_base_binary: std_ios_base_openmode = 4;
pub const std_ios_base_in: std_ios_base_openmode = 8;
pub const std_ios_base_out: std_ios_base_openmode = 16;
pub const std_ios_base_trunc: std_ios_base_openmode = 32;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base9__xindex_E"]
    pub static mut std_ios_base___xindex_: std_atomic;
}
const _: () = {
    ["Size of std_ios_base"][::std::mem::size_of::<std_ios_base>() - 136usize];
    ["Alignment of std_ios_base"][::std::mem::align_of::<std_ios_base>() - 8usize];
    ["Offset of field: std_ios_base::__fmtflags_"]
        [::std::mem::offset_of!(std_ios_base, __fmtflags_) - 8usize];
    ["Offset of field: std_ios_base::__precision_"]
        [::std::mem::offset_of!(std_ios_base, __precision_) - 16usize];
    ["Offset of field: std_ios_base::__width_"]
        [::std::mem::offset_of!(std_ios_base, __width_) - 24usize];
    ["Offset of field: std_ios_base::__rdstate_"]
        [::std::mem::offset_of!(std_ios_base, __rdstate_) - 32usize];
    ["Offset of field: std_ios_base::__exceptions_"]
        [::std::mem::offset_of!(std_ios_base, __exceptions_) - 36usize];
    ["Offset of field: std_ios_base::__rdbuf_"]
        [::std::mem::offset_of!(std_ios_base, __rdbuf_) - 40usize];
    ["Offset of field: std_ios_base::__loc_"]
        [::std::mem::offset_of!(std_ios_base, __loc_) - 48usize];
    ["Offset of field: std_ios_base::__fn_"][::std::mem::offset_of!(std_ios_base, __fn_) - 56usize];
    ["Offset of field: std_ios_base::__index_"]
        [::std::mem::offset_of!(std_ios_base, __index_) - 64usize];
    ["Offset of field: std_ios_base::__event_size_"]
        [::std::mem::offset_of!(std_ios_base, __event_size_) - 72usize];
    ["Offset of field: std_ios_base::__event_cap_"]
        [::std::mem::offset_of!(std_ios_base, __event_cap_) - 80usize];
    ["Offset of field: std_ios_base::__iarray_"]
        [::std::mem::offset_of!(std_ios_base, __iarray_) - 88usize];
    ["Offset of field: std_ios_base::__iarray_size_"]
        [::std::mem::offset_of!(std_ios_base, __iarray_size_) - 96usize];
    ["Offset of field: std_ios_base::__iarray_cap_"]
        [::std::mem::offset_of!(std_ios_base, __iarray_cap_) - 104usize];
    ["Offset of field: std_ios_base::__parray_"]
        [::std::mem::offset_of!(std_ios_base, __parray_) - 112usize];
    ["Offset of field: std_ios_base::__parray_size_"]
        [::std::mem::offset_of!(std_ios_base, __parray_size_) - 120usize];
    ["Offset of field: std_ios_base::__parray_cap_"]
        [::std::mem::offset_of!(std_ios_base, __parray_cap_) - 128usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5imbueERKNS_6localeE"]
    pub fn std_ios_base_imbue(this: *mut std_ios_base, __loc: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__18ios_base6getlocEv"]
    pub fn std_ios_base_getloc(this: *const std_ios_base) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base6xallocEv"]
    pub fn std_ios_base_xalloc() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5iwordEi"]
    pub fn std_ios_base_iword(
        this: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5pwordEi"]
    pub fn std_ios_base_pword(
        this: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi"]
    pub fn std_ios_base_register_callback(
        this: *mut std_ios_base,
        __fn: std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base15sync_with_stdioEb"]
    pub fn std_ios_base_sync_with_stdio(__sync: bool) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5clearEj"]
    pub fn std_ios_base_clear(this: *mut std_ios_base, __state: std_ios_base_iostate);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv"]
    pub fn std_ios_base___set_badbit_and_consider_rethrow(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv"]
    pub fn std_ios_base___set_failbit_and_consider_rethrow(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4initEPv"]
    pub fn std_ios_base_init(this: *mut std_ios_base, __sb: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base16__call_callbacksENS0_5eventE"]
    pub fn std_ios_base___call_callbacks(this: *mut std_ios_base, arg1: std_ios_base_event);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7copyfmtERKS0_"]
    pub fn std_ios_base_copyfmt(this: *mut std_ios_base, arg1: *const std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4moveERS0_"]
    pub fn std_ios_base_move(this: *mut std_ios_base, arg1: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4swapERS0_"]
    pub fn std_ios_base_swap(this: *mut std_ios_base, arg1: *mut std_ios_base);
}
impl std_ios_base {
    #[inline]
    pub unsafe fn imbue(&mut self, __loc: *const std_locale) -> std_locale {
        std_ios_base_imbue(self, __loc)
    }
    #[inline]
    pub unsafe fn getloc(&self) -> std_locale {
        std_ios_base_getloc(self)
    }
    #[inline]
    pub unsafe fn xalloc() -> ::std::os::raw::c_int {
        std_ios_base_xalloc()
    }
    #[inline]
    pub unsafe fn iword(&mut self, __index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_long {
        std_ios_base_iword(self, __index)
    }
    #[inline]
    pub unsafe fn pword(
        &mut self,
        __index: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_void {
        std_ios_base_pword(self, __index)
    }
    #[inline]
    pub unsafe fn register_callback(
        &mut self,
        __fn: std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    ) {
        std_ios_base_register_callback(self, __fn, __index)
    }
    #[inline]
    pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
        std_ios_base_sync_with_stdio(__sync)
    }
    #[inline]
    pub unsafe fn clear(&mut self, __state: std_ios_base_iostate) {
        std_ios_base_clear(self, __state)
    }
    #[inline]
    pub unsafe fn __set_badbit_and_consider_rethrow(&mut self) {
        std_ios_base___set_badbit_and_consider_rethrow(self)
    }
    #[inline]
    pub unsafe fn __set_failbit_and_consider_rethrow(&mut self) {
        std_ios_base___set_failbit_and_consider_rethrow(self)
    }
    #[inline]
    pub unsafe fn init(&mut self, __sb: *mut ::std::os::raw::c_void) {
        std_ios_base_init(self, __sb)
    }
    #[inline]
    pub unsafe fn __call_callbacks(&mut self, arg1: std_ios_base_event) {
        std_ios_base___call_callbacks(self, arg1)
    }
    #[inline]
    pub unsafe fn copyfmt(&mut self, arg1: *const std_ios_base) {
        std_ios_base_copyfmt(self, arg1)
    }
    #[inline]
    pub unsafe fn move_(&mut self, arg1: *mut std_ios_base) {
        std_ios_base_move(self, arg1)
    }
    #[inline]
    pub unsafe fn swap(&mut self, arg1: *mut std_ios_base) {
        std_ios_base_swap(self, arg1)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_baseD1Ev"]
    pub fn std_ios_base_ios_base_destructor(this: *mut std_ios_base);
}
pub const std_io_errc_stream: std_io_errc = 1;
pub type std_io_errc = ::std::os::raw::c_int;
const _: () = {
    ["Size of template specialization: std_is_error_code_enum_open0_std_io_errc_close0"]
        [::std::mem::size_of::<std_is_error_code_enum>() - 1usize];
    ["Align of template specialization: std_is_error_code_enum_open0_std_io_errc_close0"]
        [::std::mem::align_of::<std_is_error_code_enum>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__117iostream_categoryEv"]
    pub fn std_iostream_category() -> *const std_error_category;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_failure {
    pub _base: std_system_error,
}
const _: () = {
    ["Size of std_ios_base_failure"][::std::mem::size_of::<std_ios_base_failure>() - 32usize];
    ["Alignment of std_ios_base_failure"][::std::mem::align_of::<std_ios_base_failure>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEERKNS_10error_codeE"]
    pub fn std_ios_base_failure_failure(
        this: *mut std_ios_base_failure,
        __msg: *const std_string,
        __ec: *const std_error_code,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureC1EPKcRKNS_10error_codeE"]
    pub fn std_ios_base_failure_failure1(
        this: *mut std_ios_base_failure,
        __msg: *const ::std::os::raw::c_char,
        __ec: *const std_error_code,
    );
}
impl std_ios_base_failure {
    #[inline]
    pub unsafe fn new(__msg: *const std_string, __ec: *const std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_failure_failure(__bindgen_tmp.as_mut_ptr(), __msg, __ec);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__msg: *const ::std::os::raw::c_char, __ec: *const std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_failure_failure1(__bindgen_tmp.as_mut_ptr(), __msg, __ec);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureD1Ev"]
    pub fn std_ios_base_failure_failure_destructor(this: *mut std_ios_base_failure);
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_Init {
    pub _address: u8,
}
const _: () = {
    ["Size of std_ios_base_Init"][::std::mem::size_of::<std_ios_base_Init>() - 1usize];
    ["Alignment of std_ios_base_Init"][::std::mem::align_of::<std_ios_base_Init>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4InitC1Ev"]
    pub fn std_ios_base_Init_Init(this: *mut std_ios_base_Init);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4InitD1Ev"]
    pub fn std_ios_base_Init_Init_destructor(this: *mut std_ios_base_Init);
}
impl std_ios_base_Init {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_Init_Init(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_ios_base_Init_Init_destructor(self)
    }
}
#[repr(C)]
pub struct std_basic_ios {
    pub _base: std_ios_base,
    pub __tie_: *mut std_basic_ostream,
    pub __fill_: std_basic_ios_int_type,
}
pub type std_basic_ios_char_type<_CharT> = _CharT;
pub type std_basic_ios_traits_type<_Traits> = _Traits;
pub type std_basic_ios_int_type = [u8; 0usize];
pub type std_basic_ios_pos_type = [u8; 0usize];
pub type std_basic_ios_off_type = [u8; 0usize];
const _: () = {
    ["Size of template specialization: std_basic_ios_open0_char_std_char_traits_open1_char_close1_close0"] [:: std :: mem :: size_of :: < std_basic_ios > () - 152usize] ;
    ["Align of template specialization: std_basic_ios_open0_char_std_char_traits_open1_char_close1_close0"] [:: std :: mem :: align_of :: < std_basic_ios > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_basic_ios_open0_wchar_t_std_char_traits_open1_wchar_t_close1_close0"] [:: std :: mem :: size_of :: < std_basic_ios > () - 152usize] ;
    ["Align of template specialization: std_basic_ios_open0_wchar_t_std_char_traits_open1_wchar_t_close1_close0"] [:: std :: mem :: align_of :: < std_basic_ios > () - 8usize] ;
};
#[repr(C)]
pub struct std_basic_streambuf__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_streambuf<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub vtable_: *const std_basic_streambuf__bindgen_vtable,
    pub __loc_: std_locale,
    pub __binp_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __ninp_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __einp_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __bout_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __nout_: *mut std_basic_streambuf_char_type<_CharT>,
    pub __eout_: *mut std_basic_streambuf_char_type<_CharT>,
}
pub type std_basic_streambuf_char_type<_CharT> = _CharT;
pub type std_basic_streambuf_traits_type<_Traits> = _Traits;
pub type std_basic_streambuf_int_type = [u8; 0usize];
pub type std_basic_streambuf_pos_type = [u8; 0usize];
pub type std_basic_streambuf_off_type = [u8; 0usize];
const _: () = {
    ["Size of template specialization: std_basic_streambuf_open0_char_std_char_traits_open1_char_close1_close0"] [:: std :: mem :: size_of :: < std_basic_streambuf < :: std :: os :: raw :: c_char > > () - 64usize] ;
    ["Align of template specialization: std_basic_streambuf_open0_char_std_char_traits_open1_char_close1_close0"] [:: std :: mem :: align_of :: < std_basic_streambuf < :: std :: os :: raw :: c_char > > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_basic_streambuf_open0_wchar_t_std_char_traits_open1_wchar_t_close1_close0"] [:: std :: mem :: size_of :: < std_basic_streambuf < u32 > > () - 64usize] ;
    ["Align of template specialization: std_basic_streambuf_open0_wchar_t_std_char_traits_open1_wchar_t_close1_close0"] [:: std :: mem :: align_of :: < std_basic_streambuf < u32 > > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___num_get_base {
    pub _address: u8,
}
pub const std___num_get_base___num_get_buf_sz: ::std::os::raw::c_int = 40;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_get_base5__srcE"]
    pub static std___num_get_base___src: [::std::os::raw::c_char; 33usize];
}
const _: () = {
    ["Size of std___num_get_base"][::std::mem::size_of::<std___num_get_base>() - 1usize];
    ["Alignment of std___num_get_base"][::std::mem::align_of::<std___num_get_base>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_get_base10__get_baseERNS_8ios_baseE"]
    pub fn std___num_get_base___get_base(arg1: *mut std_ios_base) -> ::std::os::raw::c_int;
}
impl std___num_get_base {
    #[inline]
    pub unsafe fn __get_base(arg1: *mut std_ios_base) -> ::std::os::raw::c_int {
        std___num_get_base___get_base(arg1)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__116__check_groupingERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEPjS8_Rj"]
    pub fn std___check_grouping(
        __grouping: *const std_string,
        __g: *mut ::std::os::raw::c_uint,
        __g_end: *mut ::std::os::raw::c_uint,
        __err: *mut std_ios_base_iostate,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___num_get {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std___num_get_open0_char_close0"]
        [::std::mem::size_of::<std___num_get>() - 1usize];
    ["Align of template specialization: std___num_get_open0_char_close0"]
        [::std::mem::align_of::<std___num_get>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___num_get_open0_wchar_t_close0"]
        [::std::mem::size_of::<std___num_get>() - 1usize];
    ["Align of template specialization: std___num_get_open0_wchar_t_close0"]
        [::std::mem::align_of::<std___num_get>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_num_get {
    pub _base: std_locale_facet,
}
pub type std_num_get_char_type<_CharT> = _CharT;
pub type std_num_get_iter_type<_InputIterator> = _InputIterator;
const _: () = {
    ["Size of template specialization: std_num_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_num_get > () - 16usize] ;
    ["Align of template specialization: std_num_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_num_get > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_num_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_num_get > () - 16usize] ;
    ["Align of template specialization: std_num_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_num_get > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___num_put_base {
    pub _address: u8,
}
const _: () = {
    ["Size of std___num_put_base"][::std::mem::size_of::<std___num_put_base>() - 1usize];
    ["Alignment of std___num_put_base"][::std::mem::align_of::<std___num_put_base>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_put_base12__format_intEPcPKcbj"]
    pub fn std___num_put_base___format_int(
        __fmt: *mut ::std::os::raw::c_char,
        __len: *const ::std::os::raw::c_char,
        __signd: bool,
        __flags: std_ios_base_fmtflags,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_put_base14__format_floatEPcPKcj"]
    pub fn std___num_put_base___format_float(
        __fmt: *mut ::std::os::raw::c_char,
        __len: *const ::std::os::raw::c_char,
        __flags: std_ios_base_fmtflags,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__num_put_base18__identify_paddingEPcS1_RKNS_8ios_baseE"]
    pub fn std___num_put_base___identify_padding(
        __nb: *mut ::std::os::raw::c_char,
        __ne: *mut ::std::os::raw::c_char,
        __iob: *const std_ios_base,
    ) -> *mut ::std::os::raw::c_char;
}
impl std___num_put_base {
    #[inline]
    pub unsafe fn __format_int(
        __fmt: *mut ::std::os::raw::c_char,
        __len: *const ::std::os::raw::c_char,
        __signd: bool,
        __flags: std_ios_base_fmtflags,
    ) {
        std___num_put_base___format_int(__fmt, __len, __signd, __flags)
    }
    #[inline]
    pub unsafe fn __format_float(
        __fmt: *mut ::std::os::raw::c_char,
        __len: *const ::std::os::raw::c_char,
        __flags: std_ios_base_fmtflags,
    ) -> bool {
        std___num_put_base___format_float(__fmt, __len, __flags)
    }
    #[inline]
    pub unsafe fn __identify_padding(
        __nb: *mut ::std::os::raw::c_char,
        __ne: *mut ::std::os::raw::c_char,
        __iob: *const std_ios_base,
    ) -> *mut ::std::os::raw::c_char {
        std___num_put_base___identify_padding(__nb, __ne, __iob)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___num_put {
    pub _address: u8,
}
const _: () = {
    ["Size of template specialization: std___num_put_open0_char_close0"]
        [::std::mem::size_of::<std___num_put>() - 1usize];
    ["Align of template specialization: std___num_put_open0_char_close0"]
        [::std::mem::align_of::<std___num_put>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___num_put_open0_wchar_t_close0"]
        [::std::mem::size_of::<std___num_put>() - 1usize];
    ["Align of template specialization: std___num_put_open0_wchar_t_close0"]
        [::std::mem::align_of::<std___num_put>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_num_put {
    pub _base: std_locale_facet,
}
pub type std_num_put_char_type<_CharT> = _CharT;
pub type std_num_put_iter_type<_OutputIterator> = _OutputIterator;
const _: () = {
    ["Size of template specialization: std_num_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_num_put > () - 16usize] ;
    ["Align of template specialization: std_num_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_num_put > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_num_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_num_put > () - 16usize] ;
    ["Align of template specialization: std_num_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_num_put > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_base {
    pub _address: u8,
}
pub const std_time_base_dateorder_no_order: std_time_base_dateorder = 0;
pub const std_time_base_dateorder_dmy: std_time_base_dateorder = 1;
pub const std_time_base_dateorder_mdy: std_time_base_dateorder = 2;
pub const std_time_base_dateorder_ymd: std_time_base_dateorder = 3;
pub const std_time_base_dateorder_ydm: std_time_base_dateorder = 4;
pub type std_time_base_dateorder = ::std::os::raw::c_uint;
const _: () = {
    ["Size of std_time_base"][::std::mem::size_of::<std_time_base>() - 1usize];
    ["Alignment of std_time_base"][::std::mem::align_of::<std_time_base>() - 1usize];
};
#[repr(C)]
pub struct std___time_get_c_storage__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std___time_get_c_storage {
    pub vtable_: *const std___time_get_c_storage__bindgen_vtable,
}
pub type std___time_get_c_storage_string_type = std_basic_string;
#[repr(C)]
#[derive(Debug)]
pub struct std_time_get {
    pub _base: std_locale_facet,
    pub _base_2: std___time_get_c_storage,
}
pub type std_time_get_char_type<_CharT> = _CharT;
pub type std_time_get_iter_type<_InputIterator> = _InputIterator;
pub use self::std_time_base_dateorder as std_time_get_dateorder;
pub type std_time_get_string_type = std_basic_string;
const _: () = {
    ["Size of template specialization: std_time_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_time_get > () - 24usize] ;
    ["Align of template specialization: std_time_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_time_get > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_time_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_time_get > () - 24usize] ;
    ["Align of template specialization: std_time_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_time_get > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug)]
pub struct std___time_get {
    pub __loc_: locale_t,
}
const _: () = {
    ["Size of std___time_get"][::std::mem::size_of::<std___time_get>() - 8usize];
    ["Alignment of std___time_get"][::std::mem::align_of::<std___time_get>() - 8usize];
    ["Offset of field: std___time_get::__loc_"]
        [::std::mem::offset_of!(std___time_get, __loc_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_getC1EPKc"]
    pub fn std___time_get___time_get(
        this: *mut std___time_get,
        __nm: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_getC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std___time_get___time_get1(this: *mut std___time_get, __nm: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_getD1Ev"]
    pub fn std___time_get___time_get_destructor(this: *mut std___time_get);
}
impl std___time_get {
    #[inline]
    pub unsafe fn new(__nm: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___time_get___time_get(__bindgen_tmp.as_mut_ptr(), __nm);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__nm: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___time_get___time_get1(__bindgen_tmp.as_mut_ptr(), __nm);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___time_get___time_get_destructor(self)
    }
}
#[repr(C)]
pub struct std___time_get_storage {
    pub _base: std___time_get,
    pub __weeks_: [std___time_get_storage_string_type; 14usize],
    pub __months_: [std___time_get_storage_string_type; 24usize],
    pub __am_pm_: [std___time_get_storage_string_type; 2usize],
    pub __c_: std___time_get_storage_string_type,
    pub __r_: std___time_get_storage_string_type,
    pub __x_: std___time_get_storage_string_type,
    pub __X_: std___time_get_storage_string_type,
}
pub type std___time_get_storage_string_type = std_basic_string;
#[repr(C)]
pub struct std_time_get_byname {
    pub _base: std_time_get,
    pub _base_1: std___time_get_storage,
}
pub use self::std_time_base_dateorder as std_time_get_byname_dateorder;
pub type std_time_get_byname_iter_type<_InputIterator> = _InputIterator;
pub type std_time_get_byname_char_type<_CharT> = _CharT;
pub type std_time_get_byname_string_type = std_basic_string;
const _: () = {
    ["Size of template specialization: std_time_get_byname_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_time_get_byname > () - 1088usize] ;
    ["Align of template specialization: std_time_get_byname_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_time_get_byname > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_time_get_byname_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_time_get_byname > () - 1088usize] ;
    ["Align of template specialization: std_time_get_byname_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_time_get_byname > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug)]
pub struct std___time_put {
    pub __loc_: locale_t,
}
const _: () = {
    ["Size of std___time_put"][::std::mem::size_of::<std___time_put>() - 8usize];
    ["Alignment of std___time_put"][::std::mem::align_of::<std___time_put>() - 8usize];
    ["Offset of field: std___time_put::__loc_"]
        [::std::mem::offset_of!(std___time_put, __loc_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__110__time_put8__do_putEPcRS1_PK2tmcc"]
    pub fn std___time_put___do_put(
        this: *const std___time_put,
        __nb: *mut ::std::os::raw::c_char,
        __ne: *mut *mut ::std::os::raw::c_char,
        __tm: *mut tm,
        __fmt: ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__110__time_put8__do_putEPwRS1_PK2tmcc"]
    pub fn std___time_put___do_put1(
        this: *const std___time_put,
        __wb: *mut u32,
        __we: *mut *mut u32,
        __tm: *mut tm,
        __fmt: ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_putC1EPKc"]
    pub fn std___time_put___time_put(
        this: *mut std___time_put,
        __nm: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_putC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std___time_put___time_put1(this: *mut std___time_put, __nm: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__110__time_putD1Ev"]
    pub fn std___time_put___time_put_destructor(this: *mut std___time_put);
}
impl std___time_put {
    #[inline]
    pub unsafe fn __do_put(
        &self,
        __nb: *mut ::std::os::raw::c_char,
        __ne: *mut *mut ::std::os::raw::c_char,
        __tm: *mut tm,
        __fmt: ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    ) {
        std___time_put___do_put(self, __nb, __ne, __tm, __fmt, __mod)
    }
    #[inline]
    pub unsafe fn __do_put1(
        &self,
        __wb: *mut u32,
        __we: *mut *mut u32,
        __tm: *mut tm,
        __fmt: ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    ) {
        std___time_put___do_put1(self, __wb, __we, __tm, __fmt, __mod)
    }
    #[inline]
    pub unsafe fn new(__nm: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___time_put___time_put(__bindgen_tmp.as_mut_ptr(), __nm);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__nm: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___time_put___time_put1(__bindgen_tmp.as_mut_ptr(), __nm);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___time_put___time_put_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_time_put {
    pub _base: std_locale_facet,
    pub _base_1: std___time_put,
}
pub type std_time_put_char_type<_CharT> = _CharT;
pub type std_time_put_iter_type<_OutputIterator> = _OutputIterator;
const _: () = {
    ["Size of template specialization: std_time_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_time_put > () - 24usize] ;
    ["Align of template specialization: std_time_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_time_put > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_time_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_time_put > () - 24usize] ;
    ["Align of template specialization: std_time_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_time_put > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug)]
pub struct std_time_put_byname {
    pub _base: std_time_put,
}
const _: () = {
    ["Size of template specialization: std_time_put_byname_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_time_put_byname > () - 24usize] ;
    ["Align of template specialization: std_time_put_byname_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_time_put_byname > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_time_put_byname_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_time_put_byname > () - 24usize] ;
    ["Align of template specialization: std_time_put_byname_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_time_put_byname > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_money_base {
    pub _address: u8,
}
pub const std_money_base_part_none: std_money_base_part = 0;
pub const std_money_base_part_space: std_money_base_part = 1;
pub const std_money_base_part_symbol: std_money_base_part = 2;
pub const std_money_base_part_sign: std_money_base_part = 3;
pub const std_money_base_part_value: std_money_base_part = 4;
pub type std_money_base_part = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_money_base_pattern {
    pub field: [::std::os::raw::c_char; 4usize],
}
const _: () = {
    ["Size of std_money_base_pattern"][::std::mem::size_of::<std_money_base_pattern>() - 4usize];
    ["Alignment of std_money_base_pattern"]
        [::std::mem::align_of::<std_money_base_pattern>() - 1usize];
    ["Offset of field: std_money_base_pattern::field"]
        [::std::mem::offset_of!(std_money_base_pattern, field) - 0usize];
};
const _: () = {
    ["Size of std_money_base"][::std::mem::size_of::<std_money_base>() - 1usize];
    ["Alignment of std_money_base"][::std::mem::align_of::<std_money_base>() - 1usize];
};
pub type std_moneypunct_char_type<_CharT> = _CharT;
pub type std_moneypunct_string_type = std_basic_string;
extern "C" {
    #[link_name = "\u{1}intl"]
    pub static std_intl: bool;
}
pub type std_moneypunct_byname_pattern = std_money_base_pattern;
pub type std_moneypunct_byname_char_type<_CharT> = _CharT;
pub type std_moneypunct_byname_string_type = std_basic_string;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___money_get {
    pub _address: u8,
}
pub type std___money_get_char_type<_CharT> = _CharT;
pub type std___money_get_string_type = std_basic_string;
const _: () = {
    ["Size of template specialization: std___money_get_open0_char_close0"]
        [::std::mem::size_of::<std___money_get>() - 1usize];
    ["Align of template specialization: std___money_get_open0_char_close0"]
        [::std::mem::align_of::<std___money_get>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___money_get_open0_wchar_t_close0"]
        [::std::mem::size_of::<std___money_get>() - 1usize];
    ["Align of template specialization: std___money_get_open0_wchar_t_close0"]
        [::std::mem::align_of::<std___money_get>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_money_get {
    pub _base: std_locale_facet,
}
pub type std_money_get_char_type<_CharT> = _CharT;
pub type std_money_get_iter_type<_InputIterator> = _InputIterator;
pub type std_money_get_string_type = std_basic_string;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112__do_nothingEPv"]
    pub fn std___do_nothing(arg1: *mut ::std::os::raw::c_void);
}
const _: () = {
    ["Size of template specialization: std_money_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_money_get > () - 16usize] ;
    ["Align of template specialization: std_money_get_open0_char_std_istreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_money_get > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_money_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_money_get > () - 16usize] ;
    ["Align of template specialization: std_money_get_open0_wchar_t_std_istreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_money_get > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___money_put {
    pub _address: u8,
}
pub type std___money_put_char_type<_CharT> = _CharT;
pub type std___money_put_string_type = std_basic_string;
const _: () = {
    ["Size of template specialization: std___money_put_open0_char_close0"]
        [::std::mem::size_of::<std___money_put>() - 1usize];
    ["Align of template specialization: std___money_put_open0_char_close0"]
        [::std::mem::align_of::<std___money_put>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std___money_put_open0_wchar_t_close0"]
        [::std::mem::size_of::<std___money_put>() - 1usize];
    ["Align of template specialization: std___money_put_open0_wchar_t_close0"]
        [::std::mem::align_of::<std___money_put>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_money_put {
    pub _base: std_locale_facet,
}
pub type std_money_put_char_type<_CharT> = _CharT;
pub type std_money_put_iter_type<_OutputIterator> = _OutputIterator;
pub type std_money_put_string_type = std_basic_string;
const _: () = {
    ["Size of template specialization: std_money_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: size_of :: < std_money_put > () - 16usize] ;
    ["Align of template specialization: std_money_put_open0_char_std_ostreambuf_iterator_open1_char_std_char_traits_open2_char_close2_close1_close0"] [:: std :: mem :: align_of :: < std_money_put > () - 8usize] ;
};
const _: () = {
    ["Size of template specialization: std_money_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: size_of :: < std_money_put > () - 16usize] ;
    ["Align of template specialization: std_money_put_open0_wchar_t_std_ostreambuf_iterator_open1_wchar_t_std_char_traits_open2_wchar_t_close2_close1_close0"] [:: std :: mem :: align_of :: < std_money_put > () - 8usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_messages_base {
    pub _address: u8,
}
pub type std_messages_base_catalog = ::std::os::raw::c_long;
const _: () = {
    ["Size of std_messages_base"][::std::mem::size_of::<std_messages_base>() - 1usize];
    ["Alignment of std_messages_base"][::std::mem::align_of::<std_messages_base>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_messages {
    pub _base: std_locale_facet,
}
pub type std_messages_char_type<_CharT> = _CharT;
pub type std_messages_string_type = std_basic_string;
const _: () = {
    ["Size of template specialization: std_messages_open0_char_close0"]
        [::std::mem::size_of::<std_messages>() - 16usize];
    ["Align of template specialization: std_messages_open0_char_close0"]
        [::std::mem::align_of::<std_messages>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_messages_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_messages>() - 16usize];
    ["Align of template specialization: std_messages_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_messages>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_messages_byname {
    pub _base: std_messages,
}
pub type std_messages_byname_catalog = std_messages_base_catalog;
pub type std_messages_byname_string_type = std_basic_string;
const _: () = {
    ["Size of template specialization: std_messages_byname_open0_char_close0"]
        [::std::mem::size_of::<std_messages_byname>() - 16usize];
    ["Align of template specialization: std_messages_byname_open0_char_close0"]
        [::std::mem::align_of::<std_messages_byname>() - 8usize];
};
const _: () = {
    ["Size of template specialization: std_messages_byname_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_messages_byname>() - 16usize];
    ["Align of template specialization: std_messages_byname_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_messages_byname>() - 8usize];
};
#[repr(C)]
pub struct std_wstring_convert<_Codecvt> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Codecvt>>,
    pub __byte_err_string_: std_wstring_convert_byte_string,
    pub __wide_err_string_: std_wstring_convert_wide_string,
    pub __cvtptr_: *mut _Codecvt,
    pub __cvtstate_: std_wstring_convert_state_type,
    pub __cvtcount_: ::std::os::raw::c_ulong,
}
pub type std_wstring_convert_byte_string = std_basic_string;
pub type std_wstring_convert_wide_string = std_basic_string;
pub type std_wstring_convert_state_type = [u8; 0usize];
pub type std_wstring_convert_int_type = std_wstring_convert_wide_string;
#[repr(C)]
pub struct std_wbuffer_convert<_Codecvt, _Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Codecvt>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _base: std_basic_streambuf<_Elem>,
    pub __extbuf_: *mut ::std::os::raw::c_char,
    pub __extbufnext_: *const ::std::os::raw::c_char,
    pub __extbufend_: *const ::std::os::raw::c_char,
    pub __extbuf_min_: [::std::os::raw::c_char; 8usize],
    pub __ebs_: ::std::os::raw::c_ulong,
    pub __intbuf_: *mut std_wbuffer_convert_char_type<_Elem>,
    pub __ibs_: ::std::os::raw::c_ulong,
    pub __bufptr_: *mut std_streambuf,
    pub __cv_: *mut _Codecvt,
    pub __st_: std_wbuffer_convert_state_type,
    pub __cm_: std_ios_base_openmode,
    pub __owns_eb_: bool,
    pub __owns_ib_: bool,
    pub __always_noconv_: bool,
}
pub type std_wbuffer_convert_char_type<_Elem> = _Elem;
pub type std_wbuffer_convert_traits_type<_Tr> = _Tr;
pub type std_wbuffer_convert_int_type = [u8; 0usize];
pub type std_wbuffer_convert_pos_type = [u8; 0usize];
pub type std_wbuffer_convert_off_type = [u8; 0usize];
pub type std_wbuffer_convert_state_type = [u8; 0usize];
#[repr(C)]
pub struct std___temp_value<_Tp, _Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub __bindgen_anon_1: std___temp_value__bindgen_ty_1<_Tp>,
    pub __a: *mut _Alloc,
}
pub type std___temp_value__Traits = std_allocator_traits;
#[repr(C)]
#[repr(align(1))]
pub struct std___temp_value__bindgen_ty_1<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __v: __BindgenUnionField<_Tp>,
    pub bindgen_union_field: [u8; 0usize],
}
#[repr(C)]
#[derive(Debug)]
pub struct std___split_buffer {
    pub __first_: std___split_buffer_pointer,
    pub __begin_: std___split_buffer_pointer,
    pub __end_: std___split_buffer_pointer,
    pub __end_cap_: std___compressed_pair,
}
pub type std___split_buffer_value_type<_Tp> = _Tp;
pub type std___split_buffer_allocator_type<_Allocator> = _Allocator;
pub type std___split_buffer___alloc_rr<_Allocator> =
    std___libcpp_remove_reference_t<std___split_buffer_allocator_type<_Allocator>>;
pub type std___split_buffer___alloc_traits = std_allocator_traits;
pub type std___split_buffer_reference<_Tp> = *mut std___split_buffer_value_type<_Tp>;
pub type std___split_buffer_const_reference<_Tp> = *const std___split_buffer_value_type<_Tp>;
pub type std___split_buffer_size_type = std___split_buffer___alloc_traits;
pub type std___split_buffer_difference_type = std___split_buffer___alloc_traits;
pub type std___split_buffer_pointer = std___split_buffer___alloc_traits;
pub type std___split_buffer_const_pointer = std___split_buffer___alloc_traits;
pub type std___split_buffer_iterator = std___split_buffer_pointer;
pub type std___split_buffer_const_iterator = std___split_buffer_const_pointer;
pub type std___split_buffer___alloc_ref<_Allocator> =
    std___add_lvalue_reference_t<std___split_buffer_allocator_type<_Allocator>>;
pub type std___split_buffer___alloc_const_ref<_Allocator> =
    std___add_lvalue_reference_t<std___split_buffer_allocator_type<_Allocator>>;
#[repr(C)]
#[derive(Debug)]
pub struct std___split_buffer__ConstructTransaction {
    pub __pos_: std___split_buffer_pointer,
    pub __end_: std___split_buffer_pointer,
    pub __dest_: *mut std___split_buffer_pointer,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_vector {
    pub __begin_: std_vector_pointer,
    pub __end_: std_vector_pointer,
    pub __end_cap_: std___compressed_pair,
}
pub type std_vector___default_allocator_type = std_allocator;
pub type std_vector___self = std_vector;
pub type std_vector_value_type<_Tp> = _Tp;
pub type std_vector_allocator_type<_Allocator> = _Allocator;
pub type std_vector___alloc_traits = std_allocator_traits;
pub type std_vector_reference<_Tp> = *mut std_vector_value_type<_Tp>;
pub type std_vector_const_reference<_Tp> = *const std_vector_value_type<_Tp>;
pub type std_vector_size_type = std_vector___alloc_traits;
pub type std_vector_difference_type = std_vector___alloc_traits;
pub type std_vector_pointer = std_vector___alloc_traits;
pub type std_vector_const_pointer = std_vector___alloc_traits;
pub type std_vector_iterator = std___wrap_iter<std_vector_pointer>;
pub type std_vector_const_iterator = std___wrap_iter<std_vector_const_pointer>;
pub type std_vector_reverse_iterator = std_reverse_iterator<std_vector_iterator>;
pub type std_vector_const_reverse_iterator = std_reverse_iterator<std_vector_const_iterator>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_vector___destroy_vector {
    pub __vec_: *mut std_vector,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_vector__ConstructTransaction {
    pub __v_: *mut std_vector,
    pub __pos_: std_vector_pointer,
    pub __new_end_: std_vector_const_pointer,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___builtin_new_allocator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___builtin_new_allocator___builtin_new_deleter {
    pub __size_: ::std::os::raw::c_ulong,
    pub __align_: ::std::os::raw::c_ulong,
}
pub type std___builtin_new_allocator___builtin_new_deleter_pointer_type =
    *mut ::std::os::raw::c_void;
const _: () = {
    ["Size of std___builtin_new_allocator___builtin_new_deleter"]
        [::std::mem::size_of::<std___builtin_new_allocator___builtin_new_deleter>() - 16usize];
    ["Alignment of std___builtin_new_allocator___builtin_new_deleter"]
        [::std::mem::align_of::<std___builtin_new_allocator___builtin_new_deleter>() - 8usize];
    ["Offset of field: std___builtin_new_allocator___builtin_new_deleter::__size_"][::std::mem::offset_of!(
        std___builtin_new_allocator___builtin_new_deleter,
        __size_
    ) - 0usize];
    ["Offset of field: std___builtin_new_allocator___builtin_new_deleter::__align_"][::std::mem::offset_of!(
        std___builtin_new_allocator___builtin_new_deleter,
        __align_
    ) - 8usize];
};
pub type std___builtin_new_allocator___holder_t = std_unique_ptr;
const _: () = {
    ["Size of std___builtin_new_allocator"]
        [::std::mem::size_of::<std___builtin_new_allocator>() - 1usize];
    ["Alignment of std___builtin_new_allocator"]
        [::std::mem::align_of::<std___builtin_new_allocator>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_function_call {
    pub _base: std_exception,
}
const _: () = {
    ["Size of std_bad_function_call"][::std::mem::size_of::<std_bad_function_call>() - 8usize];
    ["Alignment of std_bad_function_call"]
        [::std::mem::align_of::<std_bad_function_call>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___maybe_derive_from_unary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___maybe_derive_from_binary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___alloc_func {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___default_alloc_func {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___func {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___value_func {
    pub _address: u8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union std___function___policy_storage {
    pub __small: [::std::os::raw::c_char; 16usize],
    pub __large: *mut ::std::os::raw::c_void,
}
const _: () = {
    ["Size of std___function___policy_storage"]
        [::std::mem::size_of::<std___function___policy_storage>() - 16usize];
    ["Alignment of std___function___policy_storage"]
        [::std::mem::align_of::<std___function___policy_storage>() - 8usize];
    ["Offset of field: std___function___policy_storage::__small"]
        [::std::mem::offset_of!(std___function___policy_storage, __small) - 0usize];
    ["Offset of field: std___function___policy_storage::__large"]
        [::std::mem::offset_of!(std___function___policy_storage, __large) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___use_small_storage {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___policy {
    pub __clone: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
    >,
    pub __destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __is_null: bool,
    pub __type_info: *const std_type_info,
}
const _: () = {
    ["Size of std___function___policy"][::std::mem::size_of::<std___function___policy>() - 32usize];
    ["Alignment of std___function___policy"]
        [::std::mem::align_of::<std___function___policy>() - 8usize];
    ["Offset of field: std___function___policy::__clone"]
        [::std::mem::offset_of!(std___function___policy, __clone) - 0usize];
    ["Offset of field: std___function___policy::__destroy"]
        [::std::mem::offset_of!(std___function___policy, __destroy) - 8usize];
    ["Offset of field: std___function___policy::__is_null"]
        [::std::mem::offset_of!(std___function___policy, __is_null) - 16usize];
    ["Offset of field: std___function___policy::__type_info"]
        [::std::mem::offset_of!(std___function___policy, __type_info) - 24usize];
};
pub type std___function___fast_forward = std___conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___policy_invoker {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___function___policy_func {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}__Block_copy"]
    pub fn std___function__Block_copy(
        arg1: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}__Block_release"]
    pub fn std___function__Block_release(arg1: *const ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___mem_fn<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub __f_: std___mem_fn_type<_Tp>,
}
pub type std___mem_fn_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun_t<_Sp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub __p_: ::std::option::Option<unsafe extern "C" fn() -> _Sp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun1_t<_Sp, _Ap> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ap>>,
    pub __p_: ::std::option::Option<unsafe extern "C" fn(arg1: _Ap) -> _Sp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun_ref_t<_Sp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub __p_: ::std::option::Option<unsafe extern "C" fn() -> _Sp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun1_ref_t<_Sp, _Ap> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ap>>,
    pub __p_: ::std::option::Option<unsafe extern "C" fn(arg1: _Ap) -> _Sp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun_t<_Sp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub __p_: ::std::option::Option<unsafe extern "C" fn() -> _Sp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun1_t<_Sp, _Ap> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ap>>,
    pub __p_: ::std::option::Option<unsafe extern "C" fn(arg1: _Ap) -> _Sp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun_ref_t<_Sp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub __p_: ::std::option::Option<unsafe extern "C" fn() -> _Sp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun1_ref_t<_Sp, _Ap> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ap>>,
    pub __p_: ::std::option::Option<unsafe extern "C" fn(arg1: _Ap) -> _Sp>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_to_binary_function<_Arg1, _Arg2, _Result> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg2>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
    pub __f_: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg1, arg2: _Arg2) -> _Result>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_to_unary_function<_Arg, _Result> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
    pub __f_: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Result>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unary_negate<_Predicate> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
    pub __pred_: _Predicate,
}
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char16_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char16_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char32_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char32_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
const _: () = {
    ["Size of template specialization: std_char_traits_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[repr(C)]
pub struct std_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_exception {
    pub vtable_: *const std_exception__bindgen_vtable,
}
const _: () = {
    ["Size of std_exception"][::std::mem::size_of::<std_exception>() - 8usize];
    ["Alignment of std_exception"][::std::mem::align_of::<std_exception>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt9exceptionD1Ev"]
    pub fn std_exception_exception_destructor(this: *mut std_exception);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt9exception4whatEv"]
    pub fn std_exception_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_exception {
    pub _base: std_exception,
}
const _: () = {
    ["Size of std_bad_exception"][::std::mem::size_of::<std_bad_exception>() - 8usize];
    ["Alignment of std_bad_exception"][::std::mem::align_of::<std_bad_exception>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt13bad_exceptionD1Ev"]
    pub fn std_bad_exception_bad_exception_destructor(this: *mut std_bad_exception);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt13bad_exception4whatEv"]
    pub fn std_bad_exception_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_nothrow_t {
    pub _address: u8,
}
const _: () = {
    ["Size of std_nothrow_t"][::std::mem::size_of::<std_nothrow_t>() - 1usize];
    ["Alignment of std_nothrow_t"][::std::mem::align_of::<std_nothrow_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}__ZSt7nothrow"]
    pub static std_nothrow: std_nothrow_t;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_alloc {
    pub _base: std_exception,
}
const _: () = {
    ["Size of std_bad_alloc"][::std::mem::size_of::<std_bad_alloc>() - 8usize];
    ["Alignment of std_bad_alloc"][::std::mem::align_of::<std_bad_alloc>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt9bad_allocC1Ev"]
    pub fn std_bad_alloc_bad_alloc(this: *mut std_bad_alloc);
}
impl std_bad_alloc {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_bad_alloc_bad_alloc(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt9bad_allocD1Ev"]
    pub fn std_bad_alloc_bad_alloc_destructor(this: *mut std_bad_alloc);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt9bad_alloc4whatEv"]
    pub fn std_bad_alloc_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_array_new_length {
    pub _base: std_bad_alloc,
}
const _: () = {
    ["Size of std_bad_array_new_length"]
        [::std::mem::size_of::<std_bad_array_new_length>() - 8usize];
    ["Alignment of std_bad_array_new_length"]
        [::std::mem::align_of::<std_bad_array_new_length>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt20bad_array_new_lengthC1Ev"]
    pub fn std_bad_array_new_length_bad_array_new_length(this: *mut std_bad_array_new_length);
}
impl std_bad_array_new_length {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_bad_array_new_length_bad_array_new_length(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt20bad_array_new_lengthD1Ev"]
    pub fn std_bad_array_new_length_bad_array_new_length_destructor(
        this: *mut std_bad_array_new_length,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt20bad_array_new_length4whatEv"]
    pub fn std_bad_array_new_length_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
pub type std_new_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}__ZSt15set_new_handlerPFvvE"]
    pub fn std_set_new_handler(arg1: std_new_handler) -> std_new_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt15get_new_handlerv"]
    pub fn std_get_new_handler() -> std_new_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt17__throw_bad_allocv"]
    pub fn std___throw_bad_alloc();
}
pub type std_align_val_t = ::std::os::raw::c_ulong;
pub type std_unexpected_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}__ZSt14set_unexpectedPFvvE"]
    pub fn std_set_unexpected(arg1: std_unexpected_handler) -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt14get_unexpectedv"]
    pub fn std_get_unexpected() -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt10unexpectedv"]
    pub fn std_unexpected();
}
pub type std_terminate_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}__ZSt13set_terminatePFvvE"]
    pub fn std_set_terminate(arg1: std_terminate_handler) -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt13get_terminatev"]
    pub fn std_get_terminate() -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}__ZSt18uncaught_exceptionv"]
    pub fn std_uncaught_exception() -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZSt19uncaught_exceptionsv"]
    pub fn std_uncaught_exceptions() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZSt17current_exceptionv"]
    pub fn std_current_exception() -> std_exception_ptr;
}
extern "C" {
    #[link_name = "\u{1}__ZSt17rethrow_exceptionSt13exception_ptr"]
    pub fn std_rethrow_exception(arg1: std_exception_ptr);
}
#[repr(C)]
#[derive(Debug)]
pub struct std_exception_ptr {
    pub __ptr_: *mut ::std::os::raw::c_void,
}
const _: () = {
    ["Size of std_exception_ptr"][::std::mem::size_of::<std_exception_ptr>() - 8usize];
    ["Alignment of std_exception_ptr"][::std::mem::align_of::<std_exception_ptr>() - 8usize];
    ["Offset of field: std_exception_ptr::__ptr_"]
        [::std::mem::offset_of!(std_exception_ptr, __ptr_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt13exception_ptrC1ERKS_"]
    pub fn std_exception_ptr_exception_ptr(
        this: *mut std_exception_ptr,
        arg1: *const std_exception_ptr,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13exception_ptrD1Ev"]
    pub fn std_exception_ptr_exception_ptr_destructor(this: *mut std_exception_ptr);
}
impl std_exception_ptr {
    #[inline]
    pub unsafe fn new(arg1: *const std_exception_ptr) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_exception_ptr_exception_ptr(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_exception_ptr_exception_ptr_destructor(self)
    }
}
#[repr(C)]
pub struct std_nested_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_nested_exception {
    pub vtable_: *const std_nested_exception__bindgen_vtable,
    pub __ptr_: std_exception_ptr,
}
const _: () = {
    ["Size of std_nested_exception"][::std::mem::size_of::<std_nested_exception>() - 16usize];
    ["Alignment of std_nested_exception"][::std::mem::align_of::<std_nested_exception>() - 8usize];
    ["Offset of field: std_nested_exception::__ptr_"]
        [::std::mem::offset_of!(std_nested_exception, __ptr_) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNKSt16nested_exception14rethrow_nestedEv"]
    pub fn std_nested_exception_rethrow_nested(this: *const std_nested_exception);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt16nested_exceptionC1Ev"]
    pub fn std_nested_exception_nested_exception(this: *mut std_nested_exception);
}
impl std_nested_exception {
    #[inline]
    pub unsafe fn rethrow_nested(&self) {
        std_nested_exception_rethrow_nested(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_nested_exception_nested_exception(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt16nested_exceptionD1Ev"]
    pub fn std_nested_exception_nested_exception_destructor(this: *mut std_nested_exception);
}
#[repr(C)]
#[derive(Debug)]
pub struct std___nested<_Tp> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub _base: _Tp,
    pub _base_1: std_nested_exception,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___can_dynamic_cast {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}__ZSt9terminatev"]
    pub fn std_terminate();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_initializer_list<_Ep> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ep>>,
    pub __begin_: *const _Ep,
    pub __size_: ::std::os::raw::c_ulong,
}
pub type std_initializer_list_value_type<_Ep> = _Ep;
pub type std_initializer_list_reference<_Ep> = *const _Ep;
pub type std_initializer_list_const_reference<_Ep> = *const _Ep;
pub type std_initializer_list_size_type = ::std::os::raw::c_ulong;
pub type std_initializer_list_iterator<_Ep> = *const _Ep;
pub type std_initializer_list_const_iterator<_Ep> = *const _Ep;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_info_implementations {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_info_implementations___string_impl_base {
    pub _address: u8,
}
pub type std___type_info_implementations___string_impl_base___type_name_t =
    *const ::std::os::raw::c_char;
const _: () = {
    ["Size of std___type_info_implementations___string_impl_base"]
        [::std::mem::size_of::<std___type_info_implementations___string_impl_base>() - 1usize];
    ["Alignment of std___type_info_implementations___string_impl_base"]
        [::std::mem::align_of::<std___type_info_implementations___string_impl_base>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_info_implementations___unique_impl {
    pub _address: u8,
}
const _: () = {
    ["Size of std___type_info_implementations___unique_impl"]
        [::std::mem::size_of::<std___type_info_implementations___unique_impl>() - 1usize];
    ["Alignment of std___type_info_implementations___unique_impl"]
        [::std::mem::align_of::<std___type_info_implementations___unique_impl>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_info_implementations___non_unique_impl {
    pub _address: u8,
}
const _: () = {
    ["Size of std___type_info_implementations___non_unique_impl"]
        [::std::mem::size_of::<std___type_info_implementations___non_unique_impl>() - 1usize];
    ["Alignment of std___type_info_implementations___non_unique_impl"]
        [::std::mem::align_of::<std___type_info_implementations___non_unique_impl>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_info_implementations___non_unique_arm_rtti_bit_impl {
    pub _address: u8,
}
pub type std___type_info_implementations___non_unique_arm_rtti_bit_impl___type_name_t =
    ::std::os::raw::c_ulong;
pub type std___type_info_implementations___non_unique_arm_rtti_bit_impl___non_unique_rtti_bit = u8;
const _: () = {
    ["Size of std___type_info_implementations___non_unique_arm_rtti_bit_impl"][::std::mem::size_of::<
        std___type_info_implementations___non_unique_arm_rtti_bit_impl,
    >() - 1usize];
    ["Alignment of std___type_info_implementations___non_unique_arm_rtti_bit_impl"]
        [::std::mem::align_of::<std___type_info_implementations___non_unique_arm_rtti_bit_impl>()
            - 1usize];
};
pub type std___type_info_implementations___impl =
    std___type_info_implementations___non_unique_arm_rtti_bit_impl;
const _: () = {
    ["Size of std___type_info_implementations"]
        [::std::mem::size_of::<std___type_info_implementations>() - 1usize];
    ["Alignment of std___type_info_implementations"]
        [::std::mem::align_of::<std___type_info_implementations>() - 1usize];
};
#[repr(C)]
pub struct std_type_info__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_type_info {
    pub vtable_: *const std_type_info__bindgen_vtable,
    pub __type_name: std___type_info_implementations___non_unique_arm_rtti_bit_impl___type_name_t,
}
pub type std_type_info___impl = std___type_info_implementations___impl;
const _: () = {
    ["Size of std_type_info"][::std::mem::size_of::<std_type_info>() - 16usize];
    ["Alignment of std_type_info"][::std::mem::align_of::<std_type_info>() - 8usize];
    ["Offset of field: std_type_info::__type_name"]
        [::std::mem::offset_of!(std_type_info, __type_name) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt9type_infoD1Ev"]
    pub fn std_type_info_type_info_destructor(this: *mut std_type_info);
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_cast {
    pub _base: std_exception,
}
const _: () = {
    ["Size of std_bad_cast"][::std::mem::size_of::<std_bad_cast>() - 8usize];
    ["Alignment of std_bad_cast"][::std::mem::align_of::<std_bad_cast>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt8bad_castC1Ev"]
    pub fn std_bad_cast_bad_cast(this: *mut std_bad_cast);
}
impl std_bad_cast {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_bad_cast_bad_cast(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt8bad_castD1Ev"]
    pub fn std_bad_cast_bad_cast_destructor(this: *mut std_bad_cast);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt8bad_cast4whatEv"]
    pub fn std_bad_cast_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_typeid {
    pub _base: std_exception,
}
const _: () = {
    ["Size of std_bad_typeid"][::std::mem::size_of::<std_bad_typeid>() - 8usize];
    ["Alignment of std_bad_typeid"][::std::mem::align_of::<std_bad_typeid>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt10bad_typeidC1Ev"]
    pub fn std_bad_typeid_bad_typeid(this: *mut std_bad_typeid);
}
impl std_bad_typeid {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_bad_typeid_bad_typeid(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt10bad_typeidD1Ev"]
    pub fn std_bad_typeid_bad_typeid_destructor(this: *mut std_bad_typeid);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt10bad_typeid4whatEv"]
    pub fn std_bad_typeid_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_logic_error {
    pub _base: std_exception,
    pub __imp_: std___libcpp_refstring,
}
const _: () = {
    ["Size of std_logic_error"][::std::mem::size_of::<std_logic_error>() - 16usize];
    ["Alignment of std_logic_error"][::std::mem::align_of::<std_logic_error>() - 8usize];
    ["Offset of field: std_logic_error::__imp_"]
        [::std::mem::offset_of!(std_logic_error, __imp_) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt11logic_errorC1ERKNSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEE"]
    pub fn std_logic_error_logic_error(this: *mut std_logic_error, arg1: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt11logic_errorC1EPKc"]
    pub fn std_logic_error_logic_error1(
        this: *mut std_logic_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt11logic_errorC1ERKS_"]
    pub fn std_logic_error_logic_error2(this: *mut std_logic_error, arg1: *const std_logic_error);
}
impl std_logic_error {
    #[inline]
    pub unsafe fn new(arg1: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *const std_logic_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt11logic_errorD1Ev"]
    pub fn std_logic_error_logic_error_destructor(this: *mut std_logic_error);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt11logic_error4whatEv"]
    pub fn std_logic_error_what(this: *mut ::std::os::raw::c_void)
        -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_runtime_error {
    pub _base: std_exception,
    pub __imp_: std___libcpp_refstring,
}
const _: () = {
    ["Size of std_runtime_error"][::std::mem::size_of::<std_runtime_error>() - 16usize];
    ["Alignment of std_runtime_error"][::std::mem::align_of::<std_runtime_error>() - 8usize];
    ["Offset of field: std_runtime_error::__imp_"]
        [::std::mem::offset_of!(std_runtime_error, __imp_) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}__ZNSt13runtime_errorC1ERKNSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEE"]
    pub fn std_runtime_error_runtime_error(this: *mut std_runtime_error, arg1: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13runtime_errorC1EPKc"]
    pub fn std_runtime_error_runtime_error1(
        this: *mut std_runtime_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13runtime_errorC1ERKS_"]
    pub fn std_runtime_error_runtime_error2(
        this: *mut std_runtime_error,
        arg1: *const std_runtime_error,
    );
}
impl std_runtime_error {
    #[inline]
